{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "1767346377",
    "original_query": "In the last few days, the stock price of \"Privi Speciality Chemicals\" on NSE has tanked, I want you to find our why, and whether people are saying it will bounce back. Should I be concerned? ",
    "file_manifest": [],
    "created_at": "2026-01-02T09:32:58.300379",
    "status": "completed",
    "globals_schema": {
      "news_articles_T001": {
        "content": [
          {
            "type": "text",
            "text": [
              {
                "url": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html",
                "content": "Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Get App Open In App Enjoy seamless experience on APP 10x faster & More Feature Get App Go PRO Now Open App Search Quotes, News, Mutual Fund NAVs Quotes Mutual Funds Commodities Futures & Options Currency News Topic Cryptocurrency Forum Notices Videos Glossary All Auri ferous Aqua Farma, 519363 Get App / Open App Home PRO Markets News Budget 2026 Editors Picks Tech India Learning Curve Portfolio Watchlist Commodities MF PF Forum Videos Invest Now Invest in Cryptoassets Powered by Invest in Unlisted stocks Powered by Home News Business Markets Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Trending Topics Sensex Today Cigarette Stocks Time Technoplast Shares ITC Share Price TVS Motor Share Price Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality share price: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93% stake in the company, changed hands in a large transaction, CNBC-TV18 reported. Debaroti Adhikary December 31, 2025 / 11:54 IST Story continues below Advertisement Remove Ad Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality Chemicals shares dropped almost 14% after a major transaction. 38.8 lakh shares, 9.93% stake, changed hands at Rs 2,799 per share The transaction price was 12% below the previous closing price Did our AI summary help? HKA HKA Watchlist Portfolio Message Follow NSE/BSE Select NSE LIVE BSE LIVE Trade Day High Day Low Volume (NSE) More Add to Watchlist The shares of Privi Speciality Chemicals fell nearly 14 percent on December 31 after the stock saw a large transaction taking place on exchanges. The shares of the manufacturer, supplier and exporter of aroma and fragrance chemicals dropped to Rs 2,751 apiece in the morning trading hours of Wednesday. Story continues below Advertisement Remove Ad Privi Speciality Chemicals large transaction: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93 percent stake in the company, changed hands in a large transaction, CNBC-TV18 quoted official data as saying. It added that the shares were traded at an average price of Rs 2,799 per share, taking the total value of the transaction to Rs 1,086 crore. The reported price at which the transaction was carried out represents a 12 percent discount from the stocks previous closing price of Rs 3,190.50 apiece. Story continues below Advertisement Remove Ad Related Stories GST cut sparks comeback of entry-level cars and bikes Olectra Greentech shares jump 6% as operations begin at Hyderabad EV plant; JBM Auto up 8% 2025 added returns, not acceleration, to Indian equity compounding Notably, this comes a day after the business news channel reported that a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32 percent stake in the company via a block deal. Privi Speciality Chemicals shareholding pattern: According to data on the company's shareholding pattern as at the end of September 2025, promoter and promoter groups held nearly 70 percent stake in the company while the rest of the 30 percent was owned by public. Story continues below Advertisement Remove Ad Among the public shareholders, SBI Multi Asset Allocation Fund held the largest individual shareholding at 3.64 percent. Privi Speciality Chemicals share price: Privi Speciality Chemicals shares have fallen around 11 percent in the past one month, but gained around 24 percent in the past six months. The stock is so far up more than 57 percent in 2025 so far, but is set for its worst one-day drop since May 2022 today. After hitting a 52-week low of Rs 1,368.15 apiece in March this year, the stock rapidly rallied more than 151 percent in around eight months to hit a fresh 52-week high of Rs 3,440.50 apiece in November this year. The stock currently has a P/E ratio of more than 59, and a market",
                "images": [],
                "rank": 1
              },
              {
                "url": "https://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html",
                "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html\" on this server. Reference #18.d4d70b17.1767346419.ea283892 https://errors.edgesuite.net/18.d4d70b17.1767346419.ea283892",
                "images": [],
                "rank": 2
              },
              {
                "url": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/",
                "content": "Why Privi Speciality Chemicals shares are falling over 9% today explained | Business Upturn Business Stock Market Sectors Finance Technology Sports Nation India United States Asia Search Business Corporates SMEs Startups Funding Marketing Blog Stock Market Stock Market Brokerages Quarterly Results Asian Markets US Market Finance Stock Market Personal Finance Mutual Funds IPO Money Market Cryptocurrency Economy Policy Taxation Tech AI Gadgets Internet Gaming Science Apps Social Media Cyber Security Sports Cricket Soccer Tennis Hockey Badminton WWE Kabaddi NBA Formula 1 Entertainment Celebrity Movies Reviews Box-Office Television OTT Music International Sectors Commodities Fintech Banking Retail Auto Telecom Defence Energy Real Estate Health Agriculture Lifestyle Beauty Fashion Books Culture Food Fitness Living Parenting Relationship Travel Wellness More India USA Asia World STOCK MARKET Why Privi Speciality Chemicals shares are falling over 9% today explained By Aditya Bhagchandani Last updated on December 31, 2025 9:12 AM IST Reading Mode 2 min read Wednesday, December 31: Shares of Privi Speciality Chemicals Ltd came under sharp selling pressure on Wednesday, plunging over 9% intraday on the NSE, after reports emerged of a large stake sale via block deal . The stock was trading around Rs 2,900 , down more than 9% , as investors reacted to the potential supply overhang in the counter. Block deal trigger behind the fall According to sources cited by CNBC-TV18 , a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32% stake in the company through a block deal. The total size of the transaction is estimated at around Rs 700 crore . The floor price for the deal has been fixed in the range of Rs 2,8352,850 per share , which implies a discount of about 11.14% to the current market price. Such a steep discount typically puts immediate pressure on the stock, as traders factor in near-term downside and increased supply. Promoter stake sale history adds to caution Market participants are also recalling that promoter entities had sold a combined 4.09% stake in Privi Speciality Chemicals in June 2025 for around Rs 330 crore through open market transactions. The recurring stake dilution has made investors cautious, especially in the short term. The promoters involved in the earlier sale included Bhaktavatsala Rao Doppalapudi, Vijaykumar Doppalapudi, Vinaykumar Doppalapudi Rao and Vivira Investment and Trading , as per NSE bulk deal data. Long-term fundamentals remain intact Despite todays sharp fall, brokerage commentary on the stock remains positive. Motilal Oswal Wealth Management recently included Privi Speciality Chemicals in its top 10 stock picks for 2026 , citing strong growth prospects in the global aroma chemicals market, which is expected to reach $9.2 billion by 2030 . The brokerage has highlighted capacity expansion plans and the proposed merger with Privi Fine Sciences , which are expected to strengthen the companys green chemistry and high-margin portfolio. Motilal Oswal has valued the stock at Rs 3,960 , implying nearly 21% upside from current levels. Bottom line Privi Speciality Chemicals shares are down sharply not due to business fundamentals , but because of near-term selling pressure linked to a large block deal at a discount . Investors are watching closely to see how the stake sale plays out and whether the stock stabilises once the transaction is absorbed by the market. More from Stock Market Stock Market Why Dynacons Systems & Solutions shares jumped over 7% today explained Dec 31, 2025 - 9:17 AM IST Stock Market Why ZF Steering Gear India shares are up over 4% today explained Dec 31, 2025 - 9:14 AM IST Stock Market Why are Eternal (Zomato) shares falling nearly 3% today? Explained Dec 31, 2025 - 9:13 AM IST Stock Market Indian Stock Market LIVE Today: Nifty, Sensex set for flat start; JSW Steel, IndiGo, Bharat Forge in focus Dec 31, 2025 - 9:00 AM IST Stock Market Nifty, Sensex set for flat op",
                "images": [],
                "rank": 3
              },
              {
                "url": "https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642",
                "content": "Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Home News Create Screeners Insights ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal 1 min read Updated on 30 Dec 2025, 08:34 PM Reviewed by Riya D ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals experienced a 13% share price decline following the execution of a major block deal worth 1,086 crores involving 38.8 lakh shares at 2,799 per share. The transaction, representing 9.93% of outstanding equity, significantly exceeded the initially planned 700 crore deal size and was executed below the indicated price range, demonstrating expanded promoter divestment despite the company's strong 65% annual performance. *this image is generated using AI for illustrative purposes only. Privi Speciality Chemicals shares declined as much as 13.00% following the execution of a major block deal worth 1,086.00 crores. The transaction involved 38.80 lakh shares, representing 9.93% of the company's outstanding equity, executed at an average price of 2,799.00 per share. Block Deal Execution and Market Impact The completed transaction exceeded the initially announced deal parameters, demonstrating significant institutional participation: Transaction Parameter: Final Execution Details Total Value: 1,086.00 crores Shares Traded: 38.80 lakh shares Average Price: 2,799.00 per share Equity Stake: 9.93% Market Reaction: -13.00% decline Current Trading Price: 2,794.30 The execution price of 2,799.00 per share came below the initially indicated price range of 2,835.00 to 2,850.00, representing an 11.10% discount to the previous day's closing price. Transaction Scale Evolution The actual block deal significantly exceeded initial projections: Comparison Metrics: Initial Plan Final Execution Deal Value: 700.00 crores 1,086.00 crores Shares Involved: Up to 6.30% stake 38.80 lakh shares Stake Percentage: 6.30% 9.93% Price Range: 2,835.00-2,850.00 2,799.00 The substantial increase in transaction size from 700.00 crores to 1,086.00 crores indicates expanded divestment by the promoter entity. Shareholding Structure The company maintains a concentrated ownership structure with strong promoter presence: Shareholder Category: Stake Percentage Promoters: 69.89% Mutual Funds: 3.91% SBI MF: 3.64% Retail Shareholders: 8.70% Large Retail: 6.67% Promoters held 69.89% stake as of the September quarter, with over 26,000 retail shareholders holding up to 2.00 lakh authorized share capital maintaining an 8.70% stake. Performance Context Despite the current decline, the stock maintains strong annual performance: Performance Metrics: Current Status Annual Returns: +65.00% Market Capitalization: 12,392.10 crores Sector: Chemicals Market Segment: Mid Cap Best Performance Since: 2021 (+240%) The stock has gained 65.00% in the current calendar year, marking its best performance since 2021 when it recorded gains of over 240.00%. Historical Stock Returns for Privi Speciality Chemicals 1 Day 5 Days 1 Month 6 Months 1 Year 5 Years - 0. 97 % - 17. 50 % - 12. 14 % + 21. 73 % + 55. 00 % + 414. 29 % Privi Speciality Chemicals View in Depth 16 Read Next Article ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Board Approves Fresh Amalgamation Scheme 2 min read Updated on 15 Nov 2025, 12:47 PM Reviewed by Radhika S ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals has approved a comprehensive amalgamation scheme involving its subsidiaries Privi Fine Sciences and Privi Biotechnologies, following withdrawal of an earlier scheme. The Board-approved restructuring includes specific share exchange ratios, independent valuations, and aims to create operational synergies while enhancing market competitiveness through consolidated operations. *this image is generated using",
                "images": [],
                "rank": 4
              },
              {
                "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-ltd-hits-intraday-low-amid-price-pressure-3775941",
                "content": "Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Stocks in Action News Home Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium The Mojo Times Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium Home News Stocks in Action Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Dec 31 2025 09:41 AM IST share Share Via Privi Speciality Chemicals Ltd experienced significant intraday weakness on 31 Dec 2025, with its stock price touching a low of Rs 2,752.6, marking a 13.23% decline from the previous close. The stock underperformed its sector and broader market indices, reflecting immediate selling pressure despite a generally positive market environment. Intraday Price Movement and Market Context On the trading day, Privi Speciality Chemicals Ltd opened sharply lower, down 8.36% from its prior close, setting a negative tone early in the session. The stock continued to slide, reaching its intraday low of Rs 2,752.6, representing a 13.23% drop. This decline was notably steeper than the sectors performance, with the stock underperforming the Specialty Chemicals sector by 12.67% on the day. In contrast, the broader market showed resilience. The Sensex opened 118.50 points higher and traded at 84,830.41, up 0.18%, maintaining a position close to its 52-week high of 86,159.02, just 1.57% away. The Sensexs bullish technical setup was evident as it traded above its 50-day moving average, which itself was positioned above the 200-day moving average. Small-cap stocks led the market rally, with the BSE Small Cap index gaining 0.52% on the day. Despite this positive market backdrop, Privi Speciality Chemicals Ltds share price faced downward pressure, diverging from the broader indices and sector trends. Technical Indicators and Moving Averages The stocks technical positioning showed mixed signals. While the price remained above its 100-day and 200-day moving averages, it was trading below its shorter-term moving averages, including the 5-day, 20-day, and 50-day averages. This suggests that recent momentum has weakened, with short-term trends exerting downward pressure despite longer-term support levels holding firm. The gap down opening and subsequent decline below key short-term averages indicate that sellers dominated early trading, possibly triggered by profit-taking or other immediate factors impacting sentiment. Performance Comparison Over Various Timeframes Examining Privi Speciality Chemicals Ltds performance over multiple periods highlights the contrast between recent weakness and longer-term strength. The stocks one-day return was -11.55%, significantly lagging the Sensexs 0.17% gain. Over the past week, the stock declined 16.33%, compared to a 0.69% drop in the Sensex. The one-month performance also showed underperformance, with the stock down 11.06% versus the Sensexs 0.96% decline. However, over longer horizons, Privi Speciality Chemicals Ltd has delivered robust returns. The three-month gain stands at 18.91%, well above the Sensexs 4.73%. The one-year and year-to-date returns are both 58.61%, significantly outperforming the Sensexs 8.55%. Over three, five, and ten years, the stock has delivered compounded growth of 146.32%, 428.06%, and 1005.97% respectively, compared to the Sensexs 39.41%, 77.62%, and 224.75% over the same periods. Under the radar no more! This Large Cap from Cement is emerging from turnaround with solid fundamentals intact. Discover it while it's still relatively hidden! - Hidden turnaround gem - Solid fundamentals confirmed - Large Cap opportunity Discover This Hidden Gem Mojo Score and Rating Update Privi Speciality Chemicals Ltd holds a Mojo Score of 70.0, reflecting a positive overall assessment of the companys fundamentals and market position. The Mojo Grade was upgraded from Hold to Buy on 13 Oct 2025, indica",
                "images": [],
                "rank": 5
              }
            ],
            "annotations": null
          }
        ]
      },
      "forum_discussions_T002": {
        "content": [
          {
            "type": "text",
            "text": [
              {
                "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-stock-declines-6-61-amid-broader-market-downturn-1735879",
                "content": "Privi Speci. at Day Low Even weak stocks have their moments. Is this being tracked by our systems? NEW Stock belongs to [Strategy Name] Strategy Privi Speci. Industry: Public Sector Bank Market Cap: Mid Cap Date of Entry 31 Oct 25 Entry Price(INR) 136.95 Return 9.82% BSE500 Return 0.73% We add 2-5 new stocks every week Unlock Strategy Miss Premium 100% Secure No credit card required Stocks Portfolios Markets Webinars Wealth Sign Up For FREE THE MOJO TIMES Latest LOGIN Home Stocks Top Mojo Stocks Hidden Turnarounds Reliable Performers MomentumNow Stocks Stock of the Week NEW Stock of the Month Screener Stock Research Research Reports Switcher Report Trading Calls Portfolios Personal Portfolios Your Watchlist Markets Markets Today Earnings News IPO Webinars Upcoming Webinars Previous Recordings Blogs Media Centre Subscribe at Preferred rates Wealth THE MOJO TIMES Latest PREMIUM My Profile Reset Password Feedback My Feedback Logout THE MOJO TIMES STOCKS IN ACTION STOCK RECOMMENDATION RESULT ANALYSIS ACROSS THE WEB STOCK MARKET NEWS MOJO PREMIUM Home News Stocks in Action Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Apr 07 2025 09:46 AM IST share Privi Speciality Chemicals' shares fell significantly today, underperforming the chemicals sector. The stock has faced consecutive losses over the past three days but has shown resilience with a monthly gain. However, its three-month performance has been less favorable compared to the broader market, reflecting cautious sentiment. Privi Speciality Chemicals has experienced a significant decline today, with shares dropping by 6.61%. This midcap company, part of the chemicals industry, has underperformed compared to its sector, which has seen a decrease of 4.83%. The stock opened with a notable gap down of 20.04%, reaching an intraday low of Rs 1397.5. Over the past three days, Privi has faced consecutive losses, totaling a decline of 10.09%. Despite today's downturn, the stock has shown resilience over the past month, with a gain of 7.22%, contrasting with the Sensex's decline of 2.26% during the same period. However, over the last three months, Privi's performance has been less favorable, with a drop of 13.72%, while the Sensex fell by 7.09%. In terms of moving averages, Privi's stock price is currently above the 20-day, 50-day, and 200-day moving averages but below the 5-day and 100-day averages. The overall market sentiment remains cautious, as the Sensex is trading below its 50-day moving average and is nearing its 52-week low.    (%) | Vol: (%) Related Stock Links Analysis Technicals Quality Valuation Financial Trend Return Analysis Price Analysis Quarterly Result Analysis Half-Yearly Result Analysis Nine Monthly Result Analysis Annual Results Balance Sheet Profit & Loss Cash Flow News Announcements Share Holding Peer Comparison Our Weekly And Monthly Stock Recommendations Are Here Loading... Related News Privi Speciality Chemicals Ltd Sees Technical Momentum Shift Amid Volatile Trading Jan 01 2026 08:07 AM IST share Privi Speciality Chemicals Downgraded to Hold Amid Mixed Technical and Valuation Signals Jan 01 2026 08:06 AM IST share Why is Privi Speciality Chemicals Ltd falling/rising? Jan 01 2026 01:42 AM IST share Privi Speciality Chemicals Ltd Sees Sharp Value Turnover Amid Steep Price Decline Dec 31 2025 10:00 AM IST share Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Dec 31 2025 09:41 AM IST share Privi Speciality Chemicals Ltd Opens with Weak Start, Significant Gap Down Amid Market Concerns Dec 31 2025 09:40 AM IST share Privi Speciality Chemicals Ltd is Rated Buy Dec 29 2025 10:10 AM IST share Most Read Callista Industries Ltd Stock Hits Record High of Rs.118 on 2 Jan 2026 17 minutes ago share SMT Engineering Ltd Stock Hits All-Time High at Rs.203.6 25 minutes ago share Cholamandalam Investment & Finance Company Ltd Hits",
                "images": [],
                "rank": 1
              },
              {
                "url": "https://stocktwits.com/symbol/PRIVISCL.NSE/sentiment",
                "content": "Privi Speciality Chemicals Ltd. (PRIVISCL) sentiment score, message volume, participation score and buzz level Use App Trending News Earnings Newsletters Work With Us All Loading... Loading... Loading... Loading... home Symbol PRIVISCL.NSE PRIVISCL.NSE Privi Speciality Chemicals Ltd. 44 Loading... Loading... Feed News Sentiment Fundamentals Info Sentiment Indicates whether most users posting on a symbols stream over the last 24 hours are fearful or greedy. 0 25 50 75 100 Extreme Fear Neutral Greed Extreme Fear Greed N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Message Volume Measures the total amount of chatter on a stream over the last 24 hours. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Participation Ratio Measures the number of unique accounts posting on a stream relative to the number of total messages on that stream. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Latest PRIVISCL.NSE News View Advertisement | Remove ads. Advertisement | Remove ads. Advertisement | Remove ads. Watchlist Trending News Explore Community Profile",
                "images": [],
                "rank": 2
              },
              {
                "url": "https://finance.yahoo.com/quote/PRIVISCL.NS/community/",
                "content": "Oops, something went wrong Tesla's sales outlook is darkening, despite Musk's self-driving euphoria (Bloomberg) The K-shaped consumer is 'alive and well' and testing the US economy The biggest changes for retirees and retirement savers in 2026 Jerome Powell mostly held the Fed together last year. That may get harder in 2026 These stocks are the markets biggest winners and losers in 2025 (Bloomberg) 'Kindness matters': Wall Street reacts to Warren Buffett's last day as Berkshire Hathaway's CEO as he hands the reins over to Greg Abel. Stocks capped a roller-coaster 2025 by notching double-digit gains, as the AI trade powered markets once again. Mortgage rates end 2025 at fresh low, giving buyers an 'encouraging sign' into new year Bitcoin is capping a year defined by a surge to record highs followed by a dramatic crash. Here's what could come next. Stocks ticked higher at Wednesday's open, with Wall Street on track to celebrate double-digit gains in 2025 Soaring stocks, the return of Trump, and the AI boom capped a wild year for markets. Here's a look back at the biggest moments. US tariff rates are at 80-year highs. And the global economy may have to start learning to live with American protectionism. Take one final check in with Warren Buffett's favorite stock market indicator before he hands over the reigns at Berkshire. Gold and silver rebounded after a sharp sell-off, fueling optimism that the precious metals' historic rally may have room to run. Dow, S&P 500, Nasdaq slip as stocks struggle for gains in last stretch of 2025 Cutting rates in December was a close call, the minutes showed. Some officials suggested it could be 'some time' before another one. The automaker previewed a decline in its fourth-quarter sales a figure that would be a steeper drop than analyst estimates. Stocks wavered at the open, with Wall Street awaiting the release of the Fed's meeting minutes for any clues on its next move Gold and silver plunged, as precious metals pulled back from a historic rally. Here's what's driving the sudden reversal. Every Wall Street analyst now predicts a stock rally will come in 2026 (Bloomberg) Dow, S&P 500, Nasdaq slip as Santa Claus rally stumbles amid Nvidia, Tesla slide 'Homebuyer momentum is building': Pending home sales are up, buoyed by lower mortgage rates and more inventory SoftBank to pay $4 billion for data center firm DigitalBridge (Bloomberg) The S&P 500 and Nasdaq slid at the open, as Nvidia and Tesla led tech lower to begin 2025's final stretch The tenuous peace between Trump and the $30 trillion US bond market 'I don't see a bubble': Why Wall Street thinks the stock market can keep climbing even as AI anxiety grows Making fortunes and letting it ride: 13 New Year investing resolutions Banking predictions for 2026: 5 ways the industry will evolve next year These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says Stocks sit near record highs as a 'Santa Claus rally' builds and 2026 approaches. Here's what to watch this week. Amid growing fears about an AI bubble, is it time to flip the script on the 60/40 investment strategy? Experts weigh in. Why is silver outperforming gold? Here's what to know. 3 big surprises that caught stock market pros off guard in 2025 Why mortgage rates are stuck at 6.2% and might stay there The AI giant's licensing deal with Groq is a prime example of how it uses its massive balance sheet to 'maintain dominance' US stocks notched solid weekly gains to begin the 'Santa Claus rally' period Gold's rally is so voracious that bulls are taunting investors of floundering cryptocurrencies. 'The time has come' to switch. Intel stock has soared this year. Now 'everything hinges' on what comes next. Stocks open little changed as Wall Street heads for winning week and tries to keep 'Santa Claus rally' going Copper prices are soaring. Here's what that often signals for the economy. New data sent mixed signals about the economy, causing mortgage rates to drop slightly. I",
                "images": [],
                "rank": 3
              },
              {
                "url": "https://economictimes.indiatimes.com/privi-speciality-chemicals-ltd/stocks/companyid-8120.cms",
                "content": "Privi Speciality Chemicals Share Price Today, Privi Speciality Chemicals Stock Price Live NSE/BSE Updates Hi, User Sign in + Home Stocks Technical Signals Upside Radar Big Bulls Stock Reports + Market Mood ePaper News Recos Screeners Stock Talk Privi Speciality Chemicals Share Price Overview Recos News Analysis Financials Forecast Technicals Peers Shareholdings MF F&O Corp Actions About Classic View Please select checkbox: Enhanced View Privi Speciality Chemicals Share Price 2,782.90 -16.30 ( -0.59 %) 2,780.00 -23.90 ( -0.85 %) NSE BSE Live As On: 02 Jan, 2026, 03:02 PM IST As On: 02 Jan, 2026, 03:04 PM IST Sector: Chemicals Industry: Chemicals - Others STOCK SCORE Unlock Scores 1D 1W 1M 3M 6M 1Y 5Y Loading... Add to Watchlist Open 2,792.80 High 2,808.80 Low 2,700.00 Prev Close 2,799.20 Volume 3,71,184 VWAP () 2,755.92 Learn Value Investing Buy or Sell? Ask ET Experts Key Metrics PE Ratio (x) 40.50 EPS - TTM () 68.30 MCap ( Cr.) 10,805.14 MCap Rank 16 PB Ratio (x) 9.78 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,440.50 52W Low () 1,368.15 MCap/Sales 3.17 Beta (1 Month) -0.46 BV/Share () 286.19 PE Ratio (x) 40.70 EPS - TTM () 68.30 MCap ( Cr.) 10,807.67 MCap Rank 16 PB Ratio (x) 9.80 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,433.00 52W Low () 1,352.15 MCap/Sales 3.17 Beta (1 Month) -0.60 BV/Share () 286.19 Privi Speciality Chemicals share price insights ROE Outperforming 5 Year Average Company delivered ROE of 16.94% in year ending Mar 31, 2025 outperforming its 5 year avg. of 11.8%. (Source: Consolidated Financials) Beating 3 Yr Revenue CAGR Company's annual revenue growth of 19.3% outperformed its 3 year CAGR of 13.75%. (Source: Consolidated Financials) Employee & Interest Expense Company has spent 4.18% of its operating revenues towards interest expenses and 4.12% towards employee cost in the year ending Mar 31, 2025. (Source: Consolidated Financials) Privi Speciality Chemicals Share Price Update Privi Speciality Chemicals Ltd. share price moved down by -0.51% from its previous close of Rs 2,799.20. Privi Speciality Chemicals Ltd. stock last traded price is 2,785.00 Share Price Value Today/Current/Last 2,785.00 2,781.45 Previous Day 2,799.20 2,803.90 Found Insights useful? Privi Speciality Chemicals Share Price Returns 1 Day -0.59% 1 Month -12.14% 3 Months 17.96% 1 Year 55.05% 3 Years 136.64% 5 Years 416.31% 1 Day -0.85% 1 Month -12.37% 3 Months 17.81% 1 Year 54.53% 3 Years 136.8% 5 Years 416.97% Privi Speciality Chemicals Share Recommendations Mean recos Current STRONG BUY 2 Analysts Strong Sell Sell Hold Buy Strong Buy Analyst Trends Ratings Current 1W Ago 1M Ago 3M Ago Strong Buy 1 1 1 - Buy 1 1 1 - Hold - - - - Sell - - - - Strong Sell - - - - # Analysts 2 2 2 - View all Stock Recommendations News & Analysis New Year stock picks 2026: Motilal Oswal suggests HCL Tech, Eternal among 11 names to buy News Technical picks: Axis Securities favours 3 stocks for up to 18% returns as Nifty eyes record high News Nestle India among 4 stocks showing bullish candlestick pattern News Disclosures under Reg. 29(2) of SEBI (SAST) Regulations, 2011 Announcements View all Privi Speciality Chemicals Share News & Announcements Share Analysis EARNINGS FUNDAMENTAL RELATIVE VALUATION RISK PRICE MOMENTUM Unlock Stock Score, Analyst' Ratings & Recommendations Score on 10-point scale Ratings by analysts Stock performance JOIN ET PRIME Financials Consolidated Standalone Income (P&L) Quarterly Annual Sep 2025 Jun 2025 Mar 2025 Dec 2024 Sep 2024 Total Income 678.82 567.80 628.37 493.06 537.27 Total Income Growth (%) 19.55 -9.64 27.44 -8.23 15.13 Total Expenses 532.28 462.96 515.87 410.39 454.97 Total Expenses Growth (%) 14.97 -10.26 25.70 -9.80 13.25 EBIT 146.54 104.84 112.50 82.67 82.30 EBIT Growth (%) 39.77 -6.81 36.09 0.45 26.72 Profit after Tax (PAT) 93.91 61.93 66.52 44.44 44.66 PAT Growth (%) 51.64 -6.91 49.71 -0.51 42.38 EBIT Margin (%) 21.59 18.46 17.90 16.77 15.32 Net Profit Margin (%) 13.83 10.91 10.59 9.01 8.31 Basic EP",
                "images": [],
                "rank": 4
              },
              {
                "url": "https://www.youtube.com/shorts/xsruOFyqRCs",
                "content": "Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? 10Likes 726Views 31 Dec2025 Privi Speciality Chemicals stock has dropped 13% sharply, surprising investors! In this video, we analyze the reasons behind the sudden fall and break down the key factors that triggered market selling. Whether youre tracking chemical stocks or broader market sentiment, this analysis will help you understand whats really happening . In this video, you will learn: What caused the stock to decline 13%  Market sentiment & sector impact  Key technical levels traders should watch  Is this a correction or a sign of deeper weakness?  What investors should do next buy / hold / watch This update is helpful for traders, investors, and stock market learners looking to decode sudden price moves and make informed decisions.  Comment below What do you think is the reason for the fall? #PriviSpecialityChemicals#stockmarketindia#StockFall#sharemarketnews#stockanalysis#investmentinsights#marketupdate#chemicalstocks#tradingupdates#financeeducation Privi Speciality Chemicals stock analysis, Privi stock falls, Why Privi stock down, Chemical stocks India, Stock market news India, Share market update, Sudden stock decline, Investment strategy, Trading analysis, Market volatility, Stock price fall...more ...more Show less Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? @RamanVerma-rm Next video Tap to unmute 2x Search Info Shopping If playback doesn't begin shortly, try restarting your device. You're signed out Videos that you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer. CancelConfirm Share An error occurred while retrieving sharing information. Please try again later.",
                "images": [],
                "rank": 5
              }
            ],
            "annotations": null
          }
        ]
      },
      "reasons_for_decline_T003": {
        "primary_reasons": [
          {
            "reason": "Large Block Deal",
            "details": "A significant block deal involving the sale of 38.8 lakh shares, representing 9.93% of the company's equity, took place. This created immediate selling pressure.",
            "source": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html, https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/, https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642"
          },
          {
            "reason": "Discounted Transaction Price",
            "details": "The shares in the block deal were traded at an average price of Rs 2,799 per share, a 12% discount from the previous closing price of Rs 3,190.50. This steep discount put downward pressure on the stock.",
            "source": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html, https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
          },
          {
            "reason": "Stake Sale by Shareholder",
            "details": "Reports indicated that a shareholder was likely to sell up to a 6.32% stake in the company through a block deal, totaling around Rs 700 crore. The floor price was set at Rs 2,835-2,850 per share, an 11-14% discount.",
            "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
          },
          {
            "reason": "Promoter Stake Dilution History",
            "details": "Market participants recall promoter entities selling a combined 4.09% stake in June 2025, making investors cautious about recurring stake dilutions.",
            "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
          }
        ],
        "bounce_back_outlook": {
          "analyst_sentiment": "Positive",
          "details": "Despite the sharp fall, brokerage commentary remains positive. Motilal Oswal Wealth Management included Privi Speciality Chemicals in its top 10 stock picks for 2026, citing strong growth prospects and capacity expansion plans. They valued the stock at Rs 3,960, implying a 21% upside.",
          "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
        },
        "concern_level": "Moderate",
        "justification": "The stock decline is primarily due to a large block deal and associated selling pressure rather than fundamental business issues. While the promoter stake dilution history adds some concern, analysts remain positive about the company's long-term prospects. Monitoring the stock's stabilization after the block deal is advised."
      },
      "investor_sentiment_T004": {
        "overview": "Analysis of recent news and forum sentiment indicates a mixed outlook for Privi Speciality Chemicals. While the stock has experienced a decline, some analysts maintain a positive outlook, while investor sentiment appears cautious.",
        "bounce_back_potential": {
          "positive_indicators": [
            "Analysts' Strong Buy recommendations suggest potential for recovery.",
            "Technical analysis indicates potential momentum shifts.",
            "The stock has shown resilience over the past month, with a gain of 7.22%, outperforming the Sensex's decline."
          ],
          "negative_indicators": [
            "Recent price declines and consecutive losses raise concerns.",
            "Underperformance compared to the sector indicates caution.",
            "Sensex trading below its 50-day moving average reflects overall market caution."
          ],
          "stocktwits_sentiment": "Sentiment on StockTwits is unavailable due to lack of current data. Historical sentiment has been equally unavailable over the past week, month, 3 months, 6 months and year."
        },
        "level_of_concern": {
          "high_concern_factors": [
            "Significant stock decline and gap down openings indicate market concern.",
            "Consecutive losses over the past three days contribute to investor anxiety.",
            "YouTube analysis highlights surprise among investors due to the sharp decline."
          ],
          "mitigating_factors": [
            "Strong Buy recommendations from analysts.",
            "Positive long-term returns.",
            "Company performance (ROE, Revenue growth, etc.) is generally outperforming benchmarks."
          ],
          "conclusion": "Overall, there is a moderate level of concern among investors, driven by recent price declines, but this is somewhat balanced by positive analyst ratings and underlying performance data."
        },
        "recommendations": [
          "Monitor stock performance closely and stay informed of market trends.",
          "Consider analyst ratings and financial data when making investment decisions.",
          "Exercise caution and assess risk tolerance based on individual circumstances."
        ]
      },
      "summary_of_situation_T005": [
        {
          "Cause of Decline": "A large block deal involving the sale of 38.8 lakh shares (9.93% of equity) created immediate selling pressure on Privi Speciality Chemicals.",
          "Discounted Price": "The block deal shares were traded at an average of Rs 2,799, a 12% discount from the previous close of Rs 3,190.50, putting downward pressure on the stock.",
          "Stake Sale": "A shareholder was likely selling up to a 6.32% stake through a block deal (around Rs 700 crore) with a floor price of Rs 2,835-2,850, an 11-14% discount.",
          "Promoter Dilution History": "Past promoter stake dilutions (4.09% in June 2025) have made investors cautious about recurring sales.",
          "Analyst Outlook": "Despite the fall, brokerage commentary is positive. Motilal Oswal Wealth Management included Privi in its top 10 picks for 2026, citing growth prospects and valuing it at Rs 3,960 (21% upside).",
          "Investor Sentiment": "Investor sentiment is mixed, with recent price declines causing concern, balanced by strong buy recommendations and long-term performance. Caution is advised.",
          "Bounce-Back Potential": "Positive indicators include strong analyst recommendations and recent resilience, but negative indicators include recent price declines and underperformance compared to the sector. Sentiment data on StockTwits is unavailable.",
          "Recommendations": "Monitor performance closely, stay informed, consider analyst ratings, and assess risk tolerance."
        }
      ],
      "formatted_report_T006": "<div class='report'>\n  <h1>Privi Speciality Chemicals Stock Price Decline Analysis</h1>\n\n  <h2>1. Executive Summary</h2>\n  <p>This report analyzes the recent stock price decline of Privi Speciality Chemicals on the NSE. The primary drivers include a large block deal, discounted transaction prices, and historical promoter stake dilutions. While investor sentiment is mixed, analyst outlook remains positive, suggesting potential for a bounce-back. Caution is advised; monitor performance closely.</p>\n\n  <h2>2. Reasons for Stock Price Decline</h2>\n  <h3>2.1 Large Block Deal</h3>\n  <p>A significant block deal involving the sale of 38.8 lakh shares (9.93% of the company's equity) created immediate selling pressure. <a href='https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html' target='_blank'>Source</a>, <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a>, <a href='https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642' target='_blank'>Source</a></p>\n\n  <h3>2.2 Discounted Transaction Price</h3>\n  <p>The block deal shares were traded at an average of Rs 2,799, a 12% discount from the previous close of Rs 3,190.50, putting downward pressure on the stock. <a href='https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html' target='_blank'>Source</a>, <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h3>2.3 Potential Stake Sale</h3>\n  <p>A shareholder was likely selling up to a 6.32% stake through a block deal (around Rs 700 crore) with a floor price of Rs 2,835-2,850, an 11-14% discount. <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h3>2.4 Promoter Dilution History</h3>\n  <p>Past promoter stake dilutions (4.09% in June 2025) have made investors cautious about recurring sales. <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h2>3. Analyst Outlook</h2>\n  <p>Despite the fall, brokerage commentary is positive. Motilal Oswal Wealth Management included Privi in its top 10 picks for 2026, citing growth prospects and valuing it at Rs 3,960 (21% upside). <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h2>4. Investor Sentiment</h2>\n  <p>Investor sentiment is mixed, with recent price declines causing concern, balanced by strong buy recommendations and long-term performance. Caution is advised.</p>\n\n  <h2>5. Bounce-Back Potential</h2>\n  <h3>5.1 Positive Indicators</h3>\n  <ul>\n    <li>Analysts' Strong Buy recommendations suggest potential for recovery.</li>\n    <li>Technical analysis indicates potential momentum shifts.</li>\n    <li>The stock has shown resilience over the past month, with a gain of 7.22%, outperforming the Sensex's decline.</li>\n  </ul>\n\n  <h3>5.2 Negative Indicators</h3>\n  <ul>\n    <li>Recent price declines and consecutive losses raise concerns.</li>\n    <li>Underperformance compared to the sector indicates caution.</li>\n    <li>Sensex trading below its 50-day moving average reflects overall market caution.</li>\n  </ul>\n\n  <h3>5.3 StockTwits Sentiment</h3>\n  <p>Sentiment data on StockTwits is unavailable.</p>\n\n  <h2>6. Level of Concern Assessment</h2>\n  <h3>6.1 High Concern Factors</h3>\n  <ul>\n    <li>Significant stock decline and gap down openings indicate market concern.</li>\n    <li>Consecutive losses over the past three days contribute to investor anxiety.</li>\n    <li>YouTube analysis highlights surprise among investors due to the sharp decline.</li>\n  </ul>\n\n  <h3>6.2 Mitigating Factors</h3>\n  <ul>\n    <li>Strong Buy recommendations from analysts.</li>\n    <li>Positive long-term returns.</li>\n    <li>Company performance (ROE, Revenue growth, etc.) is generally outperforming benchmarks.</li>\n  </ul>\n\n  <h3>6.3 Conclusion</h3>\n  <p>Overall, there is a moderate level of concern among investors, driven by recent price declines, but this is somewhat balanced by positive analyst ratings and underlying performance data.</p>\n\n  <h2>7. Recommendations</h2>\n  <ul>\n    <li>Monitor stock performance closely and stay informed of market trends.</li>\n    <li>Consider analyst ratings and financial data when making investment decisions.</li>\n    <li>Exercise caution and assess risk tolerance based on individual circumstances.</li>\n  </ul>\n</div>"
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0,
      "id": "ROOT"
    },
    {
      "id": "Query",
      "description": "Formulate execution plan",
      "agent": "PlannerAgent",
      "status": "completed",
      "reads": [
        "original_query"
      ],
      "writes": [
        "plan_graph"
      ],
      "output": {
        "plan_graph": {
          "nodes": [
            {
              "id": "T001",
              "description": "Retrieve recent news articles about \"Privi Speciality Chemicals\" and its stock price decline on NSE.",
              "agent": "RetrieverAgent",
              "agent_prompt": "Retrieve recent news articles specifically discussing the stock price decline of \"Privi Speciality Chemicals\" on the National Stock Exchange (NSE) within the last week. Focus on articles providing explanations for the decline.",
              "reads": [],
              "writes": [
                "news_articles_T001"
              ]
            },
            {
              "id": "T002",
              "description": "Retrieve relevant discussions from financial forums and social media regarding the stock price decline of Privi Speciality Chemicals.",
              "agent": "RetrieverAgent",
              "agent_prompt": "Search financial forums and social media platforms for discussions and opinions about the recent stock price decline of \"Privi Speciality Chemicals\". Focus on sentiment analysis, predictions of bounce-back, and concerns expressed by investors.",
              "reads": [],
              "writes": [
                "forum_discussions_T002"
              ]
            },
            {
              "id": "T003",
              "description": "Analyze the news articles to identify the reasons cited for the stock price decline.",
              "agent": "ThinkerAgent",
              "agent_prompt": "Analyze the retrieved news articles from `news_articles_T001` to identify the primary reasons given for the recent stock price decline of \"Privi Speciality Chemicals\". Extract specific factors and explanations mentioned in the articles.",
              "reads": [
                "news_articles_T001"
              ],
              "writes": [
                "reasons_for_decline_T003"
              ]
            },
            {
              "id": "T004",
              "description": "Analyze the forum discussions to gauge investor sentiment and predictions about a potential bounce-back.",
              "agent": "ThinkerAgent",
              "agent_prompt": "Analyze the forum discussions from `forum_discussions_T002` to determine the overall investor sentiment regarding \"Privi Speciality Chemicals\". Extract opinions on whether the stock is likely to bounce back, and identify the level of concern expressed by investors.",
              "reads": [
                "forum_discussions_T002"
              ],
              "writes": [
                "investor_sentiment_T004"
              ]
            },
            {
              "id": "T005",
              "description": "Synthesize the findings from news articles and forum discussions to provide a comprehensive explanation of the stock price decline and investor sentiment.",
              "agent": "DistillerAgent",
              "agent_prompt": "Synthesize the information from `reasons_for_decline_T003` (reasons for the stock price decline from news articles) and `investor_sentiment_T004` (investor sentiment and bounce-back predictions from forum discussions) to create a comprehensive summary of the situation surrounding \"Privi Speciality Chemicals\".",
              "reads": [
                "reasons_for_decline_T003",
                "investor_sentiment_T004"
              ],
              "writes": [
                "summary_of_situation_T005"
              ]
            },
            {
              "id": "T006",
              "description": "Format the summary into a well-structured report with clear explanations, sentiment analysis, and an assessment of the level of concern.",
              "agent": "FormatterAgent",
              "agent_prompt": "Format the summary from `summary_of_situation_T005` into a well-structured report. Include the identified reasons for the stock price decline, a summary of investor sentiment regarding a potential bounce-back, and an overall assessment of the level of concern based on the available information. Use markdown to highlight key points and structure the report for easy readability.",
              "reads": [
                "summary_of_situation_T005"
              ],
              "writes": [
                "formatted_report_T006"
              ]
            }
          ],
          "edges": [
            {
              "source": "ROOT",
              "target": "T001"
            },
            {
              "source": "ROOT",
              "target": "T002"
            },
            {
              "source": "T001",
              "target": "T003"
            },
            {
              "source": "T002",
              "target": "T004"
            },
            {
              "source": "T003",
              "target": "T005"
            },
            {
              "source": "T004",
              "target": "T005"
            },
            {
              "source": "T005",
              "target": "T006"
            }
          ]
        },
        "next_step_id": "T001",
        "cost": 0.0002953,
        "input_tokens": 433,
        "output_tokens": 630,
        "total_tokens": 1063
      },
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": "2026-01-02T09:33:05.835121",
      "execution_time": 0.0
    },
    {
      "id": "T001",
      "description": "Retrieve recent news articles about \"Privi Speciality Chemicals\" and its stock price decline on NSE.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve recent news articles specifically discussing the stock price decline of \"Privi Speciality Chemicals\" on the National Stock Exchange (NSE) within the last week. Focus on articles providing explanations for the decline.",
      "reads": [],
      "writes": [
        "news_articles_T001"
      ],
      "status": "completed",
      "output": {
        "news_articles_T001": [],
        "call_self": false,
        "code_variants": {
          "CODE_1A": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals NSE stock price decline news last week', 8))\nreturn {'news_articles_T001': results}",
          "CODE_1B": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals stock price drop NSE reasons', 8))\nreturn {'news_articles_T001': results}"
        },
        "cost": 7.01e-05,
        "input_tokens": 493,
        "output_tokens": 52,
        "total_tokens": 545,
        "execution_result": {
          "news_articles_T001": {
            "content": [
              {
                "type": "text",
                "text": [
                  {
                    "url": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html",
                    "content": "Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Get App Open In App Enjoy seamless experience on APP 10x faster & More Feature Get App Go PRO Now Open App Search Quotes, News, Mutual Fund NAVs Quotes Mutual Funds Commodities Futures & Options Currency News Topic Cryptocurrency Forum Notices Videos Glossary All Auri ferous Aqua Farma, 519363 Get App / Open App Home PRO Markets News Budget 2026 Editors Picks Tech India Learning Curve Portfolio Watchlist Commodities MF PF Forum Videos Invest Now Invest in Cryptoassets Powered by Invest in Unlisted stocks Powered by Home News Business Markets Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Trending Topics Sensex Today Cigarette Stocks Time Technoplast Shares ITC Share Price TVS Motor Share Price Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality share price: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93% stake in the company, changed hands in a large transaction, CNBC-TV18 reported. Debaroti Adhikary December 31, 2025 / 11:54 IST Story continues below Advertisement Remove Ad Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality Chemicals shares dropped almost 14% after a major transaction. 38.8 lakh shares, 9.93% stake, changed hands at Rs 2,799 per share The transaction price was 12% below the previous closing price Did our AI summary help? HKA HKA Watchlist Portfolio Message Follow NSE/BSE Select NSE LIVE BSE LIVE Trade Day High Day Low Volume (NSE) More Add to Watchlist The shares of Privi Speciality Chemicals fell nearly 14 percent on December 31 after the stock saw a large transaction taking place on exchanges. The shares of the manufacturer, supplier and exporter of aroma and fragrance chemicals dropped to Rs 2,751 apiece in the morning trading hours of Wednesday. Story continues below Advertisement Remove Ad Privi Speciality Chemicals large transaction: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93 percent stake in the company, changed hands in a large transaction, CNBC-TV18 quoted official data as saying. It added that the shares were traded at an average price of Rs 2,799 per share, taking the total value of the transaction to Rs 1,086 crore. The reported price at which the transaction was carried out represents a 12 percent discount from the stocks previous closing price of Rs 3,190.50 apiece. Story continues below Advertisement Remove Ad Related Stories GST cut sparks comeback of entry-level cars and bikes Olectra Greentech shares jump 6% as operations begin at Hyderabad EV plant; JBM Auto up 8% 2025 added returns, not acceleration, to Indian equity compounding Notably, this comes a day after the business news channel reported that a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32 percent stake in the company via a block deal. Privi Speciality Chemicals shareholding pattern: According to data on the company's shareholding pattern as at the end of September 2025, promoter and promoter groups held nearly 70 percent stake in the company while the rest of the 30 percent was owned by public. Story continues below Advertisement Remove Ad Among the public shareholders, SBI Multi Asset Allocation Fund held the largest individual shareholding at 3.64 percent. Privi Speciality Chemicals share price: Privi Speciality Chemicals shares have fallen around 11 percent in the past one month, but gained around 24 percent in the past six months. The stock is so far up more than 57 percent in 2025 so far, but is set for its worst one-day drop since May 2022 today. After hitting a 52-week low of Rs 1,368.15 apiece in March this year, the stock rapidly rallied more than 151 percent in around eight months to hit a fresh 52-week high of Rs 3,440.50 apiece in November this year. The stock currently has a P/E ratio of more than 59, and a market",
                    "images": [],
                    "rank": 1
                  },
                  {
                    "url": "https://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html",
                    "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html\" on this server. Reference #18.d4d70b17.1767346419.ea283892 https://errors.edgesuite.net/18.d4d70b17.1767346419.ea283892",
                    "images": [],
                    "rank": 2
                  },
                  {
                    "url": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/",
                    "content": "Why Privi Speciality Chemicals shares are falling over 9% today explained | Business Upturn Business Stock Market Sectors Finance Technology Sports Nation India United States Asia Search Business Corporates SMEs Startups Funding Marketing Blog Stock Market Stock Market Brokerages Quarterly Results Asian Markets US Market Finance Stock Market Personal Finance Mutual Funds IPO Money Market Cryptocurrency Economy Policy Taxation Tech AI Gadgets Internet Gaming Science Apps Social Media Cyber Security Sports Cricket Soccer Tennis Hockey Badminton WWE Kabaddi NBA Formula 1 Entertainment Celebrity Movies Reviews Box-Office Television OTT Music International Sectors Commodities Fintech Banking Retail Auto Telecom Defence Energy Real Estate Health Agriculture Lifestyle Beauty Fashion Books Culture Food Fitness Living Parenting Relationship Travel Wellness More India USA Asia World STOCK MARKET Why Privi Speciality Chemicals shares are falling over 9% today explained By Aditya Bhagchandani Last updated on December 31, 2025 9:12 AM IST Reading Mode 2 min read Wednesday, December 31: Shares of Privi Speciality Chemicals Ltd came under sharp selling pressure on Wednesday, plunging over 9% intraday on the NSE, after reports emerged of a large stake sale via block deal . The stock was trading around Rs 2,900 , down more than 9% , as investors reacted to the potential supply overhang in the counter. Block deal trigger behind the fall According to sources cited by CNBC-TV18 , a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32% stake in the company through a block deal. The total size of the transaction is estimated at around Rs 700 crore . The floor price for the deal has been fixed in the range of Rs 2,8352,850 per share , which implies a discount of about 11.14% to the current market price. Such a steep discount typically puts immediate pressure on the stock, as traders factor in near-term downside and increased supply. Promoter stake sale history adds to caution Market participants are also recalling that promoter entities had sold a combined 4.09% stake in Privi Speciality Chemicals in June 2025 for around Rs 330 crore through open market transactions. The recurring stake dilution has made investors cautious, especially in the short term. The promoters involved in the earlier sale included Bhaktavatsala Rao Doppalapudi, Vijaykumar Doppalapudi, Vinaykumar Doppalapudi Rao and Vivira Investment and Trading , as per NSE bulk deal data. Long-term fundamentals remain intact Despite todays sharp fall, brokerage commentary on the stock remains positive. Motilal Oswal Wealth Management recently included Privi Speciality Chemicals in its top 10 stock picks for 2026 , citing strong growth prospects in the global aroma chemicals market, which is expected to reach $9.2 billion by 2030 . The brokerage has highlighted capacity expansion plans and the proposed merger with Privi Fine Sciences , which are expected to strengthen the companys green chemistry and high-margin portfolio. Motilal Oswal has valued the stock at Rs 3,960 , implying nearly 21% upside from current levels. Bottom line Privi Speciality Chemicals shares are down sharply not due to business fundamentals , but because of near-term selling pressure linked to a large block deal at a discount . Investors are watching closely to see how the stake sale plays out and whether the stock stabilises once the transaction is absorbed by the market. More from Stock Market Stock Market Why Dynacons Systems & Solutions shares jumped over 7% today explained Dec 31, 2025 - 9:17 AM IST Stock Market Why ZF Steering Gear India shares are up over 4% today explained Dec 31, 2025 - 9:14 AM IST Stock Market Why are Eternal (Zomato) shares falling nearly 3% today? Explained Dec 31, 2025 - 9:13 AM IST Stock Market Indian Stock Market LIVE Today: Nifty, Sensex set for flat start; JSW Steel, IndiGo, Bharat Forge in focus Dec 31, 2025 - 9:00 AM IST Stock Market Nifty, Sensex set for flat op",
                    "images": [],
                    "rank": 3
                  },
                  {
                    "url": "https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642",
                    "content": "Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Home News Create Screeners Insights ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal 1 min read Updated on 30 Dec 2025, 08:34 PM Reviewed by Riya D ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals experienced a 13% share price decline following the execution of a major block deal worth 1,086 crores involving 38.8 lakh shares at 2,799 per share. The transaction, representing 9.93% of outstanding equity, significantly exceeded the initially planned 700 crore deal size and was executed below the indicated price range, demonstrating expanded promoter divestment despite the company's strong 65% annual performance. *this image is generated using AI for illustrative purposes only. Privi Speciality Chemicals shares declined as much as 13.00% following the execution of a major block deal worth 1,086.00 crores. The transaction involved 38.80 lakh shares, representing 9.93% of the company's outstanding equity, executed at an average price of 2,799.00 per share. Block Deal Execution and Market Impact The completed transaction exceeded the initially announced deal parameters, demonstrating significant institutional participation: Transaction Parameter: Final Execution Details Total Value: 1,086.00 crores Shares Traded: 38.80 lakh shares Average Price: 2,799.00 per share Equity Stake: 9.93% Market Reaction: -13.00% decline Current Trading Price: 2,794.30 The execution price of 2,799.00 per share came below the initially indicated price range of 2,835.00 to 2,850.00, representing an 11.10% discount to the previous day's closing price. Transaction Scale Evolution The actual block deal significantly exceeded initial projections: Comparison Metrics: Initial Plan Final Execution Deal Value: 700.00 crores 1,086.00 crores Shares Involved: Up to 6.30% stake 38.80 lakh shares Stake Percentage: 6.30% 9.93% Price Range: 2,835.00-2,850.00 2,799.00 The substantial increase in transaction size from 700.00 crores to 1,086.00 crores indicates expanded divestment by the promoter entity. Shareholding Structure The company maintains a concentrated ownership structure with strong promoter presence: Shareholder Category: Stake Percentage Promoters: 69.89% Mutual Funds: 3.91% SBI MF: 3.64% Retail Shareholders: 8.70% Large Retail: 6.67% Promoters held 69.89% stake as of the September quarter, with over 26,000 retail shareholders holding up to 2.00 lakh authorized share capital maintaining an 8.70% stake. Performance Context Despite the current decline, the stock maintains strong annual performance: Performance Metrics: Current Status Annual Returns: +65.00% Market Capitalization: 12,392.10 crores Sector: Chemicals Market Segment: Mid Cap Best Performance Since: 2021 (+240%) The stock has gained 65.00% in the current calendar year, marking its best performance since 2021 when it recorded gains of over 240.00%. Historical Stock Returns for Privi Speciality Chemicals 1 Day 5 Days 1 Month 6 Months 1 Year 5 Years - 0. 97 % - 17. 50 % - 12. 14 % + 21. 73 % + 55. 00 % + 414. 29 % Privi Speciality Chemicals View in Depth 16 Read Next Article ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Board Approves Fresh Amalgamation Scheme 2 min read Updated on 15 Nov 2025, 12:47 PM Reviewed by Radhika S ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals has approved a comprehensive amalgamation scheme involving its subsidiaries Privi Fine Sciences and Privi Biotechnologies, following withdrawal of an earlier scheme. The Board-approved restructuring includes specific share exchange ratios, independent valuations, and aims to create operational synergies while enhancing market competitiveness through consolidated operations. *this image is generated using",
                    "images": [],
                    "rank": 4
                  },
                  {
                    "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-ltd-hits-intraday-low-amid-price-pressure-3775941",
                    "content": "Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Stocks in Action News Home Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium The Mojo Times Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium Home News Stocks in Action Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Dec 31 2025 09:41 AM IST share Share Via Privi Speciality Chemicals Ltd experienced significant intraday weakness on 31 Dec 2025, with its stock price touching a low of Rs 2,752.6, marking a 13.23% decline from the previous close. The stock underperformed its sector and broader market indices, reflecting immediate selling pressure despite a generally positive market environment. Intraday Price Movement and Market Context On the trading day, Privi Speciality Chemicals Ltd opened sharply lower, down 8.36% from its prior close, setting a negative tone early in the session. The stock continued to slide, reaching its intraday low of Rs 2,752.6, representing a 13.23% drop. This decline was notably steeper than the sectors performance, with the stock underperforming the Specialty Chemicals sector by 12.67% on the day. In contrast, the broader market showed resilience. The Sensex opened 118.50 points higher and traded at 84,830.41, up 0.18%, maintaining a position close to its 52-week high of 86,159.02, just 1.57% away. The Sensexs bullish technical setup was evident as it traded above its 50-day moving average, which itself was positioned above the 200-day moving average. Small-cap stocks led the market rally, with the BSE Small Cap index gaining 0.52% on the day. Despite this positive market backdrop, Privi Speciality Chemicals Ltds share price faced downward pressure, diverging from the broader indices and sector trends. Technical Indicators and Moving Averages The stocks technical positioning showed mixed signals. While the price remained above its 100-day and 200-day moving averages, it was trading below its shorter-term moving averages, including the 5-day, 20-day, and 50-day averages. This suggests that recent momentum has weakened, with short-term trends exerting downward pressure despite longer-term support levels holding firm. The gap down opening and subsequent decline below key short-term averages indicate that sellers dominated early trading, possibly triggered by profit-taking or other immediate factors impacting sentiment. Performance Comparison Over Various Timeframes Examining Privi Speciality Chemicals Ltds performance over multiple periods highlights the contrast between recent weakness and longer-term strength. The stocks one-day return was -11.55%, significantly lagging the Sensexs 0.17% gain. Over the past week, the stock declined 16.33%, compared to a 0.69% drop in the Sensex. The one-month performance also showed underperformance, with the stock down 11.06% versus the Sensexs 0.96% decline. However, over longer horizons, Privi Speciality Chemicals Ltd has delivered robust returns. The three-month gain stands at 18.91%, well above the Sensexs 4.73%. The one-year and year-to-date returns are both 58.61%, significantly outperforming the Sensexs 8.55%. Over three, five, and ten years, the stock has delivered compounded growth of 146.32%, 428.06%, and 1005.97% respectively, compared to the Sensexs 39.41%, 77.62%, and 224.75% over the same periods. Under the radar no more! This Large Cap from Cement is emerging from turnaround with solid fundamentals intact. Discover it while it's still relatively hidden! - Hidden turnaround gem - Solid fundamentals confirmed - Large Cap opportunity Discover This Hidden Gem Mojo Score and Rating Update Privi Speciality Chemicals Ltd holds a Mojo Score of 70.0, reflecting a positive overall assessment of the companys fundamentals and market position. The Mojo Grade was upgraded from Hold to Buy on 13 Oct 2025, indica",
                    "images": [],
                    "rank": 5
                  }
                ],
                "annotations": null
              }
            ]
          }
        },
        "execution_status": "success",
        "execution_error": null,
        "execution_time": "2026-01-02 15:03:37",
        "executed_variant": "CODE_1A",
        "execution_logs": ""
      },
      "error": null,
      "cost": 7.01e-05,
      "start_time": "2026-01-02T09:33:05.839696",
      "end_time": "2026-01-02T09:33:42.006415",
      "execution_time": 36.166719,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "news_articles_T001": [],
            "call_self": false,
            "code_variants": {
              "CODE_1A": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals NSE stock price decline news last week', 8))\nreturn {'news_articles_T001': results}",
              "CODE_1B": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals stock price drop NSE reasons', 8))\nreturn {'news_articles_T001': results}"
            },
            "cost": 7.01e-05,
            "input_tokens": 493,
            "output_tokens": 52,
            "total_tokens": 545
          },
          "execution_result": {
            "status": "success",
            "result": {
              "news_articles_T001": {
                "content": [
                  {
                    "type": "text",
                    "text": [
                      {
                        "url": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html",
                        "content": "Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Get App Open In App Enjoy seamless experience on APP 10x faster & More Feature Get App Go PRO Now Open App Search Quotes, News, Mutual Fund NAVs Quotes Mutual Funds Commodities Futures & Options Currency News Topic Cryptocurrency Forum Notices Videos Glossary All Auri ferous Aqua Farma, 519363 Get App / Open App Home PRO Markets News Budget 2026 Editors Picks Tech India Learning Curve Portfolio Watchlist Commodities MF PF Forum Videos Invest Now Invest in Cryptoassets Powered by Invest in Unlisted stocks Powered by Home News Business Markets Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Trending Topics Sensex Today Cigarette Stocks Time Technoplast Shares ITC Share Price TVS Motor Share Price Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality share price: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93% stake in the company, changed hands in a large transaction, CNBC-TV18 reported. Debaroti Adhikary December 31, 2025 / 11:54 IST Story continues below Advertisement Remove Ad Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality Chemicals shares dropped almost 14% after a major transaction. 38.8 lakh shares, 9.93% stake, changed hands at Rs 2,799 per share The transaction price was 12% below the previous closing price Did our AI summary help? HKA HKA Watchlist Portfolio Message Follow NSE/BSE Select NSE LIVE BSE LIVE Trade Day High Day Low Volume (NSE) More Add to Watchlist The shares of Privi Speciality Chemicals fell nearly 14 percent on December 31 after the stock saw a large transaction taking place on exchanges. The shares of the manufacturer, supplier and exporter of aroma and fragrance chemicals dropped to Rs 2,751 apiece in the morning trading hours of Wednesday. Story continues below Advertisement Remove Ad Privi Speciality Chemicals large transaction: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93 percent stake in the company, changed hands in a large transaction, CNBC-TV18 quoted official data as saying. It added that the shares were traded at an average price of Rs 2,799 per share, taking the total value of the transaction to Rs 1,086 crore. The reported price at which the transaction was carried out represents a 12 percent discount from the stocks previous closing price of Rs 3,190.50 apiece. Story continues below Advertisement Remove Ad Related Stories GST cut sparks comeback of entry-level cars and bikes Olectra Greentech shares jump 6% as operations begin at Hyderabad EV plant; JBM Auto up 8% 2025 added returns, not acceleration, to Indian equity compounding Notably, this comes a day after the business news channel reported that a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32 percent stake in the company via a block deal. Privi Speciality Chemicals shareholding pattern: According to data on the company's shareholding pattern as at the end of September 2025, promoter and promoter groups held nearly 70 percent stake in the company while the rest of the 30 percent was owned by public. Story continues below Advertisement Remove Ad Among the public shareholders, SBI Multi Asset Allocation Fund held the largest individual shareholding at 3.64 percent. Privi Speciality Chemicals share price: Privi Speciality Chemicals shares have fallen around 11 percent in the past one month, but gained around 24 percent in the past six months. The stock is so far up more than 57 percent in 2025 so far, but is set for its worst one-day drop since May 2022 today. After hitting a 52-week low of Rs 1,368.15 apiece in March this year, the stock rapidly rallied more than 151 percent in around eight months to hit a fresh 52-week high of Rs 3,440.50 apiece in November this year. The stock currently has a P/E ratio of more than 59, and a market",
                        "images": [],
                        "rank": 1
                      },
                      {
                        "url": "https://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html",
                        "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html\" on this server. Reference #18.d4d70b17.1767346389.ea257152 https://errors.edgesuite.net/18.d4d70b17.1767346389.ea257152",
                        "images": [],
                        "rank": 2
                      },
                      {
                        "url": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/",
                        "content": "Why Privi Speciality Chemicals shares are falling over 9% today explained | Business Upturn Business Stock Market Sectors Finance Technology Sports Nation India United States Asia Search Business Corporates SMEs Startups Funding Marketing Blog Stock Market Stock Market Brokerages Quarterly Results Asian Markets US Market Finance Stock Market Personal Finance Mutual Funds IPO Money Market Cryptocurrency Economy Policy Taxation Tech AI Gadgets Internet Gaming Science Apps Social Media Cyber Security Sports Cricket Soccer Tennis Hockey Badminton WWE Kabaddi NBA Formula 1 Entertainment Celebrity Movies Reviews Box-Office Television OTT Music International Sectors Commodities Fintech Banking Retail Auto Telecom Defence Energy Real Estate Health Agriculture Lifestyle Beauty Fashion Books Culture Food Fitness Living Parenting Relationship Travel Wellness More India USA Asia World STOCK MARKET Why Privi Speciality Chemicals shares are falling over 9% today explained By Aditya Bhagchandani Last updated on December 31, 2025 9:12 AM IST Reading Mode 2 min read Wednesday, December 31: Shares of Privi Speciality Chemicals Ltd came under sharp selling pressure on Wednesday, plunging over 9% intraday on the NSE, after reports emerged of a large stake sale via block deal . The stock was trading around Rs 2,900 , down more than 9% , as investors reacted to the potential supply overhang in the counter. Block deal trigger behind the fall According to sources cited by CNBC-TV18 , a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32% stake in the company through a block deal. The total size of the transaction is estimated at around Rs 700 crore . The floor price for the deal has been fixed in the range of Rs 2,8352,850 per share , which implies a discount of about 11.14% to the current market price. Such a steep discount typically puts immediate pressure on the stock, as traders factor in near-term downside and increased supply. Promoter stake sale history adds to caution Market participants are also recalling that promoter entities had sold a combined 4.09% stake in Privi Speciality Chemicals in June 2025 for around Rs 330 crore through open market transactions. The recurring stake dilution has made investors cautious, especially in the short term. The promoters involved in the earlier sale included Bhaktavatsala Rao Doppalapudi, Vijaykumar Doppalapudi, Vinaykumar Doppalapudi Rao and Vivira Investment and Trading , as per NSE bulk deal data. Long-term fundamentals remain intact Despite todays sharp fall, brokerage commentary on the stock remains positive. Motilal Oswal Wealth Management recently included Privi Speciality Chemicals in its top 10 stock picks for 2026 , citing strong growth prospects in the global aroma chemicals market, which is expected to reach $9.2 billion by 2030 . The brokerage has highlighted capacity expansion plans and the proposed merger with Privi Fine Sciences , which are expected to strengthen the companys green chemistry and high-margin portfolio. Motilal Oswal has valued the stock at Rs 3,960 , implying nearly 21% upside from current levels. Bottom line Privi Speciality Chemicals shares are down sharply not due to business fundamentals , but because of near-term selling pressure linked to a large block deal at a discount . Investors are watching closely to see how the stake sale plays out and whether the stock stabilises once the transaction is absorbed by the market. More from Stock Market Stock Market Why Dynacons Systems & Solutions shares jumped over 7% today explained Dec 31, 2025 - 9:17 AM IST Stock Market Why ZF Steering Gear India shares are up over 4% today explained Dec 31, 2025 - 9:14 AM IST Stock Market Why are Eternal (Zomato) shares falling nearly 3% today? Explained Dec 31, 2025 - 9:13 AM IST Stock Market Indian Stock Market LIVE Today: Nifty, Sensex set for flat start; JSW Steel, IndiGo, Bharat Forge in focus Dec 31, 2025 - 9:00 AM IST Stock Market Nifty, Sensex set for flat op",
                        "images": [],
                        "rank": 3
                      },
                      {
                        "url": "https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642",
                        "content": "Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Home News Create Screeners Insights ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal 1 min read Updated on 30 Dec 2025, 08:34 PM Reviewed by Riya D ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals experienced a 13% share price decline following the execution of a major block deal worth 1,086 crores involving 38.8 lakh shares at 2,799 per share. The transaction, representing 9.93% of outstanding equity, significantly exceeded the initially planned 700 crore deal size and was executed below the indicated price range, demonstrating expanded promoter divestment despite the company's strong 65% annual performance. *this image is generated using AI for illustrative purposes only. Privi Speciality Chemicals shares declined as much as 13.00% following the execution of a major block deal worth 1,086.00 crores. The transaction involved 38.80 lakh shares, representing 9.93% of the company's outstanding equity, executed at an average price of 2,799.00 per share. Block Deal Execution and Market Impact The completed transaction exceeded the initially announced deal parameters, demonstrating significant institutional participation: Transaction Parameter: Final Execution Details Total Value: 1,086.00 crores Shares Traded: 38.80 lakh shares Average Price: 2,799.00 per share Equity Stake: 9.93% Market Reaction: -13.00% decline Current Trading Price: 2,794.30 The execution price of 2,799.00 per share came below the initially indicated price range of 2,835.00 to 2,850.00, representing an 11.10% discount to the previous day's closing price. Transaction Scale Evolution The actual block deal significantly exceeded initial projections: Comparison Metrics: Initial Plan Final Execution Deal Value: 700.00 crores 1,086.00 crores Shares Involved: Up to 6.30% stake 38.80 lakh shares Stake Percentage: 6.30% 9.93% Price Range: 2,835.00-2,850.00 2,799.00 The substantial increase in transaction size from 700.00 crores to 1,086.00 crores indicates expanded divestment by the promoter entity. Shareholding Structure The company maintains a concentrated ownership structure with strong promoter presence: Shareholder Category: Stake Percentage Promoters: 69.89% Mutual Funds: 3.91% SBI MF: 3.64% Retail Shareholders: 8.70% Large Retail: 6.67% Promoters held 69.89% stake as of the September quarter, with over 26,000 retail shareholders holding up to 2.00 lakh authorized share capital maintaining an 8.70% stake. Performance Context Despite the current decline, the stock maintains strong annual performance: Performance Metrics: Current Status Annual Returns: +65.00% Market Capitalization: 12,392.10 crores Sector: Chemicals Market Segment: Mid Cap Best Performance Since: 2021 (+240%) The stock has gained 65.00% in the current calendar year, marking its best performance since 2021 when it recorded gains of over 240.00%. Historical Stock Returns for Privi Speciality Chemicals 1 Day 5 Days 1 Month 6 Months 1 Year 5 Years - 0. 97 % - 17. 50 % - 12. 14 % + 21. 73 % + 55. 00 % + 414. 29 % Privi Speciality Chemicals View in Depth 16 Read Next Article ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Board Approves Fresh Amalgamation Scheme 2 min read Updated on 15 Nov 2025, 12:47 PM Reviewed by Radhika S ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals has approved a comprehensive amalgamation scheme involving its subsidiaries Privi Fine Sciences and Privi Biotechnologies, following withdrawal of an earlier scheme. The Board-approved restructuring includes specific share exchange ratios, independent valuations, and aims to create operational synergies while enhancing market competitiveness through consolidated operations. *this image is generated using",
                        "images": [],
                        "rank": 4
                      },
                      {
                        "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-ltd-hits-intraday-low-amid-price-pressure-3775941",
                        "content": "Privi Speci. at Day Low Even weak stocks have their moments. Is this being tracked by our systems? NEW Stock belongs to [Strategy Name] Strategy Privi Speci. Industry: Public Sector Bank Market Cap: Mid Cap Date of Entry 31 Oct 25 Entry Price(INR) 136.95 Return 9.82% BSE500 Return 0.73% We add 2-5 new stocks every week Unlock Strategy Miss Premium 100% Secure No credit card required Stocks Portfolios Markets Webinars Wealth Sign Up For FREE THE MOJO TIMES Latest LOGIN Home Stocks Top Mojo Stocks Hidden Turnarounds Reliable Performers MomentumNow Stocks Stock of the Week NEW Stock of the Month Screener Stock Research Research Reports Switcher Report Trading Calls Portfolios Personal Portfolios Your Watchlist Markets Markets Today Earnings News IPO Webinars Upcoming Webinars Previous Recordings Blogs Media Centre Subscribe at Preferred rates Wealth THE MOJO TIMES Latest PREMIUM My Profile Reset Password Feedback My Feedback Logout THE MOJO TIMES STOCKS IN ACTION STOCK RECOMMENDATION RESULT ANALYSIS ACROSS THE WEB STOCK MARKET NEWS MOJO PREMIUM Home News Stocks in Action Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Dec 31 2025 09:41 AM IST share Privi Speciality Chemicals Ltd experienced significant intraday weakness on 31 Dec 2025, with its stock price touching a low of Rs 2,752.6, marking a 13.23% decline from the previous close. The stock underperformed its sector and broader market indices, reflecting immediate selling pressure despite a generally positive market environment. Intraday Price Movement and Market Context On the trading day, Privi Speciality Chemicals Ltd opened sharply lower, down 8.36% from its prior close, setting a negative tone early in the session. The stock continued to slide, reaching its intraday low of Rs 2,752.6, representing a 13.23% drop. This decline was notably steeper than the sectors performance, with the stock underperforming the Specialty Chemicals sector by 12.67% on the day. In contrast, the broader market showed resilience. The Sensex opened 118.50 points higher and traded at 84,830.41, up 0.18%, maintaining a position close to its 52-week high of 86,159.02, just 1.57% away. The Sensexs bullish technical setup was evident as it traded above its 50-day moving average, which itself was positioned above the 200-day moving average. Small-cap stocks led the market rally, with the BSE Small Cap index gaining 0.52% on the day. Despite this positive market backdrop, Privi Speciality Chemicals Ltds share price faced downward pressure, diverging from the broader indices and sector trends. Technical Indicators and Moving Averages The stocks technical positioning showed mixed signals. While the price remained above its 100-day and 200-day moving averages, it was trading below its shorter-term moving averages, including the 5-day, 20-day, and 50-day averages. This suggests that recent momentum has weakened, with short-term trends exerting downward pressure despite longer-term support levels holding firm. The gap down opening and subsequent decline below key short-term averages indicate that sellers dominated early trading, possibly triggered by profit-taking or other immediate factors impacting sentiment. Performance Comparison Over Various Timeframes Examining Privi Speciality Chemicals Ltds performance over multiple periods highlights the contrast between recent weakness and longer-term strength. The stocks one-day return was -11.55%, significantly lagging the Sensexs 0.17% gain. Over the past week, the stock declined 16.33%, compared to a 0.69% drop in the Sensex. The one-month performance also showed underperformance, with the stock down 11.06% versus the Sensexs 0.96% decline. However, over longer horizons, Privi Speciality Chemicals Ltd has delivered robust returns. The three-month gain stands at 18.91%, well above the Sensexs 4.73%. The one-year and year-to-date returns are both 58.61",
                        "images": [],
                        "rank": 5
                      }
                    ],
                    "annotations": null
                  }
                ]
              }
            },
            "raw": {
              "news_articles_T001": {
                "content": [
                  {
                    "type": "text",
                    "text": [
                      {
                        "url": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html",
                        "content": "Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Get App Open In App Enjoy seamless experience on APP 10x faster & More Feature Get App Go PRO Now Open App Search Quotes, News, Mutual Fund NAVs Quotes Mutual Funds Commodities Futures & Options Currency News Topic Cryptocurrency Forum Notices Videos Glossary All Auri ferous Aqua Farma, 519363 Get App / Open App Home PRO Markets News Budget 2026 Editors Picks Tech India Learning Curve Portfolio Watchlist Commodities MF PF Forum Videos Invest Now Invest in Cryptoassets Powered by Invest in Unlisted stocks Powered by Home News Business Markets Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Trending Topics Sensex Today Cigarette Stocks Time Technoplast Shares ITC Share Price TVS Motor Share Price Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality share price: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93% stake in the company, changed hands in a large transaction, CNBC-TV18 reported. Debaroti Adhikary December 31, 2025 / 11:54 IST Story continues below Advertisement Remove Ad Privi Speciality Chemicals shares fall 14% after Rs 1,086-crore shares change hands Privi Speciality Chemicals shares dropped almost 14% after a major transaction. 38.8 lakh shares, 9.93% stake, changed hands at Rs 2,799 per share The transaction price was 12% below the previous closing price Did our AI summary help? HKA HKA Watchlist Portfolio Message Follow NSE/BSE Select NSE LIVE BSE LIVE Trade Day High Day Low Volume (NSE) More Add to Watchlist The shares of Privi Speciality Chemicals fell nearly 14 percent on December 31 after the stock saw a large transaction taking place on exchanges. The shares of the manufacturer, supplier and exporter of aroma and fragrance chemicals dropped to Rs 2,751 apiece in the morning trading hours of Wednesday. Story continues below Advertisement Remove Ad Privi Speciality Chemicals large transaction: As many as 38.8 lakh shares of Privi Speciality Chemicals, representing 9.93 percent stake in the company, changed hands in a large transaction, CNBC-TV18 quoted official data as saying. It added that the shares were traded at an average price of Rs 2,799 per share, taking the total value of the transaction to Rs 1,086 crore. The reported price at which the transaction was carried out represents a 12 percent discount from the stocks previous closing price of Rs 3,190.50 apiece. Story continues below Advertisement Remove Ad Related Stories GST cut sparks comeback of entry-level cars and bikes Olectra Greentech shares jump 6% as operations begin at Hyderabad EV plant; JBM Auto up 8% 2025 added returns, not acceleration, to Indian equity compounding Notably, this comes a day after the business news channel reported that a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32 percent stake in the company via a block deal. Privi Speciality Chemicals shareholding pattern: According to data on the company's shareholding pattern as at the end of September 2025, promoter and promoter groups held nearly 70 percent stake in the company while the rest of the 30 percent was owned by public. Story continues below Advertisement Remove Ad Among the public shareholders, SBI Multi Asset Allocation Fund held the largest individual shareholding at 3.64 percent. Privi Speciality Chemicals share price: Privi Speciality Chemicals shares have fallen around 11 percent in the past one month, but gained around 24 percent in the past six months. The stock is so far up more than 57 percent in 2025 so far, but is set for its worst one-day drop since May 2022 today. After hitting a 52-week low of Rs 1,368.15 apiece in March this year, the stock rapidly rallied more than 151 percent in around eight months to hit a fresh 52-week high of Rs 3,440.50 apiece in November this year. The stock currently has a P/E ratio of more than 59, and a market",
                        "images": [],
                        "rank": 1
                      },
                      {
                        "url": "https://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html",
                        "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/markets/news/privi-speciality-chemicals-tanks-13-percent-in-trade-check-all-details-here-125123100227_1.html\" on this server. Reference #18.d4d70b17.1767346389.ea257152 https://errors.edgesuite.net/18.d4d70b17.1767346389.ea257152",
                        "images": [],
                        "rank": 2
                      },
                      {
                        "url": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/",
                        "content": "Why Privi Speciality Chemicals shares are falling over 9% today explained | Business Upturn Business Stock Market Sectors Finance Technology Sports Nation India United States Asia Search Business Corporates SMEs Startups Funding Marketing Blog Stock Market Stock Market Brokerages Quarterly Results Asian Markets US Market Finance Stock Market Personal Finance Mutual Funds IPO Money Market Cryptocurrency Economy Policy Taxation Tech AI Gadgets Internet Gaming Science Apps Social Media Cyber Security Sports Cricket Soccer Tennis Hockey Badminton WWE Kabaddi NBA Formula 1 Entertainment Celebrity Movies Reviews Box-Office Television OTT Music International Sectors Commodities Fintech Banking Retail Auto Telecom Defence Energy Real Estate Health Agriculture Lifestyle Beauty Fashion Books Culture Food Fitness Living Parenting Relationship Travel Wellness More India USA Asia World STOCK MARKET Why Privi Speciality Chemicals shares are falling over 9% today explained By Aditya Bhagchandani Last updated on December 31, 2025 9:12 AM IST Reading Mode 2 min read Wednesday, December 31: Shares of Privi Speciality Chemicals Ltd came under sharp selling pressure on Wednesday, plunging over 9% intraday on the NSE, after reports emerged of a large stake sale via block deal . The stock was trading around Rs 2,900 , down more than 9% , as investors reacted to the potential supply overhang in the counter. Block deal trigger behind the fall According to sources cited by CNBC-TV18 , a shareholder of Privi Speciality Chemicals is likely to sell up to 6.32% stake in the company through a block deal. The total size of the transaction is estimated at around Rs 700 crore . The floor price for the deal has been fixed in the range of Rs 2,8352,850 per share , which implies a discount of about 11.14% to the current market price. Such a steep discount typically puts immediate pressure on the stock, as traders factor in near-term downside and increased supply. Promoter stake sale history adds to caution Market participants are also recalling that promoter entities had sold a combined 4.09% stake in Privi Speciality Chemicals in June 2025 for around Rs 330 crore through open market transactions. The recurring stake dilution has made investors cautious, especially in the short term. The promoters involved in the earlier sale included Bhaktavatsala Rao Doppalapudi, Vijaykumar Doppalapudi, Vinaykumar Doppalapudi Rao and Vivira Investment and Trading , as per NSE bulk deal data. Long-term fundamentals remain intact Despite todays sharp fall, brokerage commentary on the stock remains positive. Motilal Oswal Wealth Management recently included Privi Speciality Chemicals in its top 10 stock picks for 2026 , citing strong growth prospects in the global aroma chemicals market, which is expected to reach $9.2 billion by 2030 . The brokerage has highlighted capacity expansion plans and the proposed merger with Privi Fine Sciences , which are expected to strengthen the companys green chemistry and high-margin portfolio. Motilal Oswal has valued the stock at Rs 3,960 , implying nearly 21% upside from current levels. Bottom line Privi Speciality Chemicals shares are down sharply not due to business fundamentals , but because of near-term selling pressure linked to a large block deal at a discount . Investors are watching closely to see how the stake sale plays out and whether the stock stabilises once the transaction is absorbed by the market. More from Stock Market Stock Market Why Dynacons Systems & Solutions shares jumped over 7% today explained Dec 31, 2025 - 9:17 AM IST Stock Market Why ZF Steering Gear India shares are up over 4% today explained Dec 31, 2025 - 9:14 AM IST Stock Market Why are Eternal (Zomato) shares falling nearly 3% today? Explained Dec 31, 2025 - 9:13 AM IST Stock Market Indian Stock Market LIVE Today: Nifty, Sensex set for flat start; JSW Steel, IndiGo, Bharat Forge in focus Dec 31, 2025 - 9:00 AM IST Stock Market Nifty, Sensex set for flat op",
                        "images": [],
                        "rank": 3
                      },
                      {
                        "url": "https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642",
                        "content": "Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Home News Create Screeners Insights ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal 1 min read Updated on 30 Dec 2025, 08:34 PM Reviewed by Riya D ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals experienced a 13% share price decline following the execution of a major block deal worth 1,086 crores involving 38.8 lakh shares at 2,799 per share. The transaction, representing 9.93% of outstanding equity, significantly exceeded the initially planned 700 crore deal size and was executed below the indicated price range, demonstrating expanded promoter divestment despite the company's strong 65% annual performance. *this image is generated using AI for illustrative purposes only. Privi Speciality Chemicals shares declined as much as 13.00% following the execution of a major block deal worth 1,086.00 crores. The transaction involved 38.80 lakh shares, representing 9.93% of the company's outstanding equity, executed at an average price of 2,799.00 per share. Block Deal Execution and Market Impact The completed transaction exceeded the initially announced deal parameters, demonstrating significant institutional participation: Transaction Parameter: Final Execution Details Total Value: 1,086.00 crores Shares Traded: 38.80 lakh shares Average Price: 2,799.00 per share Equity Stake: 9.93% Market Reaction: -13.00% decline Current Trading Price: 2,794.30 The execution price of 2,799.00 per share came below the initially indicated price range of 2,835.00 to 2,850.00, representing an 11.10% discount to the previous day's closing price. Transaction Scale Evolution The actual block deal significantly exceeded initial projections: Comparison Metrics: Initial Plan Final Execution Deal Value: 700.00 crores 1,086.00 crores Shares Involved: Up to 6.30% stake 38.80 lakh shares Stake Percentage: 6.30% 9.93% Price Range: 2,835.00-2,850.00 2,799.00 The substantial increase in transaction size from 700.00 crores to 1,086.00 crores indicates expanded divestment by the promoter entity. Shareholding Structure The company maintains a concentrated ownership structure with strong promoter presence: Shareholder Category: Stake Percentage Promoters: 69.89% Mutual Funds: 3.91% SBI MF: 3.64% Retail Shareholders: 8.70% Large Retail: 6.67% Promoters held 69.89% stake as of the September quarter, with over 26,000 retail shareholders holding up to 2.00 lakh authorized share capital maintaining an 8.70% stake. Performance Context Despite the current decline, the stock maintains strong annual performance: Performance Metrics: Current Status Annual Returns: +65.00% Market Capitalization: 12,392.10 crores Sector: Chemicals Market Segment: Mid Cap Best Performance Since: 2021 (+240%) The stock has gained 65.00% in the current calendar year, marking its best performance since 2021 when it recorded gains of over 240.00%. Historical Stock Returns for Privi Speciality Chemicals 1 Day 5 Days 1 Month 6 Months 1 Year 5 Years - 0. 97 % - 17. 50 % - 12. 14 % + 21. 73 % + 55. 00 % + 414. 29 % Privi Speciality Chemicals View in Depth 16 Read Next Article ScanX News Orders & Deals Privi Speciality Chemicals Shares Fall 13% After 1,086 Cr Block Deal Privi Speciality Chemicals Board Approves Fresh Amalgamation Scheme 2 min read Updated on 15 Nov 2025, 12:47 PM Reviewed by Radhika S ScanX News Team Add as a preferred source on Google Overview Privi Speciality Chemicals has approved a comprehensive amalgamation scheme involving its subsidiaries Privi Fine Sciences and Privi Biotechnologies, following withdrawal of an earlier scheme. The Board-approved restructuring includes specific share exchange ratios, independent valuations, and aims to create operational synergies while enhancing market competitiveness through consolidated operations. *this image is generated using",
                        "images": [],
                        "rank": 4
                      },
                      {
                        "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-ltd-hits-intraday-low-amid-price-pressure-3775941",
                        "content": "Privi Speci. at Day Low Even weak stocks have their moments. Is this being tracked by our systems? NEW Stock belongs to [Strategy Name] Strategy Privi Speci. Industry: Public Sector Bank Market Cap: Mid Cap Date of Entry 31 Oct 25 Entry Price(INR) 136.95 Return 9.82% BSE500 Return 0.73% We add 2-5 new stocks every week Unlock Strategy Miss Premium 100% Secure No credit card required Stocks Portfolios Markets Webinars Wealth Sign Up For FREE THE MOJO TIMES Latest LOGIN Home Stocks Top Mojo Stocks Hidden Turnarounds Reliable Performers MomentumNow Stocks Stock of the Week NEW Stock of the Month Screener Stock Research Research Reports Switcher Report Trading Calls Portfolios Personal Portfolios Your Watchlist Markets Markets Today Earnings News IPO Webinars Upcoming Webinars Previous Recordings Blogs Media Centre Subscribe at Preferred rates Wealth THE MOJO TIMES Latest PREMIUM My Profile Reset Password Feedback My Feedback Logout THE MOJO TIMES STOCKS IN ACTION STOCK RECOMMENDATION RESULT ANALYSIS ACROSS THE WEB STOCK MARKET NEWS MOJO PREMIUM Home News Stocks in Action Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Dec 31 2025 09:41 AM IST share Privi Speciality Chemicals Ltd experienced significant intraday weakness on 31 Dec 2025, with its stock price touching a low of Rs 2,752.6, marking a 13.23% decline from the previous close. The stock underperformed its sector and broader market indices, reflecting immediate selling pressure despite a generally positive market environment. Intraday Price Movement and Market Context On the trading day, Privi Speciality Chemicals Ltd opened sharply lower, down 8.36% from its prior close, setting a negative tone early in the session. The stock continued to slide, reaching its intraday low of Rs 2,752.6, representing a 13.23% drop. This decline was notably steeper than the sectors performance, with the stock underperforming the Specialty Chemicals sector by 12.67% on the day. In contrast, the broader market showed resilience. The Sensex opened 118.50 points higher and traded at 84,830.41, up 0.18%, maintaining a position close to its 52-week high of 86,159.02, just 1.57% away. The Sensexs bullish technical setup was evident as it traded above its 50-day moving average, which itself was positioned above the 200-day moving average. Small-cap stocks led the market rally, with the BSE Small Cap index gaining 0.52% on the day. Despite this positive market backdrop, Privi Speciality Chemicals Ltds share price faced downward pressure, diverging from the broader indices and sector trends. Technical Indicators and Moving Averages The stocks technical positioning showed mixed signals. While the price remained above its 100-day and 200-day moving averages, it was trading below its shorter-term moving averages, including the 5-day, 20-day, and 50-day averages. This suggests that recent momentum has weakened, with short-term trends exerting downward pressure despite longer-term support levels holding firm. The gap down opening and subsequent decline below key short-term averages indicate that sellers dominated early trading, possibly triggered by profit-taking or other immediate factors impacting sentiment. Performance Comparison Over Various Timeframes Examining Privi Speciality Chemicals Ltds performance over multiple periods highlights the contrast between recent weakness and longer-term strength. The stocks one-day return was -11.55%, significantly lagging the Sensexs 0.17% gain. Over the past week, the stock declined 16.33%, compared to a 0.69% drop in the Sensex. The one-month performance also showed underperformance, with the stock down 11.06% versus the Sensexs 0.96% decline. However, over longer horizons, Privi Speciality Chemicals Ltd has delivered robust returns. The three-month gain stands at 18.91%, well above the Sensexs 4.73%. The one-year and year-to-date returns are both 58.61",
                        "images": [],
                        "rank": 5
                      }
                    ],
                    "annotations": null
                  }
                ]
              }
            },
            "logs": "\n\u001b[1m  RetrieverAgent finished\u001b[0m\n{'output_keys': ['forum_discussions_T002', 'call_self', 'code_variants']}\n\n\u001b[1m \u001b[0m\u001b[1m[\u001b[0m\u001b[1mCODE:\u001b[0m\u001b[1m]\u001b[0m\u001b[1m: forum_discussions_T002 = \u001b[0m\u001b[1m[\u001b[0m\u001b[1m]\u001b[0m\n\u001b[1mtotal_tokens = \u001b[0m\u001b[1;36m549\u001b[0m\n\u001b[1mreads_data = \u001b[0m\u001b[1m{\u001b[0m\u001b[1m}\u001b[0m\n\u001b[1mresults = \u001b[0m\u001b[1;35mjson.loads\u001b[0m\u001b[1m(\u001b[0m\u001b[1;35msearch_web_with_text_content\u001b[0m\u001b[1m(\u001b[0m\u001b[1;32m'Privi Speciality Chemicals \u001b[0m\n\u001b[1;32mstock price decline forum discussion sentiment analysis'\u001b[0m\u001b[1m, \u001b[0m\u001b[1;36m8\u001b[0m\u001b[1m)\u001b[0m\u001b[1m)\u001b[0m\n\u001b[1mreturn \u001b[0m\u001b[1m{\u001b[0m\u001b[1;32m'forum_discussions_T002'\u001b[0m\u001b[1m: results\u001b[0m\u001b[1m}\u001b[0m\n",
            "execution_time": "2026-01-02 15:03:07",
            "total_time": "17.567",
            "executed_variant": "CODE_1A"
          }
        }
      ],
      "input_tokens": 493,
      "output_tokens": 52,
      "total_tokens": 545
    },
    {
      "id": "T002",
      "description": "Retrieve relevant discussions from financial forums and social media regarding the stock price decline of Privi Speciality Chemicals.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Search financial forums and social media platforms for discussions and opinions about the recent stock price decline of \"Privi Speciality Chemicals\". Focus on sentiment analysis, predictions of bounce-back, and concerns expressed by investors.",
      "reads": [],
      "writes": [
        "forum_discussions_T002"
      ],
      "status": "completed",
      "output": {
        "forum_discussions_T002": [],
        "call_self": false,
        "code_variants": {
          "CODE_1A": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals stock price decline forum discussion sentiment analysis', 8))\nreturn {'forum_discussions_T002': results}",
          "CODE_1B": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals stock investors concern bounce back prediction', 6))\nreturn {'forum_discussions_T002': results}"
        },
        "cost": 7.110000000000001e-05,
        "input_tokens": 495,
        "output_tokens": 54,
        "total_tokens": 549,
        "execution_result": {
          "forum_discussions_T002": {
            "content": [
              {
                "type": "text",
                "text": [
                  {
                    "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-stock-declines-6-61-amid-broader-market-downturn-1735879",
                    "content": "Privi Speci. at Day Low Even weak stocks have their moments. Is this being tracked by our systems? NEW Stock belongs to [Strategy Name] Strategy Privi Speci. Industry: Public Sector Bank Market Cap: Mid Cap Date of Entry 31 Oct 25 Entry Price(INR) 136.95 Return 9.82% BSE500 Return 0.73% We add 2-5 new stocks every week Unlock Strategy Miss Premium 100% Secure No credit card required Stocks Portfolios Markets Webinars Wealth Sign Up For FREE THE MOJO TIMES Latest LOGIN Home Stocks Top Mojo Stocks Hidden Turnarounds Reliable Performers MomentumNow Stocks Stock of the Week NEW Stock of the Month Screener Stock Research Research Reports Switcher Report Trading Calls Portfolios Personal Portfolios Your Watchlist Markets Markets Today Earnings News IPO Webinars Upcoming Webinars Previous Recordings Blogs Media Centre Subscribe at Preferred rates Wealth THE MOJO TIMES Latest PREMIUM My Profile Reset Password Feedback My Feedback Logout THE MOJO TIMES STOCKS IN ACTION STOCK RECOMMENDATION RESULT ANALYSIS ACROSS THE WEB STOCK MARKET NEWS MOJO PREMIUM Home News Stocks in Action Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Apr 07 2025 09:46 AM IST share Privi Speciality Chemicals' shares fell significantly today, underperforming the chemicals sector. The stock has faced consecutive losses over the past three days but has shown resilience with a monthly gain. However, its three-month performance has been less favorable compared to the broader market, reflecting cautious sentiment. Privi Speciality Chemicals has experienced a significant decline today, with shares dropping by 6.61%. This midcap company, part of the chemicals industry, has underperformed compared to its sector, which has seen a decrease of 4.83%. The stock opened with a notable gap down of 20.04%, reaching an intraday low of Rs 1397.5. Over the past three days, Privi has faced consecutive losses, totaling a decline of 10.09%. Despite today's downturn, the stock has shown resilience over the past month, with a gain of 7.22%, contrasting with the Sensex's decline of 2.26% during the same period. However, over the last three months, Privi's performance has been less favorable, with a drop of 13.72%, while the Sensex fell by 7.09%. In terms of moving averages, Privi's stock price is currently above the 20-day, 50-day, and 200-day moving averages but below the 5-day and 100-day averages. The overall market sentiment remains cautious, as the Sensex is trading below its 50-day moving average and is nearing its 52-week low.    (%) | Vol: (%) Related Stock Links Analysis Technicals Quality Valuation Financial Trend Return Analysis Price Analysis Quarterly Result Analysis Half-Yearly Result Analysis Nine Monthly Result Analysis Annual Results Balance Sheet Profit & Loss Cash Flow News Announcements Share Holding Peer Comparison Our Weekly And Monthly Stock Recommendations Are Here Loading... Related News Privi Speciality Chemicals Ltd Sees Technical Momentum Shift Amid Volatile Trading Jan 01 2026 08:07 AM IST share Privi Speciality Chemicals Downgraded to Hold Amid Mixed Technical and Valuation Signals Jan 01 2026 08:06 AM IST share Why is Privi Speciality Chemicals Ltd falling/rising? Jan 01 2026 01:42 AM IST share Privi Speciality Chemicals Ltd Sees Sharp Value Turnover Amid Steep Price Decline Dec 31 2025 10:00 AM IST share Privi Speciality Chemicals Ltd Hits Intraday Low Amid Price Pressure Dec 31 2025 09:41 AM IST share Privi Speciality Chemicals Ltd Opens with Weak Start, Significant Gap Down Amid Market Concerns Dec 31 2025 09:40 AM IST share Privi Speciality Chemicals Ltd is Rated Buy Dec 29 2025 10:10 AM IST share Most Read Callista Industries Ltd Stock Hits Record High of Rs.118 on 2 Jan 2026 17 minutes ago share SMT Engineering Ltd Stock Hits All-Time High at Rs.203.6 25 minutes ago share Cholamandalam Investment & Finance Company Ltd Hits",
                    "images": [],
                    "rank": 1
                  },
                  {
                    "url": "https://stocktwits.com/symbol/PRIVISCL.NSE/sentiment",
                    "content": "Privi Speciality Chemicals Ltd. (PRIVISCL) sentiment score, message volume, participation score and buzz level Use App Trending News Earnings Newsletters Work With Us All Loading... Loading... Loading... Loading... home Symbol PRIVISCL.NSE PRIVISCL.NSE Privi Speciality Chemicals Ltd. 44 Loading... Loading... Feed News Sentiment Fundamentals Info Sentiment Indicates whether most users posting on a symbols stream over the last 24 hours are fearful or greedy. 0 25 50 75 100 Extreme Fear Neutral Greed Extreme Fear Greed N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Message Volume Measures the total amount of chatter on a stream over the last 24 hours. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Participation Ratio Measures the number of unique accounts posting on a stream relative to the number of total messages on that stream. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Latest PRIVISCL.NSE News View Advertisement | Remove ads. Advertisement | Remove ads. Advertisement | Remove ads. Watchlist Trending News Explore Community Profile",
                    "images": [],
                    "rank": 2
                  },
                  {
                    "url": "https://finance.yahoo.com/quote/PRIVISCL.NS/community/",
                    "content": "Oops, something went wrong Tesla's sales outlook is darkening, despite Musk's self-driving euphoria (Bloomberg) The K-shaped consumer is 'alive and well' and testing the US economy The biggest changes for retirees and retirement savers in 2026 Jerome Powell mostly held the Fed together last year. That may get harder in 2026 These stocks are the markets biggest winners and losers in 2025 (Bloomberg) 'Kindness matters': Wall Street reacts to Warren Buffett's last day as Berkshire Hathaway's CEO as he hands the reins over to Greg Abel. Stocks capped a roller-coaster 2025 by notching double-digit gains, as the AI trade powered markets once again. Mortgage rates end 2025 at fresh low, giving buyers an 'encouraging sign' into new year Bitcoin is capping a year defined by a surge to record highs followed by a dramatic crash. Here's what could come next. Stocks ticked higher at Wednesday's open, with Wall Street on track to celebrate double-digit gains in 2025 Soaring stocks, the return of Trump, and the AI boom capped a wild year for markets. Here's a look back at the biggest moments. US tariff rates are at 80-year highs. And the global economy may have to start learning to live with American protectionism. Take one final check in with Warren Buffett's favorite stock market indicator before he hands over the reigns at Berkshire. Gold and silver rebounded after a sharp sell-off, fueling optimism that the precious metals' historic rally may have room to run. Dow, S&P 500, Nasdaq slip as stocks struggle for gains in last stretch of 2025 Cutting rates in December was a close call, the minutes showed. Some officials suggested it could be 'some time' before another one. The automaker previewed a decline in its fourth-quarter sales a figure that would be a steeper drop than analyst estimates. Stocks wavered at the open, with Wall Street awaiting the release of the Fed's meeting minutes for any clues on its next move Gold and silver plunged, as precious metals pulled back from a historic rally. Here's what's driving the sudden reversal. Every Wall Street analyst now predicts a stock rally will come in 2026 (Bloomberg) Dow, S&P 500, Nasdaq slip as Santa Claus rally stumbles amid Nvidia, Tesla slide 'Homebuyer momentum is building': Pending home sales are up, buoyed by lower mortgage rates and more inventory SoftBank to pay $4 billion for data center firm DigitalBridge (Bloomberg) The S&P 500 and Nasdaq slid at the open, as Nvidia and Tesla led tech lower to begin 2025's final stretch The tenuous peace between Trump and the $30 trillion US bond market 'I don't see a bubble': Why Wall Street thinks the stock market can keep climbing even as AI anxiety grows Making fortunes and letting it ride: 13 New Year investing resolutions Banking predictions for 2026: 5 ways the industry will evolve next year These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says Stocks sit near record highs as a 'Santa Claus rally' builds and 2026 approaches. Here's what to watch this week. Amid growing fears about an AI bubble, is it time to flip the script on the 60/40 investment strategy? Experts weigh in. Why is silver outperforming gold? Here's what to know. 3 big surprises that caught stock market pros off guard in 2025 Why mortgage rates are stuck at 6.2% and might stay there The AI giant's licensing deal with Groq is a prime example of how it uses its massive balance sheet to 'maintain dominance' US stocks notched solid weekly gains to begin the 'Santa Claus rally' period Gold's rally is so voracious that bulls are taunting investors of floundering cryptocurrencies. 'The time has come' to switch. Intel stock has soared this year. Now 'everything hinges' on what comes next. Stocks open little changed as Wall Street heads for winning week and tries to keep 'Santa Claus rally' going Copper prices are soaring. Here's what that often signals for the economy. New data sent mixed signals about the economy, causing mortgage rates to drop slightly. I",
                    "images": [],
                    "rank": 3
                  },
                  {
                    "url": "https://economictimes.indiatimes.com/privi-speciality-chemicals-ltd/stocks/companyid-8120.cms",
                    "content": "Privi Speciality Chemicals Share Price Today, Privi Speciality Chemicals Stock Price Live NSE/BSE Updates Hi, User Sign in + Home Stocks Technical Signals Upside Radar Big Bulls Stock Reports + Market Mood ePaper News Recos Screeners Stock Talk Privi Speciality Chemicals Share Price Overview Recos News Analysis Financials Forecast Technicals Peers Shareholdings MF F&O Corp Actions About Classic View Please select checkbox: Enhanced View Privi Speciality Chemicals Share Price 2,782.90 -16.30 ( -0.59 %) 2,780.00 -23.90 ( -0.85 %) NSE BSE Live As On: 02 Jan, 2026, 03:02 PM IST As On: 02 Jan, 2026, 03:04 PM IST Sector: Chemicals Industry: Chemicals - Others STOCK SCORE Unlock Scores 1D 1W 1M 3M 6M 1Y 5Y Loading... Add to Watchlist Open 2,792.80 High 2,808.80 Low 2,700.00 Prev Close 2,799.20 Volume 3,71,184 VWAP () 2,755.92 Learn Value Investing Buy or Sell? Ask ET Experts Key Metrics PE Ratio (x) 40.50 EPS - TTM () 68.30 MCap ( Cr.) 10,805.14 MCap Rank 16 PB Ratio (x) 9.78 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,440.50 52W Low () 1,368.15 MCap/Sales 3.17 Beta (1 Month) -0.46 BV/Share () 286.19 PE Ratio (x) 40.70 EPS - TTM () 68.30 MCap ( Cr.) 10,807.67 MCap Rank 16 PB Ratio (x) 9.80 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,433.00 52W Low () 1,352.15 MCap/Sales 3.17 Beta (1 Month) -0.60 BV/Share () 286.19 Privi Speciality Chemicals share price insights ROE Outperforming 5 Year Average Company delivered ROE of 16.94% in year ending Mar 31, 2025 outperforming its 5 year avg. of 11.8%. (Source: Consolidated Financials) Beating 3 Yr Revenue CAGR Company's annual revenue growth of 19.3% outperformed its 3 year CAGR of 13.75%. (Source: Consolidated Financials) Employee & Interest Expense Company has spent 4.18% of its operating revenues towards interest expenses and 4.12% towards employee cost in the year ending Mar 31, 2025. (Source: Consolidated Financials) Privi Speciality Chemicals Share Price Update Privi Speciality Chemicals Ltd. share price moved down by -0.51% from its previous close of Rs 2,799.20. Privi Speciality Chemicals Ltd. stock last traded price is 2,785.00 Share Price Value Today/Current/Last 2,785.00 2,781.45 Previous Day 2,799.20 2,803.90 Found Insights useful? Privi Speciality Chemicals Share Price Returns 1 Day -0.59% 1 Month -12.14% 3 Months 17.96% 1 Year 55.05% 3 Years 136.64% 5 Years 416.31% 1 Day -0.85% 1 Month -12.37% 3 Months 17.81% 1 Year 54.53% 3 Years 136.8% 5 Years 416.97% Privi Speciality Chemicals Share Recommendations Mean recos Current STRONG BUY 2 Analysts Strong Sell Sell Hold Buy Strong Buy Analyst Trends Ratings Current 1W Ago 1M Ago 3M Ago Strong Buy 1 1 1 - Buy 1 1 1 - Hold - - - - Sell - - - - Strong Sell - - - - # Analysts 2 2 2 - View all Stock Recommendations News & Analysis New Year stock picks 2026: Motilal Oswal suggests HCL Tech, Eternal among 11 names to buy News Technical picks: Axis Securities favours 3 stocks for up to 18% returns as Nifty eyes record high News Nestle India among 4 stocks showing bullish candlestick pattern News Disclosures under Reg. 29(2) of SEBI (SAST) Regulations, 2011 Announcements View all Privi Speciality Chemicals Share News & Announcements Share Analysis EARNINGS FUNDAMENTAL RELATIVE VALUATION RISK PRICE MOMENTUM Unlock Stock Score, Analyst' Ratings & Recommendations Score on 10-point scale Ratings by analysts Stock performance JOIN ET PRIME Financials Consolidated Standalone Income (P&L) Quarterly Annual Sep 2025 Jun 2025 Mar 2025 Dec 2024 Sep 2024 Total Income 678.82 567.80 628.37 493.06 537.27 Total Income Growth (%) 19.55 -9.64 27.44 -8.23 15.13 Total Expenses 532.28 462.96 515.87 410.39 454.97 Total Expenses Growth (%) 14.97 -10.26 25.70 -9.80 13.25 EBIT 146.54 104.84 112.50 82.67 82.30 EBIT Growth (%) 39.77 -6.81 36.09 0.45 26.72 Profit after Tax (PAT) 93.91 61.93 66.52 44.44 44.66 PAT Growth (%) 51.64 -6.91 49.71 -0.51 42.38 EBIT Margin (%) 21.59 18.46 17.90 16.77 15.32 Net Profit Margin (%) 13.83 10.91 10.59 9.01 8.31 Basic EP",
                    "images": [],
                    "rank": 4
                  },
                  {
                    "url": "https://www.youtube.com/shorts/xsruOFyqRCs",
                    "content": "Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? 10Likes 726Views 31 Dec2025 Privi Speciality Chemicals stock has dropped 13% sharply, surprising investors! In this video, we analyze the reasons behind the sudden fall and break down the key factors that triggered market selling. Whether youre tracking chemical stocks or broader market sentiment, this analysis will help you understand whats really happening . In this video, you will learn: What caused the stock to decline 13%  Market sentiment & sector impact  Key technical levels traders should watch  Is this a correction or a sign of deeper weakness?  What investors should do next buy / hold / watch This update is helpful for traders, investors, and stock market learners looking to decode sudden price moves and make informed decisions.  Comment below What do you think is the reason for the fall? #PriviSpecialityChemicals#stockmarketindia#StockFall#sharemarketnews#stockanalysis#investmentinsights#marketupdate#chemicalstocks#tradingupdates#financeeducation Privi Speciality Chemicals stock analysis, Privi stock falls, Why Privi stock down, Chemical stocks India, Stock market news India, Share market update, Sudden stock decline, Investment strategy, Trading analysis, Market volatility, Stock price fall...more ...more Show less Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? @RamanVerma-rm Next video Tap to unmute 2x Search Info Shopping If playback doesn't begin shortly, try restarting your device. You're signed out Videos that you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer. CancelConfirm Share An error occurred while retrieving sharing information. Please try again later.",
                    "images": [],
                    "rank": 5
                  }
                ],
                "annotations": null
              }
            ]
          }
        },
        "execution_status": "success",
        "execution_error": null,
        "execution_time": "2026-01-02 15:03:42",
        "executed_variant": "CODE_1A",
        "execution_logs": ""
      },
      "error": null,
      "cost": 7.110000000000001e-05,
      "start_time": "2026-01-02T09:33:05.840303",
      "end_time": "2026-01-02T09:34:22.408035",
      "execution_time": 76.567732,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "forum_discussions_T002": [],
            "call_self": false,
            "code_variants": {
              "CODE_1A": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals stock price decline forum discussion sentiment analysis', 8))\nreturn {'forum_discussions_T002': results}",
              "CODE_1B": "results = json.loads(search_web_with_text_content('Privi Speciality Chemicals stock investors concern bounce back prediction', 6))\nreturn {'forum_discussions_T002': results}"
            },
            "cost": 7.110000000000001e-05,
            "input_tokens": 495,
            "output_tokens": 54,
            "total_tokens": 549
          },
          "execution_result": {
            "status": "success",
            "result": {
              "forum_discussions_T002": {
                "content": [
                  {
                    "type": "text",
                    "text": [
                      {
                        "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-stock-declines-6-61-amid-broader-market-downturn-1735879",
                        "content": "Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Stocks in Action News Home Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium The Mojo Times Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium Home News Stocks in Action Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Apr 07 2025 09:46 AM IST share Share Via Privi Speciality Chemicals' shares fell significantly today, underperforming the chemicals sector. The stock has faced consecutive losses over the past three days but has shown resilience with a monthly gain. However, its three-month performance has been less favorable compared to the broader market, reflecting cautious sentiment. Privi Speciality Chemicals has experienced a significant decline today, with shares dropping by 6.61%. This midcap company, part of the chemicals industry, has underperformed compared to its sector, which has seen a decrease of 4.83%. The stock opened with a notable gap down of 20.04%, reaching an intraday low of Rs 1397.5. Over the past three days, Privi has faced consecutive losses, totaling a decline of 10.09%. Despite today's downturn, the stock has shown resilience over the past month, with a gain of 7.22%, contrasting with the Sensex's decline of 2.26% during the same period. However, over the last three months, Privi's performance has been less favorable, with a drop of 13.72%, while the Sensex fell by 7.09%. In terms of moving averages, Privi's stock price is currently above the 20-day, 50-day, and 200-day moving averages but below the 5-day and 100-day averages. The overall market sentiment remains cautious, as the Sensex is trading below its 50-day moving average and is nearing its 52-week low. {{stockdata.stock.stock_name.value}} Live {{stockdata.stock.price.value}} {{stockdata.stock.price_difference.value}} ({{stockdata.stock.price_percentage.value}}%) {{stockdata.stock.date.value}} | BSE+NSE Vol: {{stockdata.index_name}} Vol: {{stockdata.stock.bse_nse_vol.value}} ({{stockdata.stock.bse_nse_vol_per.value}}%) MOJO SCORE {{ moreButtonText }} {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Strong Sell {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Sell {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Hold {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Buy {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Strong Buy {{i+1}} {{key.head}} {{li}} {{dashverdictresult.dashboard.tab1_txt| uppercase}} {{text.big_txt}} {{text .small_txt}} {{dashverdictresult.dashboard.stock_details.short_name}} {{dashverdictresult.dashboard.stock_callafter}} This is a Paid Feature for MojoOne Subscribers Click here to Get Started Sign up to download verdict report Sign up to download verdict report {{loader_stocks[0][\"loader_dw\"]}} Download SEND BY EMAIL {{email_id_ver_err}} {{dashverdictresult.dashboard.tab2_txt| uppercase}} Register now to see if the stocks characteristics match your investment style Click here to Register Click here to Register Subscribe now to see if the stock's characteristics match your investment style Click here to Get Started {{dashverdictresult.dashboard.risk_return_voltality.risk_type}}, {{dashverdictresult.dashboard.risk_return_voltality.return_type}} {{ value[0] }} {{ value[1] }} {{ value[2] }} {{ value[3] }} {{ value[0] }} {{ value[1] }} {{ value[2] }} {{ value[3] }} {{dashverdictresult.dashboard.howMuchTabTxt|uppercase}} Create your portfolio and know how much should this stock be i",
                        "images": [],
                        "rank": 1
                      },
                      {
                        "url": "https://stocktwits.com/symbol/PRIVISCL.NSE/sentiment",
                        "content": "Privi Speciality Chemicals Ltd. (PRIVISCL) sentiment score, message volume, participation score and buzz level Use App Trending News Earnings Newsletters Work With Us All Loading... Loading... Loading... Loading... home Symbol PRIVISCL.NSE PRIVISCL.NSE Privi Speciality Chemicals Ltd. 44 Loading... Loading... Feed News Sentiment Fundamentals Info Sentiment Indicates whether most users posting on a symbols stream over the last 24 hours are fearful or greedy. 0 25 50 75 100 Extreme Fear Neutral Greed Extreme Fear Greed N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Message Volume Measures the total amount of chatter on a stream over the last 24 hours. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Participation Ratio Measures the number of unique accounts posting on a stream relative to the number of total messages on that stream. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Latest PRIVISCL.NSE News View Advertisement | Remove ads. Advertisement | Remove ads. Advertisement | Remove ads. Watchlist Trending News Explore Community Profile",
                        "images": [],
                        "rank": 2
                      },
                      {
                        "url": "https://finance.yahoo.com/quote/PRIVISCL.NS/community/",
                        "content": "Oops, something went wrong Oops, something went wrong Tesla's sales outlook is darkening, despite Musk's self-driving euphoria (Bloomberg) The K-shaped consumer is 'alive and well' and testing the US economy The biggest changes for retirees and retirement savers in 2026 Jerome Powell mostly held the Fed together last year. That may get harder in 2026 These stocks are the markets biggest winners and losers in 2025 (Bloomberg) 'Kindness matters': Wall Street reacts to Warren Buffett's last day as Berkshire Hathaway's CEO as he hands the reins over to Greg Abel. Stocks capped a roller-coaster 2025 by notching double-digit gains, as the AI trade powered markets once again. Mortgage rates end 2025 at fresh low, giving buyers an 'encouraging sign' into new year Bitcoin is capping a year defined by a surge to record highs followed by a dramatic crash. Here's what could come next. Stocks ticked higher at Wednesday's open, with Wall Street on track to celebrate double-digit gains in 2025 Soaring stocks, the return of Trump, and the AI boom capped a wild year for markets. Here's a look back at the biggest moments. US tariff rates are at 80-year highs. And the global economy may have to start learning to live with American protectionism. Take one final check in with Warren Buffett's favorite stock market indicator before he hands over the reigns at Berkshire. Gold and silver rebounded after a sharp sell-off, fueling optimism that the precious metals' historic rally may have room to run. Dow, S&P 500, Nasdaq slip as stocks struggle for gains in last stretch of 2025 Cutting rates in December was a close call, the minutes showed. Some officials suggested it could be 'some time' before another one. The automaker previewed a decline in its fourth-quarter sales a figure that would be a steeper drop than analyst estimates. Stocks wavered at the open, with Wall Street awaiting the release of the Fed's meeting minutes for any clues on its next move Gold and silver plunged, as precious metals pulled back from a historic rally. Here's what's driving the sudden reversal. Every Wall Street analyst now predicts a stock rally will come in 2026 (Bloomberg) Dow, S&P 500, Nasdaq slip as Santa Claus rally stumbles amid Nvidia, Tesla slide 'Homebuyer momentum is building': Pending home sales are up, buoyed by lower mortgage rates and more inventory SoftBank to pay $4 billion for data center firm DigitalBridge (Bloomberg) The S&P 500 and Nasdaq slid at the open, as Nvidia and Tesla led tech lower to begin 2025's final stretch The tenuous peace between Trump and the $30 trillion US bond market 'I don't see a bubble': Why Wall Street thinks the stock market can keep climbing even as AI anxiety grows Making fortunes and letting it ride: 13 New Year investing resolutions Banking predictions for 2026: 5 ways the industry will evolve next year These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says Stocks sit near record highs as a 'Santa Claus rally' builds and 2026 approaches. Here's what to watch this week. Amid growing fears about an AI bubble, is it time to flip the script on the 60/40 investment strategy? Experts weigh in. Why is silver outperforming gold? Here's what to know. 3 big surprises that caught stock market pros off guard in 2025 Why mortgage rates are stuck at 6.2% and might stay there The AI giant's licensing deal with Groq is a prime example of how it uses its massive balance sheet to 'maintain dominance' US stocks notched solid weekly gains to begin the 'Santa Claus rally' period Gold's rally is so voracious that bulls are taunting investors of floundering cryptocurrencies. 'The time has come' to switch. Intel stock has soared this year. Now 'everything hinges' on what comes next. Stocks open little changed as Wall Street heads for winning week and tries to keep 'Santa Claus rally' going Copper prices are soaring. Here's what that often signals for the economy. New data sent mixed signals about the economy, causing mortgage",
                        "images": [],
                        "rank": 3
                      },
                      {
                        "url": "https://economictimes.indiatimes.com/privi-speciality-chemicals-ltd/stocks/companyid-8120.cms",
                        "content": "Privi Speciality Chemicals Share Price Today, Privi Speciality Chemicals Stock Price Live NSE/BSE Updates Hi, User Sign in + Home Stocks Technical Signals Upside Radar Big Bulls Stock Reports + Market Mood ePaper News Recos Screeners Stock Talk Privi Speciality Chemicals Share Price Overview Recos News Analysis Financials Forecast Technicals Peers Shareholdings MF F&O Corp Actions About Classic View Please select checkbox: Enhanced View Privi Speciality Chemicals Share Price 2,785.00 -14.20 ( -0.51 %) 2,781.45 -22.45 ( -0.80 %) NSE BSE Live As On: 02 Jan, 2026, 03:02 PM IST As On: 02 Jan, 2026, 03:02 PM IST Sector: Chemicals Industry: Chemicals - Others STOCK SCORE Unlock Scores 1D 1W 1M 3M 6M 1Y 5Y Loading... Add to Watchlist Open 2,792.80 High 2,808.80 Low 2,700.00 Prev Close 2,799.20 Volume 3,71,168 VWAP () 2,755.92 Learn Value Investing Buy or Sell? Ask ET Experts Key Metrics PE Ratio (x) 40.50 EPS - TTM () 68.30 MCap ( Cr.) 10,805.14 MCap Rank 16 PB Ratio (x) 9.78 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,440.50 52W Low () 1,368.15 MCap/Sales 3.17 Beta (1 Month) -0.46 BV/Share () 286.19 PE Ratio (x) 40.70 EPS - TTM () 68.30 MCap ( Cr.) 10,807.67 MCap Rank 16 PB Ratio (x) 9.80 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,433.00 52W Low () 1,352.15 MCap/Sales 3.17 Beta (1 Month) -0.60 BV/Share () 286.19 Privi Speciality Chemicals share price insights ROE Outperforming 5 Year Average Company delivered ROE of 16.94% in year ending Mar 31, 2025 outperforming its 5 year avg. of 11.8%. (Source: Consolidated Financials) Beating 3 Yr Revenue CAGR Company's annual revenue growth of 19.3% outperformed its 3 year CAGR of 13.75%. (Source: Consolidated Financials) Employee & Interest Expense Company has spent 4.18% of its operating revenues towards interest expenses and 4.12% towards employee cost in the year ending Mar 31, 2025. (Source: Consolidated Financials) Privi Speciality Chemicals Share Price Update Privi Speciality Chemicals Ltd. share price moved down by -0.51% from its previous close of Rs 2,799.20. Privi Speciality Chemicals Ltd. stock last traded price is 2,785.00 Share Price Value Today/Current/Last 2,785.00 2,781.45 Previous Day 2,799.20 2,803.90 Found Insights useful? Privi Speciality Chemicals Share Price Returns 1 Day -0.51% 1 Month -12.07% 3 Months 18.05% 1 Year 55.17% 3 Years 136.82% 5 Years 416.7% 1 Day -0.8% 1 Month -12.32% 3 Months 17.88% 1 Year 54.61% 3 Years 136.92% 5 Years 417.24% Privi Speciality Chemicals Share Recommendations Mean recos Current STRONG BUY 2 Analysts Strong Sell Sell Hold Buy Strong Buy Analyst Trends Ratings Current 1W Ago 1M Ago 3M Ago Strong Buy 1 1 1 - Buy 1 1 1 - Hold - - - - Sell - - - - Strong Sell - - - - # Analysts 2 2 2 - View all Stock Recommendations News & Analysis New Year stock picks 2026: Motilal Oswal suggests HCL Tech, Eternal among 11 names to buy News Technical picks: Axis Securities favours 3 stocks for up to 18% returns as Nifty eyes record high News Nestle India among 4 stocks showing bullish candlestick pattern News Disclosures under Reg. 29(2) of SEBI (SAST) Regulations, 2011 Announcements View all Privi Speciality Chemicals Share News & Announcements Share Analysis EARNINGS FUNDAMENTAL RELATIVE VALUATION RISK PRICE MOMENTUM Unlock Stock Score, Analyst' Ratings & Recommendations Score on 10-point scale Ratings by analysts Stock performance JOIN ET PRIME Financials Consolidated Standalone Income (P&L) Quarterly Annual Sep 2025 Jun 2025 Mar 2025 Dec 2024 Sep 2024 Total Income 678.82 567.80 628.37 493.06 537.27 Total Income Growth (%) 19.55 -9.64 27.44 -8.23 15.13 Total Expenses 532.28 462.96 515.87 410.39 454.97 Total Expenses Growth (%) 14.97 -10.26 25.70 -9.80 13.25 EBIT 146.54 104.84 112.50 82.67 82.30 EBIT Growth (%) 39.77 -6.81 36.09 0.45 26.72 Profit after Tax (PAT) 93.91 61.93 66.52 44.44 44.66 PAT Growth (%) 51.64 -6.91 49.71 -0.51 42.38 EBIT Margin (%) 21.59 18.46 17.90 16.77 15.32 Net Profit Margin (%) 13.83 10.91 10.59 9.01 8.31 Basic EPS",
                        "images": [],
                        "rank": 4
                      },
                      {
                        "url": "https://www.youtube.com/shorts/xsruOFyqRCs",
                        "content": "Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? 10Likes 724Views 31 Dec2025 Privi Speciality Chemicals stock has dropped 13% sharply, surprising investors! In this video, we analyze the reasons behind the sudden fall and break down the key factors that triggered market selling. Whether youre tracking chemical stocks or broader market sentiment, this analysis will help you understand whats really happening . In this video, you will learn: What caused the stock to decline 13%  Market sentiment & sector impact  Key technical levels traders should watch  Is this a correction or a sign of deeper weakness?  What investors should do next buy / hold / watch This update is helpful for traders, investors, and stock market learners looking to decode sudden price moves and make informed decisions.  Comment below What do you think is the reason for the fall? #PriviSpecialityChemicals#stockmarketindia#StockFall#sharemarketnews#stockanalysis#investmentinsights#marketupdate#chemicalstocks#tradingupdates#financeeducation Privi Speciality Chemicals stock analysis, Privi stock falls, Why Privi stock down, Chemical stocks India, Stock market news India, Share market update, Sudden stock decline, Investment strategy, Trading analysis, Market volatility, Stock price fall...more ...more Show less Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? @RamanVerma-rm Next video Tap to unmute 2x Search Info Shopping If playback doesn't begin shortly, try restarting your device. You're signed out Videos that you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer. CancelConfirm Share An error occurred while retrieving sharing information. Please try again later.",
                        "images": [],
                        "rank": 5
                      }
                    ],
                    "annotations": null
                  }
                ]
              }
            },
            "raw": {
              "forum_discussions_T002": {
                "content": [
                  {
                    "type": "text",
                    "text": [
                      {
                        "url": "https://www.marketsmojo.com/news/stocks-in-action/privi-speciality-chemicals-stock-declines-6-61-amid-broader-market-downturn-1735879",
                        "content": "Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Stocks in Action News Home Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium The Mojo Times Stocks in Action Stock Recommendation Result Analysis Across The Web Stock Market News Mojo Premium Home News Stocks in Action Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Privi Speciality Chemicals Faces Significant Stock Decline Amid Market Caution Apr 07 2025 09:46 AM IST share Share Via Privi Speciality Chemicals' shares fell significantly today, underperforming the chemicals sector. The stock has faced consecutive losses over the past three days but has shown resilience with a monthly gain. However, its three-month performance has been less favorable compared to the broader market, reflecting cautious sentiment. Privi Speciality Chemicals has experienced a significant decline today, with shares dropping by 6.61%. This midcap company, part of the chemicals industry, has underperformed compared to its sector, which has seen a decrease of 4.83%. The stock opened with a notable gap down of 20.04%, reaching an intraday low of Rs 1397.5. Over the past three days, Privi has faced consecutive losses, totaling a decline of 10.09%. Despite today's downturn, the stock has shown resilience over the past month, with a gain of 7.22%, contrasting with the Sensex's decline of 2.26% during the same period. However, over the last three months, Privi's performance has been less favorable, with a drop of 13.72%, while the Sensex fell by 7.09%. In terms of moving averages, Privi's stock price is currently above the 20-day, 50-day, and 200-day moving averages but below the 5-day and 100-day averages. The overall market sentiment remains cautious, as the Sensex is trading below its 50-day moving average and is nearing its 52-week low. {{stockdata.stock.stock_name.value}} Live {{stockdata.stock.price.value}} {{stockdata.stock.price_difference.value}} ({{stockdata.stock.price_percentage.value}}%) {{stockdata.stock.date.value}} | BSE+NSE Vol: {{stockdata.index_name}} Vol: {{stockdata.stock.bse_nse_vol.value}} ({{stockdata.stock.bse_nse_vol_per.value}}%) MOJO SCORE {{ moreButtonText }} {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Strong Sell {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Sell {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Hold {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Buy {{ dashverdictresult.dashboard.value < 10 ? '0' + dashverdictresult.dashboard.value : dashverdictresult.dashboard.value }} Strong Buy {{i+1}} {{key.head}} {{li}} {{dashverdictresult.dashboard.tab1_txt| uppercase}} {{text.big_txt}} {{text .small_txt}} {{dashverdictresult.dashboard.stock_details.short_name}} {{dashverdictresult.dashboard.stock_callafter}} This is a Paid Feature for MojoOne Subscribers Click here to Get Started Sign up to download verdict report Sign up to download verdict report {{loader_stocks[0][\"loader_dw\"]}} Download SEND BY EMAIL {{email_id_ver_err}} {{dashverdictresult.dashboard.tab2_txt| uppercase}} Register now to see if the stocks characteristics match your investment style Click here to Register Click here to Register Subscribe now to see if the stock's characteristics match your investment style Click here to Get Started {{dashverdictresult.dashboard.risk_return_voltality.risk_type}}, {{dashverdictresult.dashboard.risk_return_voltality.return_type}} {{ value[0] }} {{ value[1] }} {{ value[2] }} {{ value[3] }} {{ value[0] }} {{ value[1] }} {{ value[2] }} {{ value[3] }} {{dashverdictresult.dashboard.howMuchTabTxt|uppercase}} Create your portfolio and know how much should this stock be i",
                        "images": [],
                        "rank": 1
                      },
                      {
                        "url": "https://stocktwits.com/symbol/PRIVISCL.NSE/sentiment",
                        "content": "Privi Speciality Chemicals Ltd. (PRIVISCL) sentiment score, message volume, participation score and buzz level Use App Trending News Earnings Newsletters Work With Us All Loading... Loading... Loading... Loading... home Symbol PRIVISCL.NSE PRIVISCL.NSE Privi Speciality Chemicals Ltd. 44 Loading... Loading... Feed News Sentiment Fundamentals Info Sentiment Indicates whether most users posting on a symbols stream over the last 24 hours are fearful or greedy. 0 25 50 75 100 Extreme Fear Neutral Greed Extreme Fear Greed N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Message Volume Measures the total amount of chatter on a stream over the last 24 hours. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Participation Ratio Measures the number of unique accounts posting on a stream relative to the number of total messages on that stream. 0 25 50 75 100 Extremely Low Normal High Extremely Low High N/A Last score N/A 1 day ago Sign Up / Log In 1 week ago Sign Up / Log In 1 month ago Sign Up / Log In 3 months ago Sign Up / Log In 6 months ago Sign Up / Log In 1 year ago Sign Up / Log In Latest PRIVISCL.NSE News View Advertisement | Remove ads. Advertisement | Remove ads. Advertisement | Remove ads. Watchlist Trending News Explore Community Profile",
                        "images": [],
                        "rank": 2
                      },
                      {
                        "url": "https://finance.yahoo.com/quote/PRIVISCL.NS/community/",
                        "content": "Oops, something went wrong Oops, something went wrong Tesla's sales outlook is darkening, despite Musk's self-driving euphoria (Bloomberg) The K-shaped consumer is 'alive and well' and testing the US economy The biggest changes for retirees and retirement savers in 2026 Jerome Powell mostly held the Fed together last year. That may get harder in 2026 These stocks are the markets biggest winners and losers in 2025 (Bloomberg) 'Kindness matters': Wall Street reacts to Warren Buffett's last day as Berkshire Hathaway's CEO as he hands the reins over to Greg Abel. Stocks capped a roller-coaster 2025 by notching double-digit gains, as the AI trade powered markets once again. Mortgage rates end 2025 at fresh low, giving buyers an 'encouraging sign' into new year Bitcoin is capping a year defined by a surge to record highs followed by a dramatic crash. Here's what could come next. Stocks ticked higher at Wednesday's open, with Wall Street on track to celebrate double-digit gains in 2025 Soaring stocks, the return of Trump, and the AI boom capped a wild year for markets. Here's a look back at the biggest moments. US tariff rates are at 80-year highs. And the global economy may have to start learning to live with American protectionism. Take one final check in with Warren Buffett's favorite stock market indicator before he hands over the reigns at Berkshire. Gold and silver rebounded after a sharp sell-off, fueling optimism that the precious metals' historic rally may have room to run. Dow, S&P 500, Nasdaq slip as stocks struggle for gains in last stretch of 2025 Cutting rates in December was a close call, the minutes showed. Some officials suggested it could be 'some time' before another one. The automaker previewed a decline in its fourth-quarter sales a figure that would be a steeper drop than analyst estimates. Stocks wavered at the open, with Wall Street awaiting the release of the Fed's meeting minutes for any clues on its next move Gold and silver plunged, as precious metals pulled back from a historic rally. Here's what's driving the sudden reversal. Every Wall Street analyst now predicts a stock rally will come in 2026 (Bloomberg) Dow, S&P 500, Nasdaq slip as Santa Claus rally stumbles amid Nvidia, Tesla slide 'Homebuyer momentum is building': Pending home sales are up, buoyed by lower mortgage rates and more inventory SoftBank to pay $4 billion for data center firm DigitalBridge (Bloomberg) The S&P 500 and Nasdaq slid at the open, as Nvidia and Tesla led tech lower to begin 2025's final stretch The tenuous peace between Trump and the $30 trillion US bond market 'I don't see a bubble': Why Wall Street thinks the stock market can keep climbing even as AI anxiety grows Making fortunes and letting it ride: 13 New Year investing resolutions Banking predictions for 2026: 5 ways the industry will evolve next year These 6 stocks will lead the $1 trillion chip surge in 2026, BofA says Stocks sit near record highs as a 'Santa Claus rally' builds and 2026 approaches. Here's what to watch this week. Amid growing fears about an AI bubble, is it time to flip the script on the 60/40 investment strategy? Experts weigh in. Why is silver outperforming gold? Here's what to know. 3 big surprises that caught stock market pros off guard in 2025 Why mortgage rates are stuck at 6.2% and might stay there The AI giant's licensing deal with Groq is a prime example of how it uses its massive balance sheet to 'maintain dominance' US stocks notched solid weekly gains to begin the 'Santa Claus rally' period Gold's rally is so voracious that bulls are taunting investors of floundering cryptocurrencies. 'The time has come' to switch. Intel stock has soared this year. Now 'everything hinges' on what comes next. Stocks open little changed as Wall Street heads for winning week and tries to keep 'Santa Claus rally' going Copper prices are soaring. Here's what that often signals for the economy. New data sent mixed signals about the economy, causing mortgage",
                        "images": [],
                        "rank": 3
                      },
                      {
                        "url": "https://economictimes.indiatimes.com/privi-speciality-chemicals-ltd/stocks/companyid-8120.cms",
                        "content": "Privi Speciality Chemicals Share Price Today, Privi Speciality Chemicals Stock Price Live NSE/BSE Updates Hi, User Sign in + Home Stocks Technical Signals Upside Radar Big Bulls Stock Reports + Market Mood ePaper News Recos Screeners Stock Talk Privi Speciality Chemicals Share Price Overview Recos News Analysis Financials Forecast Technicals Peers Shareholdings MF F&O Corp Actions About Classic View Please select checkbox: Enhanced View Privi Speciality Chemicals Share Price 2,785.00 -14.20 ( -0.51 %) 2,781.45 -22.45 ( -0.80 %) NSE BSE Live As On: 02 Jan, 2026, 03:02 PM IST As On: 02 Jan, 2026, 03:02 PM IST Sector: Chemicals Industry: Chemicals - Others STOCK SCORE Unlock Scores 1D 1W 1M 3M 6M 1Y 5Y Loading... Add to Watchlist Open 2,792.80 High 2,808.80 Low 2,700.00 Prev Close 2,799.20 Volume 3,71,168 VWAP () 2,755.92 Learn Value Investing Buy or Sell? Ask ET Experts Key Metrics PE Ratio (x) 40.50 EPS - TTM () 68.30 MCap ( Cr.) 10,805.14 MCap Rank 16 PB Ratio (x) 9.78 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,440.50 52W Low () 1,368.15 MCap/Sales 3.17 Beta (1 Month) -0.46 BV/Share () 286.19 PE Ratio (x) 40.70 EPS - TTM () 68.30 MCap ( Cr.) 10,807.67 MCap Rank 16 PB Ratio (x) 9.80 Div Yield (%) 0.18 Face Value () 10.00 52W High () 3,433.00 52W Low () 1,352.15 MCap/Sales 3.17 Beta (1 Month) -0.60 BV/Share () 286.19 Privi Speciality Chemicals share price insights ROE Outperforming 5 Year Average Company delivered ROE of 16.94% in year ending Mar 31, 2025 outperforming its 5 year avg. of 11.8%. (Source: Consolidated Financials) Beating 3 Yr Revenue CAGR Company's annual revenue growth of 19.3% outperformed its 3 year CAGR of 13.75%. (Source: Consolidated Financials) Employee & Interest Expense Company has spent 4.18% of its operating revenues towards interest expenses and 4.12% towards employee cost in the year ending Mar 31, 2025. (Source: Consolidated Financials) Privi Speciality Chemicals Share Price Update Privi Speciality Chemicals Ltd. share price moved down by -0.51% from its previous close of Rs 2,799.20. Privi Speciality Chemicals Ltd. stock last traded price is 2,785.00 Share Price Value Today/Current/Last 2,785.00 2,781.45 Previous Day 2,799.20 2,803.90 Found Insights useful? Privi Speciality Chemicals Share Price Returns 1 Day -0.51% 1 Month -12.07% 3 Months 18.05% 1 Year 55.17% 3 Years 136.82% 5 Years 416.7% 1 Day -0.8% 1 Month -12.32% 3 Months 17.88% 1 Year 54.61% 3 Years 136.92% 5 Years 417.24% Privi Speciality Chemicals Share Recommendations Mean recos Current STRONG BUY 2 Analysts Strong Sell Sell Hold Buy Strong Buy Analyst Trends Ratings Current 1W Ago 1M Ago 3M Ago Strong Buy 1 1 1 - Buy 1 1 1 - Hold - - - - Sell - - - - Strong Sell - - - - # Analysts 2 2 2 - View all Stock Recommendations News & Analysis New Year stock picks 2026: Motilal Oswal suggests HCL Tech, Eternal among 11 names to buy News Technical picks: Axis Securities favours 3 stocks for up to 18% returns as Nifty eyes record high News Nestle India among 4 stocks showing bullish candlestick pattern News Disclosures under Reg. 29(2) of SEBI (SAST) Regulations, 2011 Announcements View all Privi Speciality Chemicals Share News & Announcements Share Analysis EARNINGS FUNDAMENTAL RELATIVE VALUATION RISK PRICE MOMENTUM Unlock Stock Score, Analyst' Ratings & Recommendations Score on 10-point scale Ratings by analysts Stock performance JOIN ET PRIME Financials Consolidated Standalone Income (P&L) Quarterly Annual Sep 2025 Jun 2025 Mar 2025 Dec 2024 Sep 2024 Total Income 678.82 567.80 628.37 493.06 537.27 Total Income Growth (%) 19.55 -9.64 27.44 -8.23 15.13 Total Expenses 532.28 462.96 515.87 410.39 454.97 Total Expenses Growth (%) 14.97 -10.26 25.70 -9.80 13.25 EBIT 146.54 104.84 112.50 82.67 82.30 EBIT Growth (%) 39.77 -6.81 36.09 0.45 26.72 Profit after Tax (PAT) 93.91 61.93 66.52 44.44 44.66 PAT Growth (%) 51.64 -6.91 49.71 -0.51 42.38 EBIT Margin (%) 21.59 18.46 17.90 16.77 15.32 Net Profit Margin (%) 13.83 10.91 10.59 9.01 8.31 Basic EPS",
                        "images": [],
                        "rank": 4
                      },
                      {
                        "url": "https://www.youtube.com/shorts/xsruOFyqRCs",
                        "content": "Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? 10Likes 724Views 31 Dec2025 Privi Speciality Chemicals stock has dropped 13% sharply, surprising investors! In this video, we analyze the reasons behind the sudden fall and break down the key factors that triggered market selling. Whether youre tracking chemical stocks or broader market sentiment, this analysis will help you understand whats really happening . In this video, you will learn: What caused the stock to decline 13%  Market sentiment & sector impact  Key technical levels traders should watch  Is this a correction or a sign of deeper weakness?  What investors should do next buy / hold / watch This update is helpful for traders, investors, and stock market learners looking to decode sudden price moves and make informed decisions.  Comment below What do you think is the reason for the fall? #PriviSpecialityChemicals#stockmarketindia#StockFall#sharemarketnews#stockanalysis#investmentinsights#marketupdate#chemicalstocks#tradingupdates#financeeducation Privi Speciality Chemicals stock analysis, Privi stock falls, Why Privi stock down, Chemical stocks India, Stock market news India, Share market update, Sudden stock decline, Investment strategy, Trading analysis, Market volatility, Stock price fall...more ...more Show less Privi Speciality Chemicals Stock Falls 13% | What Triggered the Sharp Decline? @RamanVerma-rm Next video Tap to unmute 2x Search Info Shopping If playback doesn't begin shortly, try restarting your device. You're signed out Videos that you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer. CancelConfirm Share An error occurred while retrieving sharing information. Please try again later.",
                        "images": [],
                        "rank": 5
                      }
                    ],
                    "annotations": null
                  }
                ]
              }
            },
            "logs": "",
            "execution_time": "2026-01-02 15:03:12",
            "total_time": "25.261",
            "executed_variant": "CODE_1A"
          }
        }
      ],
      "input_tokens": 495,
      "output_tokens": 54,
      "total_tokens": 549
    },
    {
      "id": "T003",
      "description": "Analyze the news articles to identify the reasons cited for the stock price decline.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the retrieved news articles from `news_articles_T001` to identify the primary reasons given for the recent stock price decline of \"Privi Speciality Chemicals\". Extract specific factors and explanations mentioned in the articles.",
      "reads": [
        "news_articles_T001"
      ],
      "writes": [
        "reasons_for_decline_T003"
      ],
      "status": "completed",
      "output": {
        "reasons_for_decline_T003": {
          "primary_reasons": [
            {
              "reason": "Large Block Deal",
              "details": "A significant block deal involving the sale of 38.8 lakh shares, representing 9.93% of the company's equity, took place. This created immediate selling pressure.",
              "source": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html, https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/, https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642"
            },
            {
              "reason": "Discounted Transaction Price",
              "details": "The shares in the block deal were traded at an average price of Rs 2,799 per share, a 12% discount from the previous closing price of Rs 3,190.50. This steep discount put downward pressure on the stock.",
              "source": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html, https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
            },
            {
              "reason": "Stake Sale by Shareholder",
              "details": "Reports indicated that a shareholder was likely to sell up to a 6.32% stake in the company through a block deal, totaling around Rs 700 crore. The floor price was set at Rs 2,835-2,850 per share, an 11-14% discount.",
              "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
            },
            {
              "reason": "Promoter Stake Dilution History",
              "details": "Market participants recall promoter entities selling a combined 4.09% stake in June 2025, making investors cautious about recurring stake dilutions.",
              "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
            }
          ],
          "bounce_back_outlook": {
            "analyst_sentiment": "Positive",
            "details": "Despite the sharp fall, brokerage commentary remains positive. Motilal Oswal Wealth Management included Privi Speciality Chemicals in its top 10 stock picks for 2026, citing strong growth prospects and capacity expansion plans. They valued the stock at Rs 3,960, implying a 21% upside.",
            "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
          },
          "concern_level": "Moderate",
          "justification": "The stock decline is primarily due to a large block deal and associated selling pressure rather than fundamental business issues. While the promoter stake dilution history adds some concern, analysts remain positive about the company's long-term prospects. Monitoring the stock's stabilization after the block deal is advised."
        },
        "cost": 0.0005805000000000001,
        "input_tokens": 4281,
        "output_tokens": 381,
        "total_tokens": 4662
      },
      "error": null,
      "cost": 0.0005805000000000001,
      "start_time": "2026-01-02T09:34:22.415940",
      "end_time": "2026-01-02T09:34:31.024776",
      "execution_time": 8.608836,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "reasons_for_decline_T003": {
              "primary_reasons": [
                {
                  "reason": "Large Block Deal",
                  "details": "A significant block deal involving the sale of 38.8 lakh shares, representing 9.93% of the company's equity, took place. This created immediate selling pressure.",
                  "source": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html, https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/, https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642"
                },
                {
                  "reason": "Discounted Transaction Price",
                  "details": "The shares in the block deal were traded at an average price of Rs 2,799 per share, a 12% discount from the previous closing price of Rs 3,190.50. This steep discount put downward pressure on the stock.",
                  "source": "https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html, https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
                },
                {
                  "reason": "Stake Sale by Shareholder",
                  "details": "Reports indicated that a shareholder was likely to sell up to a 6.32% stake in the company through a block deal, totaling around Rs 700 crore. The floor price was set at Rs 2,835-2,850 per share, an 11-14% discount.",
                  "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
                },
                {
                  "reason": "Promoter Stake Dilution History",
                  "details": "Market participants recall promoter entities selling a combined 4.09% stake in June 2025, making investors cautious about recurring stake dilutions.",
                  "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
                }
              ],
              "bounce_back_outlook": {
                "analyst_sentiment": "Positive",
                "details": "Despite the sharp fall, brokerage commentary remains positive. Motilal Oswal Wealth Management included Privi Speciality Chemicals in its top 10 stock picks for 2026, citing strong growth prospects and capacity expansion plans. They valued the stock at Rs 3,960, implying a 21% upside.",
                "source": "https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/"
              },
              "concern_level": "Moderate",
              "justification": "The stock decline is primarily due to a large block deal and associated selling pressure rather than fundamental business issues. While the promoter stake dilution history adds some concern, analysts remain positive about the company's long-term prospects. Monitoring the stock's stabilization after the block deal is advised."
            },
            "cost": 0.0005805000000000001,
            "input_tokens": 4281,
            "output_tokens": 381,
            "total_tokens": 4662
          }
        }
      ],
      "input_tokens": 4281,
      "output_tokens": 381,
      "total_tokens": 4662
    },
    {
      "id": "T004",
      "description": "Analyze the forum discussions to gauge investor sentiment and predictions about a potential bounce-back.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the forum discussions from `forum_discussions_T002` to determine the overall investor sentiment regarding \"Privi Speciality Chemicals\". Extract opinions on whether the stock is likely to bounce back, and identify the level of concern expressed by investors.",
      "reads": [
        "forum_discussions_T002"
      ],
      "writes": [
        "investor_sentiment_T004"
      ],
      "status": "completed",
      "output": {
        "investor_sentiment_T004": {
          "overview": "Analysis of recent news and forum sentiment indicates a mixed outlook for Privi Speciality Chemicals. While the stock has experienced a decline, some analysts maintain a positive outlook, while investor sentiment appears cautious.",
          "bounce_back_potential": {
            "positive_indicators": [
              "Analysts' Strong Buy recommendations suggest potential for recovery.",
              "Technical analysis indicates potential momentum shifts.",
              "The stock has shown resilience over the past month, with a gain of 7.22%, outperforming the Sensex's decline."
            ],
            "negative_indicators": [
              "Recent price declines and consecutive losses raise concerns.",
              "Underperformance compared to the sector indicates caution.",
              "Sensex trading below its 50-day moving average reflects overall market caution."
            ],
            "stocktwits_sentiment": "Sentiment on StockTwits is unavailable due to lack of current data. Historical sentiment has been equally unavailable over the past week, month, 3 months, 6 months and year."
          },
          "level_of_concern": {
            "high_concern_factors": [
              "Significant stock decline and gap down openings indicate market concern.",
              "Consecutive losses over the past three days contribute to investor anxiety.",
              "YouTube analysis highlights surprise among investors due to the sharp decline."
            ],
            "mitigating_factors": [
              "Strong Buy recommendations from analysts.",
              "Positive long-term returns.",
              "Company performance (ROE, Revenue growth, etc.) is generally outperforming benchmarks."
            ],
            "conclusion": "Overall, there is a moderate level of concern among investors, driven by recent price declines, but this is somewhat balanced by positive analyst ratings and underlying performance data."
          },
          "recommendations": [
            "Monitor stock performance closely and stay informed of market trends.",
            "Consider analyst ratings and financial data when making investment decisions.",
            "Exercise caution and assess risk tolerance based on individual circumstances."
          ]
        },
        "cost": 0.0005787,
        "input_tokens": 4359,
        "output_tokens": 357,
        "total_tokens": 4716
      },
      "error": null,
      "cost": 0.0005787,
      "start_time": "2026-01-02T09:34:22.417949",
      "end_time": "2026-01-02T09:34:31.027640",
      "execution_time": 8.609691,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "investor_sentiment_T004": {
              "overview": "Analysis of recent news and forum sentiment indicates a mixed outlook for Privi Speciality Chemicals. While the stock has experienced a decline, some analysts maintain a positive outlook, while investor sentiment appears cautious.",
              "bounce_back_potential": {
                "positive_indicators": [
                  "Analysts' Strong Buy recommendations suggest potential for recovery.",
                  "Technical analysis indicates potential momentum shifts.",
                  "The stock has shown resilience over the past month, with a gain of 7.22%, outperforming the Sensex's decline."
                ],
                "negative_indicators": [
                  "Recent price declines and consecutive losses raise concerns.",
                  "Underperformance compared to the sector indicates caution.",
                  "Sensex trading below its 50-day moving average reflects overall market caution."
                ],
                "stocktwits_sentiment": "Sentiment on StockTwits is unavailable due to lack of current data. Historical sentiment has been equally unavailable over the past week, month, 3 months, 6 months and year."
              },
              "level_of_concern": {
                "high_concern_factors": [
                  "Significant stock decline and gap down openings indicate market concern.",
                  "Consecutive losses over the past three days contribute to investor anxiety.",
                  "YouTube analysis highlights surprise among investors due to the sharp decline."
                ],
                "mitigating_factors": [
                  "Strong Buy recommendations from analysts.",
                  "Positive long-term returns.",
                  "Company performance (ROE, Revenue growth, etc.) is generally outperforming benchmarks."
                ],
                "conclusion": "Overall, there is a moderate level of concern among investors, driven by recent price declines, but this is somewhat balanced by positive analyst ratings and underlying performance data."
              },
              "recommendations": [
                "Monitor stock performance closely and stay informed of market trends.",
                "Consider analyst ratings and financial data when making investment decisions.",
                "Exercise caution and assess risk tolerance based on individual circumstances."
              ]
            },
            "cost": 0.0005787,
            "input_tokens": 4359,
            "output_tokens": 357,
            "total_tokens": 4716
          }
        }
      ],
      "input_tokens": 4359,
      "output_tokens": 357,
      "total_tokens": 4716
    },
    {
      "id": "T005",
      "description": "Synthesize the findings from news articles and forum discussions to provide a comprehensive explanation of the stock price decline and investor sentiment.",
      "agent": "DistillerAgent",
      "agent_prompt": "Synthesize the information from `reasons_for_decline_T003` (reasons for the stock price decline from news articles) and `investor_sentiment_T004` (investor sentiment and bounce-back predictions from forum discussions) to create a comprehensive summary of the situation surrounding \"Privi Speciality Chemicals\".",
      "reads": [
        "reasons_for_decline_T003",
        "investor_sentiment_T004"
      ],
      "writes": [
        "summary_of_situation_T005"
      ],
      "status": "completed",
      "output": {
        "summary_of_situation_T005": [
          {
            "Cause of Decline": "A large block deal involving the sale of 38.8 lakh shares (9.93% of equity) created immediate selling pressure on Privi Speciality Chemicals.",
            "Discounted Price": "The block deal shares were traded at an average of Rs 2,799, a 12% discount from the previous close of Rs 3,190.50, putting downward pressure on the stock.",
            "Stake Sale": "A shareholder was likely selling up to a 6.32% stake through a block deal (around Rs 700 crore) with a floor price of Rs 2,835-2,850, an 11-14% discount.",
            "Promoter Dilution History": "Past promoter stake dilutions (4.09% in June 2025) have made investors cautious about recurring sales.",
            "Analyst Outlook": "Despite the fall, brokerage commentary is positive. Motilal Oswal Wealth Management included Privi in its top 10 picks for 2026, citing growth prospects and valuing it at Rs 3,960 (21% upside).",
            "Investor Sentiment": "Investor sentiment is mixed, with recent price declines causing concern, balanced by strong buy recommendations and long-term performance. Caution is advised.",
            "Bounce-Back Potential": "Positive indicators include strong analyst recommendations and recent resilience, but negative indicators include recent price declines and underperformance compared to the sector. Sentiment data on StockTwits is unavailable.",
            "Recommendations": "Monitor performance closely, stay informed, consider analyst ratings, and assess risk tolerance."
          }
        ],
        "cost": 0.0002453,
        "input_tokens": 1237,
        "output_tokens": 304,
        "total_tokens": 1541
      },
      "error": null,
      "cost": 0.0002453,
      "start_time": "2026-01-02T09:34:31.035007",
      "end_time": "2026-01-02T09:34:34.495256",
      "execution_time": 3.460249,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "summary_of_situation_T005": [
              {
                "Cause of Decline": "A large block deal involving the sale of 38.8 lakh shares (9.93% of equity) created immediate selling pressure on Privi Speciality Chemicals.",
                "Discounted Price": "The block deal shares were traded at an average of Rs 2,799, a 12% discount from the previous close of Rs 3,190.50, putting downward pressure on the stock.",
                "Stake Sale": "A shareholder was likely selling up to a 6.32% stake through a block deal (around Rs 700 crore) with a floor price of Rs 2,835-2,850, an 11-14% discount.",
                "Promoter Dilution History": "Past promoter stake dilutions (4.09% in June 2025) have made investors cautious about recurring sales.",
                "Analyst Outlook": "Despite the fall, brokerage commentary is positive. Motilal Oswal Wealth Management included Privi in its top 10 picks for 2026, citing growth prospects and valuing it at Rs 3,960 (21% upside).",
                "Investor Sentiment": "Investor sentiment is mixed, with recent price declines causing concern, balanced by strong buy recommendations and long-term performance. Caution is advised.",
                "Bounce-Back Potential": "Positive indicators include strong analyst recommendations and recent resilience, but negative indicators include recent price declines and underperformance compared to the sector. Sentiment data on StockTwits is unavailable.",
                "Recommendations": "Monitor performance closely, stay informed, consider analyst ratings, and assess risk tolerance."
              }
            ],
            "cost": 0.0002453,
            "input_tokens": 1237,
            "output_tokens": 304,
            "total_tokens": 1541
          }
        }
      ],
      "input_tokens": 1237,
      "output_tokens": 304,
      "total_tokens": 1541
    },
    {
      "id": "T006",
      "description": "Format the summary into a well-structured report with clear explanations, sentiment analysis, and an assessment of the level of concern.",
      "agent": "FormatterAgent",
      "agent_prompt": "Format the summary from `summary_of_situation_T005` into a well-structured report. Include the identified reasons for the stock price decline, a summary of investor sentiment regarding a potential bounce-back, and an overall assessment of the level of concern based on the available information. Use markdown to highlight key points and structure the report for easy readability.",
      "reads": [
        "summary_of_situation_T005"
      ],
      "writes": [
        "formatted_report_T006"
      ],
      "status": "completed",
      "output": {
        "final_format": "html",
        "fallback_markdown": "Report on Privi Speciality Chemicals Stock Price Decline",
        "formatted_report_T006": "<div class='report'>\n  <h1>Privi Speciality Chemicals Stock Price Decline Analysis</h1>\n\n  <h2>1. Executive Summary</h2>\n  <p>This report analyzes the recent stock price decline of Privi Speciality Chemicals on the NSE. The primary drivers include a large block deal, discounted transaction prices, and historical promoter stake dilutions. While investor sentiment is mixed, analyst outlook remains positive, suggesting potential for a bounce-back. Caution is advised; monitor performance closely.</p>\n\n  <h2>2. Reasons for Stock Price Decline</h2>\n  <h3>2.1 Large Block Deal</h3>\n  <p>A significant block deal involving the sale of 38.8 lakh shares (9.93% of the company's equity) created immediate selling pressure. <a href='https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html' target='_blank'>Source</a>, <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a>, <a href='https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642' target='_blank'>Source</a></p>\n\n  <h3>2.2 Discounted Transaction Price</h3>\n  <p>The block deal shares were traded at an average of Rs 2,799, a 12% discount from the previous close of Rs 3,190.50, putting downward pressure on the stock. <a href='https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html' target='_blank'>Source</a>, <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h3>2.3 Potential Stake Sale</h3>\n  <p>A shareholder was likely selling up to a 6.32% stake through a block deal (around Rs 700 crore) with a floor price of Rs 2,835-2,850, an 11-14% discount. <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h3>2.4 Promoter Dilution History</h3>\n  <p>Past promoter stake dilutions (4.09% in June 2025) have made investors cautious about recurring sales. <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h2>3. Analyst Outlook</h2>\n  <p>Despite the fall, brokerage commentary is positive. Motilal Oswal Wealth Management included Privi in its top 10 picks for 2026, citing growth prospects and valuing it at Rs 3,960 (21% upside). <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h2>4. Investor Sentiment</h2>\n  <p>Investor sentiment is mixed, with recent price declines causing concern, balanced by strong buy recommendations and long-term performance. Caution is advised.</p>\n\n  <h2>5. Bounce-Back Potential</h2>\n  <h3>5.1 Positive Indicators</h3>\n  <ul>\n    <li>Analysts' Strong Buy recommendations suggest potential for recovery.</li>\n    <li>Technical analysis indicates potential momentum shifts.</li>\n    <li>The stock has shown resilience over the past month, with a gain of 7.22%, outperforming the Sensex's decline.</li>\n  </ul>\n\n  <h3>5.2 Negative Indicators</h3>\n  <ul>\n    <li>Recent price declines and consecutive losses raise concerns.</li>\n    <li>Underperformance compared to the sector indicates caution.</li>\n    <li>Sensex trading below its 50-day moving average reflects overall market caution.</li>\n  </ul>\n\n  <h3>5.3 StockTwits Sentiment</h3>\n  <p>Sentiment data on StockTwits is unavailable.</p>\n\n  <h2>6. Level of Concern Assessment</h2>\n  <h3>6.1 High Concern Factors</h3>\n  <ul>\n    <li>Significant stock decline and gap down openings indicate market concern.</li>\n    <li>Consecutive losses over the past three days contribute to investor anxiety.</li>\n    <li>YouTube analysis highlights surprise among investors due to the sharp decline.</li>\n  </ul>\n\n  <h3>6.2 Mitigating Factors</h3>\n  <ul>\n    <li>Strong Buy recommendations from analysts.</li>\n    <li>Positive long-term returns.</li>\n    <li>Company performance (ROE, Revenue growth, etc.) is generally outperforming benchmarks.</li>\n  </ul>\n\n  <h3>6.3 Conclusion</h3>\n  <p>Overall, there is a moderate level of concern among investors, driven by recent price declines, but this is somewhat balanced by positive analyst ratings and underlying performance data.</p>\n\n  <h2>7. Recommendations</h2>\n  <ul>\n    <li>Monitor stock performance closely and stay informed of market trends.</li>\n    <li>Consider analyst ratings and financial data when making investment decisions.</li>\n    <li>Exercise caution and assess risk tolerance based on individual circumstances.</li>\n  </ul>\n</div>",
        "call_self": false,
        "cost": 0.0012415000000000002,
        "input_tokens": 9523,
        "output_tokens": 723,
        "total_tokens": 10246
      },
      "error": null,
      "cost": 0.0012415000000000002,
      "start_time": "2026-01-02T09:34:34.501917",
      "end_time": "2026-01-02T09:34:43.421775",
      "execution_time": 8.919858,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "final_format": "html",
            "fallback_markdown": "Report on Privi Speciality Chemicals Stock Price Decline",
            "formatted_report_T006": "<div class='report'>\n  <h1>Privi Speciality Chemicals Stock Price Decline Analysis</h1>\n\n  <h2>1. Executive Summary</h2>\n  <p>This report analyzes the recent stock price decline of Privi Speciality Chemicals on the NSE. The primary drivers include a large block deal, discounted transaction prices, and historical promoter stake dilutions. While investor sentiment is mixed, analyst outlook remains positive, suggesting potential for a bounce-back. Caution is advised; monitor performance closely.</p>\n\n  <h2>2. Reasons for Stock Price Decline</h2>\n  <h3>2.1 Large Block Deal</h3>\n  <p>A significant block deal involving the sale of 38.8 lakh shares (9.93% of the company's equity) created immediate selling pressure. <a href='https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html' target='_blank'>Source</a>, <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a>, <a href='https://scanx.trade/stock-market-news/orders-deals/privi-specialty-chemicals-promoter-group-plans-to-sell-6-32-stake-through-700-crore-block-deal/28652642' target='_blank'>Source</a></p>\n\n  <h3>2.2 Discounted Transaction Price</h3>\n  <p>The block deal shares were traded at an average of Rs 2,799, a 12% discount from the previous close of Rs 3,190.50, putting downward pressure on the stock. <a href='https://www.moneycontrol.com/news/business/markets/privi-speciality-chemicals-shares-fall-14-after-rs-1-086-crore-shares-change-hands-13750436.html' target='_blank'>Source</a>, <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h3>2.3 Potential Stake Sale</h3>\n  <p>A shareholder was likely selling up to a 6.32% stake through a block deal (around Rs 700 crore) with a floor price of Rs 2,835-2,850, an 11-14% discount. <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h3>2.4 Promoter Dilution History</h3>\n  <p>Past promoter stake dilutions (4.09% in June 2025) have made investors cautious about recurring sales. <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h2>3. Analyst Outlook</h2>\n  <p>Despite the fall, brokerage commentary is positive. Motilal Oswal Wealth Management included Privi in its top 10 picks for 2026, citing growth prospects and valuing it at Rs 3,960 (21% upside). <a href='https://www.businessupturn.com/finance/stock-market/why-privi-speciality-chemicals-shares-are-falling-over-9-today-explained/' target='_blank'>Source</a></p>\n\n  <h2>4. Investor Sentiment</h2>\n  <p>Investor sentiment is mixed, with recent price declines causing concern, balanced by strong buy recommendations and long-term performance. Caution is advised.</p>\n\n  <h2>5. Bounce-Back Potential</h2>\n  <h3>5.1 Positive Indicators</h3>\n  <ul>\n    <li>Analysts' Strong Buy recommendations suggest potential for recovery.</li>\n    <li>Technical analysis indicates potential momentum shifts.</li>\n    <li>The stock has shown resilience over the past month, with a gain of 7.22%, outperforming the Sensex's decline.</li>\n  </ul>\n\n  <h3>5.2 Negative Indicators</h3>\n  <ul>\n    <li>Recent price declines and consecutive losses raise concerns.</li>\n    <li>Underperformance compared to the sector indicates caution.</li>\n    <li>Sensex trading below its 50-day moving average reflects overall market caution.</li>\n  </ul>\n\n  <h3>5.3 StockTwits Sentiment</h3>\n  <p>Sentiment data on StockTwits is unavailable.</p>\n\n  <h2>6. Level of Concern Assessment</h2>\n  <h3>6.1 High Concern Factors</h3>\n  <ul>\n    <li>Significant stock decline and gap down openings indicate market concern.</li>\n    <li>Consecutive losses over the past three days contribute to investor anxiety.</li>\n    <li>YouTube analysis highlights surprise among investors due to the sharp decline.</li>\n  </ul>\n\n  <h3>6.2 Mitigating Factors</h3>\n  <ul>\n    <li>Strong Buy recommendations from analysts.</li>\n    <li>Positive long-term returns.</li>\n    <li>Company performance (ROE, Revenue growth, etc.) is generally outperforming benchmarks.</li>\n  </ul>\n\n  <h3>6.3 Conclusion</h3>\n  <p>Overall, there is a moderate level of concern among investors, driven by recent price declines, but this is somewhat balanced by positive analyst ratings and underlying performance data.</p>\n\n  <h2>7. Recommendations</h2>\n  <ul>\n    <li>Monitor stock performance closely and stay informed of market trends.</li>\n    <li>Consider analyst ratings and financial data when making investment decisions.</li>\n    <li>Exercise caution and assess risk tolerance based on individual circumstances.</li>\n  </ul>\n</div>",
            "call_self": false,
            "cost": 0.0012415000000000002,
            "input_tokens": 9523,
            "output_tokens": 723,
            "total_tokens": 10246
          }
        }
      ],
      "input_tokens": 9523,
      "output_tokens": 723,
      "total_tokens": 10246
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "Query"
    },
    {
      "source": "Query",
      "target": "T001"
    },
    {
      "source": "Query",
      "target": "T002"
    },
    {
      "source": "T001",
      "target": "T003"
    },
    {
      "source": "T002",
      "target": "T004"
    },
    {
      "source": "T003",
      "target": "T005"
    },
    {
      "source": "T004",
      "target": "T005"
    },
    {
      "source": "T005",
      "target": "T006"
    }
  ]
}