{
  "raw_aqi_data_T001": "{\n  \"content\": [\n    {\n      \"type\": \"text\",\n      \"text\": \"[{'url': 'https://www.aqi.in/in/dashboard/india/west-bengal/kolkata/historical-analysis', 'content': '[error] ', 'rank': 1}, {'url': 'https://airquality.cpcb.gov.in/AQI_India/', 'content': 'National Air Quality Index Toggle navigation National Air Quality Index Central Pollution Control\\\\r        Board, Ministry of Environment, Forests and Climate Change Color Codes City Rankings Compare Cities Credits State City Station Click here for\\\\r         AQI Data Repository AQI Remark Color Code Possible Health Impacts List of AQI Stations with Data of above selected Date & Time Compare Cities City City City City NOTE: ... (1974-2024)- -   || Celebrating Golden Jubilee Year of CPCB (1974-2024)- 5 decades in pursuit of clean environment. Supervised by Prof. Arnab Bhattacharya & Prof. Mukesh Sharma IIT Kanpur Developed by Sagar Parihar & Swapnil Mahajan Insufficient data for computing AQI Prominent Pollutant is On Pollutant Timeline Avg Min Max No Data Available Network Error No response from server. Name Graph Avg Min Max Rank City State Remark AQI Element Timeline Avg Min Max Captcha Verification Yes Verify', 'images': [], 'rank': 2}, {'url': 'https://ews.tropmet.res.in/kolkata/index.php', 'content': 'Kolkata - Air Quality Early Warning System, Project by Indian Institute of Tropical Meteorology, Pune - 441008, INDIA AIR QUALITY EARLY WARNING AND DECISION SUPPORT SYSTEM FOR KOLKATA Indian Institute of Tropical Meteorology Ministry Of Earth Sciences, Govt. Of India Menu Pune Mumbai Ahmedabad Kolkata Bengaluru Hyderabad Delhi AQEWS Previous Next Current AQI For Various Stations Ballygunge 2025-12-23 10:00:00 - 181 Bidhannagar 2025-12-23 10:00:00 - 243 Fort William 2025-12-23 10:00:00 - 144 Jadavpur 2025-12-23 10:00:00 - 264 Rabindra Bharati University 2025-12-23 10:00:00 - 173 Rabindra Sarobar 2025-12-23 10:00:00 - 125 Victoria 2025-12-23 10:00:00 - 313 Kolkata Weather 17.2 C 84 % 1.9 km/h Observed : 2025-12-23 08:30 IST Current AQI at Kolkata Forecast AQI PM 2.5 PM 10 Hourly Forecast Verification PM 2.5 Select All Observation Forecast Start : End : Reset Hourly Forecast Verification PM 10 Select All Observation Forecast Start : End : Reset Copyright All rights reserved | Designed and Developed by Team IITM', 'images': [], 'rank': 3}, {'url': 'https://breathe.climate.uchicago.edu/kolkata-india/', 'content': 'Kolkata, India - Pollution Monitors Skip to content English About Team Pollution Monitoring Chiang Mai, Thailand Guatemala City, Guatemala Kanpur, India Kigali, Rwanda Kolkata, India Kolkata, India Daily Pollution Levels on PM2.5 Concentration Meets National Standard (60 g/m) Meets WHO Guideline (15 g/m) Download Data Annual Average Pollution Levels in Kolkata Source: Air Quality Life Index Download Data Kolkata Weekly Cigarettes Note: These are estimations based on Berkeley Earths Air Pollution and Cigarette Equivalence, https://berkeleyearth.wpengine.com/air-pollution-and-cigarette-equivalence/ Download Data Top 10 Threats to Life Expectancy in India Threat to Life Expectancy Life Years Lost 0-0.1 0.1-0.5 0.5-1.0 1.0-2.0 2.0-3.0 3.0-4.0 Source: Global Burden of Disease (https://vizhub.healthdata.org/gbd-results/) , level-2 causes and risks data and WHO Life Tables (https://apps.who.int/gho/data/node.main.LIFECOUNTRY?lang=en) , were combined with the Life table method to arrive at these results. PM2.5 relative to WHO Guideline bar displays the reduction in life expectancy relative to the WHO guideline as calculated by latest AQLI (2023 PM2.5 concentrations) data. Download Data Share x-twitter Share this page on X (opens new window) facebook Share this page on Facebook (opens new window) email Email this page (opens new window) In the News In the News Aug 25, 2025 Kolkata beats other metros, reports more than 50% of good air days in 4 years: CSE study via Times of India Kolkata has emerged as the metro with the best air quality among six major Indian cities. Learn More caret-right In the News Aug 25, 2025 How India moves: Surge in lung ailments in Kolkata as vehicle emissions choke city via Down to Earth Annual four-wheeler registration rose five times since 2016; public transport at the brink of breaking down. Learn More caret-right In the News Aug 25, 2025 PM 2.5 in 2024-25 winter Kolkatas best since 2019 via Times of India This winter brought a breath of relatively cleaner air to Kolkata, with the city recording its best particulate pollution levels since 2019. Learn More caret-right In the News Aug 26, 2025 Kolkata study finds air toxicity surges when PM2.5 breaches 70 g/m, threshold exceeds on 75% of winter days NCAP fails to curb PM2.5 from waste burning a major air pollutant in the West Bengal megacity despite spending over Rs 636 crore. Learn More caret-right In the News Aug 27, 2025 Kolkata has second worst air among Indias metros. What it needs to do to breathe better via Telegraph India Bengal capitals air quality improved marginally last year, but the city is still second most polluted among Indian metros despite fewer industries, vehicles. Experts explain the reasons, and what needs to be done. Learn More caret-right In the News Aug 27, 2025 How Kolkata improved its air quality within 6 years via The Indian Express In 2019, Kolkata was listed among the Top 10 most polluted cities by the National Clean Air Programme. Learn More caret-right About Team Pollution Monitoring About Team Pollution Monitoring Chiang Mai, Thailand Guatemala City, Guatemala Kanpur, India Kigali, Rwanda Kolkata, India English Search Search arrow-left arrow-right caret-down-wide caret-down caret-left caret-right checkmark close document dropdown-topics email external facebook filter Instagram linkedin mag-glass-large mag-glass-small multimedia pause play x-twitter youtube', 'images': [], 'rank': 4}, {'url': 'https://www.iqair.com/af/india/west-bengal/kolkata', 'content': 'Kolkata Air Quality Index (AQI) and India Air Pollution | IQAir Cart 0 Choose another country or region to see content specific to your location and shop online. Other country or region Continue Dismiss Close IQAir Logo Air Quality Caret Air Monitors Caret Air Purifiers Caret Filters Caret Face Masks For Business Caret News Caret Impact Caret Recent searches No recent searches Account Sign in Click to open cart Open menu Menu World Kolkata Add Click the \\\"Add\\\" button (+) to follow this location in your \\\"Places\\\" list for quick access. This feature requires you to sign in. World / India / West Bengal / Kolkata Recent searches No recent searches Add Click the \\\"Add\\\" button (+) to follow this location in your \\\"Places\\\" list for quick access. This feature requires you to sign in. World Kolkata Add Click the \\\"Add\\\" button (+) to follow this location in your \\\"Places\\\" list for quick access. This feature requires you to sign in. World / India / West Bengal / Kolkata Air quality in Kolkata Air quality index (AQI) and PM2.5 air pollution in Kolkata 1.5M Followers 10:30, Dec 23 Local time Data attribution 20 stations from 2 contributors Kolkata, West Bengal, India Air Quality Alert nearby View alert 219 US AQI Very unhealthy Main pollutant: PM2.5 144 g/m 21 13 km/h 60 % Data attribution 20 stations from 2 contributors Hourly forecast Kolkata air quality index (AQI) forecast Now 219 21 13 km/h 60% 12:30 209 22 7.2 km/h 54% 13:30 205 23 7.2 km/h 47% 14:30 197 25 7.2 km/h 40% 15:30 192 26 7.2 km/h 33% 16:30 187 25 7.2 km/h 25% 17:30 186 23 7.2 km/h 26% 18:30 181 22 7.2 km/h 26% 19:30 176 21 7.2 km/h 27% 20:30 187 21 7.2 km/h 28% 21:30 183 20 7.2 km/h 29% 22:30 180 19 3.6 km/h 30% 23:30 192 19 3.6 km/h 31% Wed 00:30 192 18 3.6 km/h 31% 01:30 192 18 7.2 km/h 32% 02:30 195 17 7.2 km/h 32% 03:30 195 16 7.2 km/h 33% 04:30 195 16 7.2 km/h 35% 05:30 195 15 7.2 km/h 39% 06:30 195 15 7.2 km/h 41% 07:30 195 17 7.2 km/h 39% 08:30 194 20 7.2 km/h 35% 09:30 194 22 7.2 km/h 31% 10:30 194 24 7.2 km/h 27% 11:30 180 25 7.2 km/h 24% 12:30 180 26 7.2 km/h 22% 13:30 180 27 10.8 km/h 21% 14:30 169 27 10.8 km/h 21% 15:30 169 27 10.8 km/h 21% 16:30 169 25 7.2 km/h 25% 17:30 176 23 7.2 km/h 27% 18:30 176 22 7.2 km/h 29% 19:30 176 22 7.2 km/h 30% 20:30 192 21 7.2 km/h 32% 21:30 192 20 3.6 km/h 34% 22:30 192 20 3.6 km/h 35% 23:30 204 19 7.2 km/h 36% Thu 00:30 204 18 7.2 km/h 38% 01:30 204 17 10.8 km/h 39% 02:30 202 17 10.8 km/h 41% 03:30 202 17 10.8 km/h 44% 04:30 202 16 7.2 km/h 46% 05:30 196 16 7.2 km/h 47% 06:30 196 16 7.2 km/h 48% 07:30 196 18 7.2 km/h 44% 08:30 195 20 7.2 km/h 37% 09:30 195 23 7.2 km/h 32% 10:30 195 24 10.8 km/h 29% 11:30 175 26 10.8 km/h 25% 12:30 175 27 14.4 km/h 23% 13:30 175 27 10.8 km/h 22% 14:30 160 27 10.8 km/h 21% 15:30 160 27 10.8 km/h 21% 16:30 160 25 10.8 km/h 24% 17:30 163 23 10.8 km/h 26% 18:30 163 22 7.2 km/h 28% 19:30 163 21 7.2 km/h 29% 20:30 174 20 3.6 km/h 30% 21:30 174 20 7.2 km/h 31% 22:30 174 19 7.2 km/h 32% 23:30 179 18 7.2 km/h 33% Fri 00:30 179 18 7.2 km/h 35% 01:30 179 17 7.2 km/h 39% 02:30 179 17 7.2 km/h 42% 03:30 179 16 7.2 km/h 45% 04:30 179 16 7.2 km/h 47% 05:30 178 16 7.2 km/h 47% 06:30 178 15 7.2 km/h 47% 07:30 178 17 3.6 km/h 42% 08:30 172 20 7.2 km/h 36% 09:30 172 22 7.2 km/h 32% 10:30 172 24 10.8 km/h 28% 11:30 163 25 10.8 km/h 24% Daily forecast 3d | 7d Kolkata air quality index (AQI) forecast Today 185 26 16 7.2 km/h 55% Wed 189 27 15 10.8 km/h 27% Thu 178 27 16 14.4 km/h 29% Air pollutants What is the current air quality in Kolkata? PM2.5 Fine particles ( 2.5 m) 144 g/m PM10 Coarse particles ( 10 m) 35.5 g/m SO Sulphur Dioxide 91.2 g/m PM2.5 concentration is currently 28.8 times the World Health Organization annual PM2.5 guideline value. Real-time Kolkata air pollution map Health recommendations Avoid outdoor exercise Close your windows to avoid dirty outdoor air Get a monitor Wear a mask outdoors Get a mask Run an air purifier Get an air purifier Clean air facilities. Superior indoor air quality. Clean Air', 'images': [], 'rank': 5}]\",\n      \"annotations\": null\n    }\n  ]\n}"
}