{
  "bse_performance_T001": {
    "content": [
      {
        "type": "text",
        "text": "[{\"url\": \"https://www.investing.com/indices/sensex-historical-data\", \"content\": \"BSE Sensex Historical Data (BSESN) - Investing.com Investing.com - Financial Markets Worldwide Open in App Popular Searches Please try another search Find your edge in 2026 with 55% off InvestingPro Sign In Free Sign Up English (UK) English (India) English (Canada) English (Australia) English (South Africa) English (Philippines) English (Nigeria) Deutsch Espaol (Espaa) Espaol (Mxico) Franais Italiano Nederlands Polski Portugus (Portugal) Portugus (Brasil) Trke  Svenska Suomi   Bahasa Indonesia Bahasa Melayu Ting Vit  Find your edge in 2026 with 55% off InvestingPro Sign In Free Sign Up Markets Indices Indices Futures Major Indices Indices Real-Time World Indices Global Indices Dow Jones Futures S&P 500 Futures Nasdaq Futures S&P 500 Dow Jones Nasdaq 100 DAX FTSE 100 Euro Stoxx 50 Nikkei 225 Stocks Stock Screener Trending Stocks Stocks Picked by AI United States Pre-Market After Hours Earnings Calendar Americas Europe 52 Week High 52 Week Low Most Active Top Gainers Top Losers Undervalued Stocks Overvalued Stocks World ADRs Marijuana Stocks Top Bank Stocks Renewable Energy Stocks Apple Tesla Meta Platforms Amazon.com Microsoft NVIDIA Netflix Pfizer AMD Boeing GameStop Corp AMC Entertainment Nio A ADR Super Micro Computer Commodities Real Time Commodities Metals Energy Grains Softs Meats Commodity Indices Gold Crude Oil WTI Brent Oil Silver Natural Gas Copper US Wheat Cryptocurrency All Cryptocurrencies Cryptocurrency Pairs Bitcoin Ethereum Cardano Solana Dogecoin SHIBA INU Polkadot OFFICIAL TRUMP XRP Currency Converter BTC/USD ETH/USD BCH/USD LTC/USD DOGE/USD ETC/USD ETH/BTC XRP/USD pDOTn/USD Bitcoin Futures CME Currencies Currency Rates Single Currency Crosses Live Currency Cross Rates Exchange Rates Table Forward Rates Currency Futures Currency Options EUR/USD GBP/USD EUR/CHF AUD/USD USD/JPY USD/CAD USD/CHF USD/TRY USD/MXN BTC/USD USD/RUB Dollar Index ETFs World ETFs Major ETFs USA ETFs Marijuana ETFs Bitcoin ETFs SPDR S&P 500 iShares MSCI Emerging Markets SPDR Dow Jones Industrial Average Invesco QQQ Trust Funds World Funds Major Funds Vanguard 500 Index Admiral Vanguard Total Bond Market II Index Fund Investor American Funds Capital Income Builder A PIMCO Commodity Real Return Strategy Institutional Bonds US Treasury Yield Curve World Government Bonds Financial Futures Government Bond Spreads Bond Indices Forward Rates World Credit Default Swap Rates (CDS) U.S. 10Y U.S. 30Y U.S. 2Y U.S. 5Y U.S. 3M US 10Y T-Note US 30Y T-Bond Euro Bund Certificates Major Certificates World Certificates SG FTSE MIB Gross TR 5x Daily Short Strategy RT 18 Vontobel 7X Long Fixed Lever on Natural Gas 8.06 BNP Call 500.59 EUR AEX 31Dec99 COMMERZBANK AG Put CAC FUT 05/17 31Dec99 My Watchlist Investing Challenges News Financial News Stock Markets Earnings Analyst Ratings Transcripts Cryptocurrency Commodities Currencies Economy Economic Indicators Breaking News Pro News More In News Latest Most Popular Sports & General World Politics Press Releases Company News Insider Trading Investment Ideas SEC Filings SWOT Analysis Analysis Analysis Market Overview Currencies Stock Markets Commodities Bonds Cryptocurrency ETFs More In Opinion Most Popular Editor's Picks Comics Charts Real Time Charts Live Charts Currency Chart Futures Chart Stocks Chart Indices Chart Cryptocurrency Chart Interactive Currency Chart Interactive Futures Chart Interactive Indices Chart Interactive Stocks Chart Multiple Currency Charts Multiple Indices Charts Technical Tools Technical Summary Technical Analysis Pivot Points Moving Averages Indicators Candlestick Patterns More In Technical Candlestick Patterns Fibonacci Calculator Pivot Point Calculator Brokers Brokers Currency Brokers Stock Brokers Online Brokers Crypto Exchanges More In Brokers Cryptocurrency Brokers Gold IRA Futures Brokers Tools Calendars Economic Calendar Holiday Calendar Earnings Calendar Dividend Calendar Splits Calendar IPO Calendar Futures Expiry Calendar Investment Tools Stock Screener Fed Rate Monit\", \"images\": [], \"rank\": 1}, {\"url\": \"https://finance.yahoo.com/quote/%5EBSESN/history/\", \"content\": \"BSE - Free Realtime Quote INR S&P BSE SENSEX (^BSESN) As of 11:26:31 AM GMT+5:30. Market Open. Currency in INR | Date | Open | High | Low | Close Close price adjusted for splits. | Adj Close Adjusted close price adjusted for splits and dividend and/or capital gain distributions. | Volume | |---|---|---|---|---|---|---| | Dec 29, 2025 | 85,004.75 | 85,250.00 | 84,754.88 | 84,773.41 | 84,773.41 | - | | Dec 26, 2025 | 85,225.28 | 85,378.51 | 84,937.82 | 85,041.45 | 85,041.45 | 4,800 | | Dec 24, 2025 | 85,533.11 | 85,738.18 | 85,342.19 | 85,408.70 | 85,408.70 | 8,400 | | Dec 23, 2025 | 85,690.10 | 85,704.93 | 85,342.99 | 85,524.84 | 85,524.84 | 6,100 | | Dec 22, 2025 | 85,145.90 | 85,601.33 | 85,145.86 | 85,567.48 | 85,567.48 | 6,100 | | Dec 19, 2025 | 84,756.79 | 85,067.50 | 84,734.96 | 84,929.36 | 84,929.36 | 8,100 | | Dec 18, 2025 | 84,518.33 | 84,780.19 | 84,238.43 | 84,481.81 | 84,481.81 | 15,000 | | Dec 17, 2025 | 84,856.26 | 84,889.45 | 84,415.98 | 84,559.65 | 84,559.65 | 11,200 | | Dec 16, 2025 | 85,025.61 | 85,059.96 | 84,620.61 | 84,679.86 | 84,679.86 | 9,600 | | Dec 15, 2025 | 84,891.75 | 85,278.63 | 84,840.32 | 85,213.36 | 85,213.36 | 10,600 | | Dec 12, 2025 | 85,051.03 | 85,320.82 | 84,956.74 | 85,267.66 | 85,267.66 | 8,200 | | Dec 11, 2025 | 84,456.75 | 84,906.93 | 84,150.19 | 84,818.13 | 84,818.13 | 15,800 | | Dec 10, 2025 | 84,607.49 | 85,020.34 | 84,313.62 | 84,391.27 | 84,391.27 | 8,800 | | Dec 9, 2025 | 84,742.87 | 84,947.89 | 84,382.96 | 84,666.28 | 84,666.28 | 8,500 | | Dec 8, 2025 | 85,624.84 | 85,722.97 | 84,875.59 | 85,102.69 | 85,102.69 | 10,700 | | Dec 5, 2025 | 85,125.48 | 85,796.72 | 85,078.12 | 85,712.37 | 85,712.37 | 7,900 | | Dec 4, 2025 | 84,987.56 | 85,487.21 | 84,949.98 | 85,265.32 | 85,265.32 | 17,900 | | Dec 3, 2025 | 85,150.64 | 85,269.68 | 84,763.64 | 85,106.81 | 85,106.81 | 17,400 | | Dec 2, 2025 | 85,325.51 | 85,553.51 | 85,053.00 | 85,138.27 | 85,138.27 | 5,800 | | Dec 1, 2025 | 86,065.92 | 86,159.02 | 85,489.65 | 85,641.90 | 85,641.90 | 8,500 | | Nov 28, 2025 | 85,791.55 | 85,969.89 | 85,577.82 | 85,706.67 | 85,706.67 | 6,400 | | Nov 27, 2025 | 85,745.05 | 86,055.86 | 85,473.85 | 85,720.38 | 85,720.38 | 15,800 | | Nov 26, 2025 | 84,503.44 | 85,644.19 | 84,478.13 | 85,609.51 | 85,609.51 | 13,800 | | Nov 25, 2025 | 85,008.93 | 85,110.24 | 84,536.73 | 84,587.01 | 84,587.01 | 6,200 | | Nov 24, 2025 | 85,320.04 | 85,473.47 | 84,710.11 | 84,900.71 | 84,900.71 | 9,600 | | Nov 21, 2025 | 85,347.40 | 85,609.40 | 85,187.84 | 85,231.92 | 85,231.92 | 14,200 | | Nov 20, 2025 | 85,470.92 | 85,801.70 | 85,201.22 | 85,632.68 | 85,632.68 | 24,300 | | Nov 19, 2025 | 84,643.78 | 85,236.77 | 84,525.98 | 85,186.47 | 85,186.47 | 8,900 | | Nov 18, 2025 | 85,042.37 | 85,042.41 | 84,558.36 | 84,673.02 | 84,673.02 | 10,700 | | Nov 17, 2025 | 84,700.50 | 84,988.09 | 84,581.08 | 84,950.95 | 84,950.95 | 10,500 | | Nov 14, 2025 | 84,060.14 | 84,697.87 | 84,029.32 | 84,562.78 | 84,562.78 | 8,800 | | Nov 13, 2025 | 84,525.89 | 84,919.43 | 84,253.05 | 84,478.67 | 84,478.67 | 25,600 | | Nov 12, 2025 | 84,238.86 | 84,652.01 | 84,166.75 | 84,466.51 | 84,466.51 | 9,100 | | Nov 11, 2025 | 83,671.52 | 83,936.47 | 83,124.03 | 83,871.32 | 83,871.32 | 16,500 | | Nov 10, 2025 | 83,198.20 | 83,754.49 | 83,197.67 | 83,535.35 | 83,535.35 | 11,900 | | Nov 7, 2025 | 83,150.15 | 83,390.11 | 82,670.95 | 83,216.28 | 83,216.28 | 15,900 | | Nov 6, 2025 | 83,516.69 | 83,846.35 | 83,237.65 | 83,311.01 | 83,311.01 | 17,900 | | Nov 4, 2025 | 84,000.64 | 84,068.01 | 83,412.77 | 83,459.15 | 83,459.15 | 9,500 | | Nov 3, 2025 | 83,835.10 | 84,127.00 | 83,609.54 | 83,978.49 | 83,978.49 | 1,300 | | Oct 31, 2025 | 84,379.79 | 84,712.79 | 83,905.66 | 83,938.71 | 83,938.71 | 13,300 | | Oct 30, 2025 | 84,750.90 | 84,906.95 | 84,312.65 | 84,404.46 | 84,404.46 | 14,200 | | Oct 29, 2025 | 84,663.68 | 85,105.83 | 84,638.68 | 84,997.13 | 84,997.13 | 13,600 | | Oct 28, 2025 | 84,625.71 | 84,986.94 | 84,219.39 | 84,628.16 | 84,628.16 | 12,900 | | Oct 27, 2025 |\", \"images\": [], \"rank\": 2}, {\"url\": \"https://www.bseindia.com/Indices/IndexArchiveData.html\", \"content\": \"Historical - Indices Historical Data Daily Indices Snapshot {{filedwnld.DTTM | date:'dd/MM/yyyy'}} Index Select Index All Indices {{indx.shortalias}} Period Daily Monthly Yearly From To From MMM Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec {{yr}} From {{yr}} Indices : {{lblIndex}} Period : {{lblPeriod}} Date Month Year Index Name Open High Low Close Points Change Change(%) Volume(Cr.) Turnover (Rs.Cr.) P/E P/B Div Yield {{checknull(iarch.date)?'--':(iarch.date|date:'dd/MM/yyyy')}} {{checknull(iarch.I_name)?'--' : (iarch.I_name)}} {{checknull(iarch.I_open)?'--':(iarch.I_open |number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} {{checknull(iarch.Chg)?'--' : (iarch.Chg|number:2)}} {{checknull(iarch.ChgPer)?'--' : (iarch.ChgPer|number:2)}} {{checknull(iarch.Volume)?'--' : (iarch.Volume|number:2)}} {{checknull(iarch.Turnover)?'--' : (iarch.Turnover|number:2)}} {{checknull(iarch.I_pe)?'--' : (iarch.I_pe|number:2)}} {{checknull(iarch.I_pb)?'--' : (iarch.I_pb|number:2)}} {{checknull(iarch.I_yl)?'--' : (iarch.I_yl|number:2)}} {{iarch.Day}}/{{iarch.Month|indxfrmMMM}}/{{iarch.year}} {{checknull(iarch.I_open)?'--':(iarch.I_open |number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} {{iarch.Month|monthfmtMMM}} {{iarch.year|yearfmtyy}} {{checknull(iarch.I_open)?'--' :(iarch.I_open|number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} {{iarch.year}} {{checknull(iarch.I_open)?'--':(iarch.I_open |number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} Note: Kindly download the csv file to view all records. Effective (open of) April 16th 2015, Asia Index Private Limited (AIPL) has cancelled BSE MID CAP, BSE SMALL CAP, BSE HEALTHCARE, BSE IT and BSE FMCG indices and replaced them with BSE MidCap, BSE SmallCap, BSE Healthcare, BSE Information Technology and BSE Fast Moving Consumer Goods, respectively. For more information please click here The closing value as of April 15th 2015 for respective legacy indices is used as base index value for the new indices. For more information you may write to us at bseindex@bseindia.com\", \"images\": [], \"rank\": 3}, {\"url\": \"https://tradingeconomics.com/india/stock-market\", \"content\": \"BSE SENSEX Stock Market Index - Quote - Chart - Historical Data - News | Trading Economics Calendar News Markets Commodities Indexes Shares Currencies Crypto Bonds Earnings Indicators Countries Forecasts Commodities Indexes Currencies Crypto Bonds Countries Indicators Members DATA PLANS Download historical data for 20 million indicators using your browser. Subscription Plans | Features API GATEWAY Direct access to our data from your apps using any programing language. Features | Docs | Developer Widgets Ready-to-use widgets to display real-time and historical market or economic data directly on your site. Learn More | Docs Already a user? Login Calendar News Markets Commodities Indexes Shares Currencies Crypto Bonds Earnings Holidays Countries United States United Kingdom Euro Area Australia Canada Japan China Brazil Russia India More Countries Indicators Interest Rate Inflation Rate Unemployment Rate GDP Growth GDP per Capita Current Account Gold Reserves Government Debt Crude Oil Production Gasoline Prices Credit Rating More Indicators Forecasts Markets & Indicators Countries Countries Indicators Commodities Indexes Currencies Crypto Bonds Solutions Data Subscriptions API Access Widgets Pricing Apps App Store Google Play Twitter About Customers Investors Careers About us Contact BSE SENSEX Stock Market Index Quote - Chart - Historical Data - News Summary Stats Forecast Alerts The BSE Sensex was almost flat, trading around 85,011 in Monday morning trade, after falling in the previous three sessions, amid thin trading and persistent foreign outflows, which continued to curb risk appetite. Foreign portfolio investors remained net sellers, with outflows amounting to $35.43 million on Friday, according to provisional data, bringing the total to $1.64 billion in December so far. Gains in metals and manufacturing helped offset declines in financial services and banking. The benchmarks have traded in a narrow range in recent sessions amid a lack of strong catalysts. Traders await the release of Indian industrial and manufacturing production data due later today, while an upbeat session on Wall Street on Friday helped support sentiment. Tata Steel rose 2.4%, JSW Steel climbed 1.0%, while Adani Ports and Power Grid fell 1.2% and 0.9%, respectively. Meanwhile, Coforge advanced 0.9% after the company said on Friday it would acquire artificial intelligence firm Encora. India's main stock market index, the SENSEX, fell to 84807 points on December 29, 2025, losing 0.28% from the previous session. Over the past month, the index has declined 0.97%, though it remains 8.38% higher than a year ago, according to trading on a contract for difference (CFD) that tracks this benchmark index from India. Historically, the BSE SENSEX Stock Market Index reached an all time high of 86159.02 in December of 2025. BSE SENSEX Stock Market Index - data, forecasts, historical chart - was last updated on December 29 of 2025. India's main stock market index, the SENSEX, fell to 84807 points on December 29, 2025, losing 0.28% from the previous session. Over the past month, the index has declined 0.97%, though it remains 8.38% higher than a year ago, according to trading on a contract for difference (CFD) that tracks this benchmark index from India. The BSE SENSEX Stock Market Index is expected to trade at 84968.13 points by the end of this quarter, according to Trading Economics global macro models and analysts expectations. Looking forward, we estimate it to trade at 78629.33 in 12 months time. Indexes Price Day Month Year Date NIFTY 50 25,974.45 -67.85 -0.26% -0.77% 9.85% Dec/29 SENSEX 84,765.58 -275.87 -0.32% -1.02% 8.33% Dec/29 Components Price Day Year MCap Date Bharti Airtel 2,098.50 -6.90 -0.33% 32.24% 129.74B Dec/29 Tata Consultancy 3,253.30 -26.70 -0.81% -21.77% 123.53B Dec/29 Reliance Industries 1,546.40 -12.80 -0.82% 27.73% 113.05B Dec/29 ICICI Bank 1,345.10 -5.30 -0.39% 3.90% 111.35B Dec/29 HDFC Bank 989.10 -3.00 -0.30% 11.27% 87.7B Dec/29 Infosys 1\", \"images\": [], \"rank\": 4}, {\"url\": \"https://www.5paisa.com/sensex-historical-data\", \"content\": \"Sensex Historical Data: Get BSE Sensex Index Historical Data | 5paisa Invest Investment Products Stocks MTFs, advanced charts, advisory & moreright at your fingertips. Mutual Funds Invest in top performing direct mutal funds at 0% commission IPOs Apply for IPOs within few clicks! ETF Enjoy easy diversification with flexible investment US Stocks Diversify into US Stocks & ETFs seamlessly! Tools Brokerage Calculator SIP Calculator Stock Comparison Stock Screener ELSS Calculator Compare Mutual Funds All Calculators Trade Trading Products Future & Options Trade F&O contracts across segments along with far expiry contracts Commodity Diversify your portfolios beyond traditional securities Tools Margin Calculator MTF Calculator Expand your trading horizons with global currency trading! Stock Screener All Calculators Products 5paisa Products 5paisa Trading App A go-to mobile app for savvy traders and investors! Trader's Terminal A desktop trading platform for a seamless big-screen trading experience. 5paisa EXE Go-to desktop-based platform for the fast and agile trader FnO360 A trading terminal designed exclusively for derivatives traders. Xstream APIs Unleash the Future of Trading with our Free, Fast and Simple API Platform Publisher Js Seamlessly add the 5paisa trade button to your website with minimal codingabsolutely FREE! Scalper Terminal New Lightning-fast scalping interface with instant keyboard execution. Pay Later MTF Seize market opportunities instantly, pay later 5paisa MCP Your AI trading companion all through natural conversations Trade on Charts Trade directly from TradingView charts with Tv.5paisa. Pricing Markets Market Movers Stocks Popular Stocks Indices IPO Mutual Funds Market Today 52 Week High 52 Week Low FII DII Top Gainers Top Losers Volume Shockers Value Shockers Only Buyers Only Sellers F&O Ban List Active Contracts Stocks to Buy Today Penny Stocks Stocks Under 10 Stocks Under 50 Stocks Under 100 View All Stocks BTST Stocks Multibagger Stocks Bonus Rights Splits Dividends Large Cap Stocks Mid Cap Stocks Small Cap Stocks Group Stocks Nifty 50 Stock List Indian ADRs LIC Tata Motors IRFC ITC Tata Steel Adani Enterprises Yes Bank Suzlon TCS SBI Infosys Adani Power Reliance Tata Power Idea Jio Financial Services Zomato Adani Wilmar NSE Nifty 50 Bank Nifty FINNIFTY Nifty Midcap India VIX Know More BSE Sensex BSE Bankex BSE Smallcap BSE Midcap BSE 100 Know More Global Indices Gift Nifty Dow Hang Seng S&P Nikkei 225 Know More IPO Upcoming IPO Current IPO Closed IPO Recently Listed IPO IPO Allotment Status IPO Calendar Categories Large Cap Funds Mid Cap Funds Small Cap Funds ELSS Equity Debt AMCs SBI Mutual Funds HDFC Mutual Funds Axis Mutual Funds ICICI Pru Mutual Fund Nippon India Mutual Funds All AMC's Schemes Parag Parikh Flexi Cap SBI Small Cap Fund SBI Contra Fund Nippon Small Cap Fund ICICI Pru Technology Fund All Schemes Learn Learn with us FinSchool One-stop destination for FREE courses to master investing and trading! Market Guide Ultimate guide to the stock market, covering investments, demat accounts, IPOs & more. Stock Market News Track the latest trends in the Indian stock market with 5paisa. Blogs Making the stock market simplelearn, invest, and grow! Videos Demystify the stock market with our easy-to-understand investment videos. TradeBetter A Community for traders and investors. Talk Trades. Learn Features. Swap Ideas. Stocks in News Stay updated with all the news related to stocks! Partner Partner with us Authorised Person Refer and Earn 5paisa Partner Program 5paisa Partner Dashboard Open Account Invest Investment Products Stocks MTFs, advanced charts, advisory & moreright at your fingertips. Mutual Funds Invest in top performing direct mutal funds at 0% commission IPOs Apply for IPOs within few clicks! ETF Enjoy easy diversification with flexible investment US Stocks Diversify into US Stocks & ETFs seamlessly! Tools Brokerage Calculator SIP Calculator Stock Comparison Stock Screener ELSS Calculator\", \"images\": [], \"rank\": 5}]",
        "annotations": null
      }
    ]
  },
  "current_stock_market_data_T002": {
    "content": [
      {
        "type": "text",
        "text": "[{\"url\": \"https://fred.stlouisfed.org/series/SP500\", \"content\": \"S&P 500 (SP500) | FRED | St. Louis Fed Skip to main content Federal Reserve Economic Data Explore Our Apps FRED Tools and resources to find and use economic data worldwide FRASER U.S. financial, economic, and banking history ALFRED Vintages of economic data from specific dates in history CASSIDI View banking market concentrations and perform HHI analysis Release Calendar Tools FRED Add-in for Excel FRED API FRED Mobile Apps News Blog About What is FRED Tutorials Digital Badges Contact Us My Account Explore Our Apps Explore Our Apps FRED Tools and resources to find and use economic data worldwide FRASER U.S. financial, economic, and banking history ALFRED Vintages of economic data from specific dates in history CASSIDI View banking market concentrations and perform HHI analysis STL Fed Home Page Release Calendar Tools FRED Add-in for Excel FRED API FRED Mobile Apps News Blog About What is FRED Tutorials Digital Badges Contact Us Home > Categories > Money, Banking, & Finance > Financial Indicators > Stock Market Indexes S&P 500 (SP500) Observations 2025-12-26: 6,929.94 |   Index, Not Seasonally Adjusted | Daily, Close Updated: Dec 26, 2025 7:01 PM CST Next Release Date: Dec 29, 2025 Observations 2025-12-26: 6,929.94 Updated: Dec 26, 2025 7:01 PM CST Next Release Date: Dec 29, 2025 2025-12-26: 6,929.94 2025-12-25: . 2025-12-24: 6,932.05 2025-12-23: 6,909.79 2025-12-22: 6,878.49 View All Units: Index , Not Seasonally Adjusted Frequency: Daily, Close Fullscreen Data in this graph are copyrighted. Please review the copyright information in the series notes before sharing. Share Graph Custom Graph Link Embed in Website Graph Image Link Account Tools Add to Data List Get Email Notification Notes Source: S&P Dow Jones Indices LLC Release: Standard & Poors Units: Index ,Not Seasonally Adjusted Frequency: Daily, Close Notes: The observations for the S&P 500 represent the daily index value at market close. The market typically closes at 4 PM ET, except for holidays when it sometimes closes early. The Federal Reserve Bank of St. Louis and S&P Dow Jones Indices LLC have reached a new agreement on the use of Standard & Poors and Dow Jones Averages series in FRED. FRED and its associated services will include 10 years of daily history for Standard & Poors and Dow Jones Averages series. The S&P 500 is regarded as a gauge of the large cap U.S. equities market. The index includes 500 leading companies in leading industries of the U.S. economy, which are publicly held on either the NYSE or NASDAQ, and covers 75% of U.S. equities. Since this is a price index and not a total return index, the S&P 500 index here does not contain dividends. Copyright 2016, S&P Dow Jones Indices LLC. All rights reserved. Reproduction of S&P 500 in any form is prohibited except with the prior written permission of S&P Dow Jones Indices LLC (\\\"S&P\\\"). S&P does not guarantee the accuracy, adequacy, completeness or availability of any information and is not responsible for any errors or omissions, regardless of the cause or for the results obtained from the use of such information. S&P DISCLAIMS ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE. In no event shall S&P be liable for any direct, indirect, special or consequential damages, costs, expenses, legal fees, or losses (including lost income or lost profit and opportunity costs) in connection with subscriber's or others' use of S&P 500. Permission to reproduce S&P 500 can be requested from index_services@spdji.com. More contact details are available here , including phone numbers for all regional offices. Suggested Citation: S&P Dow Jones Indices LLC,           S&P 500 [SP500],           retrieved from FRED,           Federal Reserve Bank of St. Louis;           https://fred.stlouisfed.org/series/SP500, . Release Tables Related Data and Content Data Suggestions Based On Your Se\", \"images\": [], \"rank\": 1}, {\"url\": \"https://www.thriventfunds.com/insights/market-update/december-2025-market-update-stock-volatility-returns.html\", \"content\": \"December 2025 Market Update | Thrivent Asset Management Asset Management Thrivent websites Financial Professional Individual Investor Thrivent.com Asset Management Individual Investor Financial Professional Individual Investor Thrivent.com label for search input Login Ways to invest Products Products Mutual Funds Thrivent Asset Allocation Funds Thrivent Equity Funds Thrivent Fixed Income Funds ETFs Fund Tools & Resources Fund tools and resources Fund Prospectus & Literature Compare Funds Mutual Fund Performance Historical Prices Morningstar 4- or 5-star funds Investing Style Quiz Accounts Accounts Retirement Accounts Roth IRAs Traditional IRA SEP IRA Rollovers Direct & Indirect Rollovers IRA to IRA transfer Roth IRA Conversion General Investment Single & Joint Accounts Kids Coverdell ESA UTMA Business & Organization Not sure which account you need? Learn more Start investing today. Open an account Insights Insights Market Update Retirement Planning Mutual Fund Focus Investing Essentials Starting Out Building Wealth Lifestyle Market Volatility Start investing today Open an account Our view (PDF) Learn more About About Get to know us Investing your way Leadership Team Our Fund Managers Our achievements Still have questions? View FAQs We are here to help Contact us Support Support Frequently Asked Questions Tax Resource Center Fund changes & mergers Forms Login Ways to invest label for search input Financial Professional Individual Investor Thrivent.com Individual Investor Close Navigation Three ways to invest in Thrivent funds Were here to help you invest with confidence. MUTUAL FUNDS Thrivent Account You can purchase mutual funds right on our site with an online account. Get started Invest with a Thrivent account Set up an account starting with as little as $50 per month. 1 Access your online account at your convenience. Purchase funds without transaction fees or sales charges. MUTUAL FUNDS & ETFS Financial Professional For guidance when investing, ask a financial professional about investing in Thrivent mutual funds & ETFs. Contact a Thrivent advisor Invest with a financial professional Receive investment help from an experienced professional. Build a relationship through in-person meetings. Get help planning for lifes goals such as saving and retirement. Additional fees may apply. MUTUAL FUNDS & ETFS Brokerage Account If you already have a brokerage account, our mutual funds & ETFs can be purchased through online brokerage platforms by searching for Thrivent Mutual Funds and ETFs. Invest with a brokerage account Add Thrivent Mutual Funds and ETFs to your investments within your existing portfolio. Take advantage of your account to keep your investments in one place. Additional fees may apply. Not quite ready? We want you to invest your money wisely and with confidence. Here are some other options that may help you. Take our quiz to determine your personal investment style. Talk to your financial advisor about ETFs. Sign up for our monthly investing insights newsletter. Need more help? If you need assistance, were here to help. Reach out to us via the phone, email, and support page information below. For mutual funds help, call us at 800-847-4836, or email contactus@thriventfunds.com . For ETFs, contact your financial professional or brokerage firm. Visit our support page for additional help. 1 New accounts with a minimum monthly investment amount of $50 are offered through the Thrivent Mutual Funds automatic investment plan. Otherwise, the minimum initial investment requirement is $2,000 for non-retirement accounts and $1,000 for IRA or tax-deferred accounts, minimum subsequent investment requirement is $50 for all account types. Account minimums for other options vary. Thrivent ETFs may be purchased through your financial professional or brokerage platforms. Contact your financial professional or brokerage firm to understand minimum investment amounts when purchasing a Thrivent ETF. Now leaving ThriventFunds.com You're about\", \"images\": [], \"rank\": 2}, {\"url\": \"https://www.bloomberg.com/news/articles/2025-12-19/six-charts-that-show-how-stock-markets-got-reshaped-in-2025\", \"content\": \"Bloomberg - Are you a robot? Bloomberg Need help? Contact us We've detected unusual activity from your computer network To continue, please click the box below to let us know you're not a robot. Why did this happen? Please make sure your browser supports JavaScript and cookies and that you are not           blocking them from loading.           For more information you can review our Terms of Service and Cookie Policy . Need Help? For inquiries related to this message please contact             our support team and provide the reference ID below. Block reference ID:3e0cfdb1-e47d-11f0-a2f2-85d56a65450a Get the most important global markets news at your fingertips with a Bloomberg.com subscription. SUBSCRIBE NOW\", \"images\": [], \"rank\": 3}, {\"url\": \"https://www.investopedia.com/dow-jones-today-12262025-11876265\", \"content\": \"Markets News, Dec. 26, 2025: Stock Indexes Log Weekly Gains After Quiet Friday Session, Holiday-Shortened Week Skip to content Investopedia Trade Search Please fill out this field. Newsletters Search Please fill out this field. News News Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Investing Investing Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis View All Simulator Simulator Login / Portfolio Trade Research My Games Leaderboard Banking Banking Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal Finance Personal Finance Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Economy Economy Government and Policy Monetary Policy Fiscal Policy Economics View All Reviews Reviews Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Newsletters Follow Us News Markets Companies Earnings CD Rates Mortgage Rates Economy Government Crypto Live Markets News Personal Finance View All Investing Stocks Cryptocurrency Bonds ETFs Options and Derivatives Commodities Trading Automated Investing Brokers Fundamental Analysis View All Simulator Login / Portfolio Trade Research My Games Leaderboard Banking Savings Accounts Certificates of Deposit (CDs) Money Market Accounts Checking Accounts View All Personal Finance Budgeting and Saving Personal Loans Insurance Mortgages Credit and Debt Student Loans Taxes Credit Cards Financial Literacy Retirement View All Economy Government and Policy Monetary Policy Fiscal Policy Economics View All Reviews Best Online Brokers Best Crypto Exchanges Best Savings Rates Best CD Rates Best Life Insurance Best Mortgage Rates Best Robo-Advisors Best Personal Loans Best Debt Relief Companies View All Markets News, Dec. 26, 2025: Stock Indexes Log Weekly Gains After Quiet Friday Session, Holiday-Shortened Week By Aaron Rennie Read Full Bio A former Senior Publishing Editor on the Dow Jones Newswires team at The Wall Street Journal, Aaron earned a Bachelor's degree in Economics from the University of Michigan and a Master's in Journalism from Columbia University. Learn about our editorial policies Updated December 26, 2025 04:09 PM EST The three major stock indexes all rose by more than 1% this week. Spencer Platt / Getty Images Major stock indexes ended a largely positive holiday week quietly. After traders got the day off for Christmas, the tech-heavy Nasdaq closed down 0.1% and the blue-chip Dow Jones Industrial Average fell fractionally. The benchmark S&P 500 set a new intraday high before finishing fractionally lower. The three indexes, which snapped five-session winning streaks Friday, nevertheless all rose by more than 1% for the week. Gold and silver futures set all-time highs Friday, rising to about $4,585 and $79 an ounce, respectively to extend their recent upward runs. Miner Freeport-McMoRan ( FCX ) was one of the top performers in the S&P 500 Friday, with shares finishing up 2.2%. Target ( TGT ) stock rose more than 3% to lead the S&P 500 after the Financial Times reported that hedge fund and activist investor Toms Capital Investment Management had taken a stake in the retailer. Shares of Nvidia ( NVDA ), the world's most valuable public company, rose 1%. On Wednesday, AI chip designer Groq said it had entered into a licensing agreement with Nvidia for its inference technology, and CNBC reported that Nvidia acquired assets worth $20 billion in cash. The 10-year Treasury yield , which influences interest rates on a variety of commercial and consumer loans, was little changed at 4 p.m. ET from Wednesday's close of 4.13%. Bitcoin was trading around $87,500, down from an overnight high\", \"images\": [], \"rank\": 4}, {\"url\": \"https://www.cnbc.com/2025/12/26/stock-market-today-live-updates.html\", \"content\": \"Stock market news for Dec. 26, 2025 Skip Navigation Markets Pre-Markets U.S. Markets Europe Markets China Markets Asia Markets World Markets Currencies Cryptocurrency Futures & Commodities Bonds Funds & ETFs Business Economy Finance Health & Science Media Real Estate Energy Climate Transportation Investigations Industrials Retail Wealth Sports Life Small Business Investing Personal Finance Fintech Financial Advisors Options Action ETF Street Buffett Archive Earnings Trader Talk Tech Cybersecurity AI Enterprise Internet Media Mobile Social Media CNBC Disruptor 50 Tech Guide Politics White House Policy Defense Congress Expanding Opportunity Europe Politics China Politics Asia Politics World Politics Video Latest Video Full Episodes Livestream Top Video Live Audio Europe TV Asia TV CNBC Podcasts CEO Interviews Digital Originals Watchlist Investing Club Trust Portfolio Analysis Trade Alerts Meeting Videos Homestretch Jim's Columns Education Subscribe PRO Pro News Josh Brown Mike Santoli Calls of the Day My Portfolio Livestream Full Episodes Stock Screener Market Forecast Options Investing Chart Investing Subscribe Livestream Menu Make It select USA INTL Livestream Search quotes, news & videos Livestream Watchlist SIGN IN Create free account Markets Business Investing Tech Politics Video Watchlist Investing Club PRO Livestream Menu Updated Fri, Dec 26 2025 4:31 PM EST Share Share Article via Facebook Share Article via Twitter Share Article via LinkedIn Share Article via Email S&P 500 closes little changed after touching fresh record, posts winning week: Live updates Sean Conlon Fred Imbert Traders work on the floor of the New York Stock Exchange (NYSE) in New York City. Spencer Platt | Getty Images The S&P 500 reached a new high on Friday and posted weekly gains as traders came back from the Christmas holiday. The broad market index closed down 0.03% to end at 6,929.94. At its high, the S&P 500 was up 0.2%, reaching 6,945.77. The Nasdaq Composite slipped 0.09% and closed at 23,593.10. The Dow Jones Industrial Average fell 20.19 points, or 0.04%, and settled at 48,710.97. For the week, the S&P 500 gained 1.4%, notching its fourth weekly advance in five weeks. The Dow and Nasdaq were also up more than 1% week to date. \\\"People are taking profits here and there, or buying on lows, but there's not a lot of information. You're not getting corporate profit results. You're not getting a lot of economic data, so it's probably just more technicals and positioning heading into here,\\\" said Tom Hainlin, national investment strategist at U.S. Bank Asset Management. The strategist highlighted the recent broadening that's been taking place in the market as a trade in play for the new year, noting that the S&P 500's rise to fresh records Wednesday wasn't propelled by the technology sector but rather financials and industrials two cyclical areas of the U.S. economy. \\\"That just gives more confidence heading into 2026 that it's not just tech here and everybody behind them. It's the market benefiting from the tax bill that was signed in July, the rate cuts that came in the fourth quarter of this year,\\\" he continued. \\\"Heading into 2026, those are some tailwinds.\\\" Investors are also in a historically strong seasonal period, as they await a potential Santa Claus rally . The surge occurs between the last five trading days of the year and the first two of the new year. Data from the Stock Trader's Almanac shows the S&P 500 averages a 1.3% gain during that time going back to 1950. Fri, Dec 26 2025 4:15 PM EST Stocks close little changed The three leading U.S. indexes finished relatively unchanged on Friday. The S&P 500 fell 0.03% to 6,929.94, while the Nasdaq Composite dropped 0.09% to 23,593.10. The Dow Jones Industrial Average also slipped 20.19 points, or 0.04%, to 48,710.97. Sean Conlon Fri, Dec 26 2025 3:31 PM EST Investors brace for a new year next week The New Year's Eve ball drop numerals for 2026 are displayed in Times Square on December 18, 2025\", \"images\": [], \"rank\": 5}]",
        "annotations": null
      }
    ]
  }
}