{
  "ipl_urls_1A": "['https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/', 'https://www.statista.com/topics/4543/indian-premier-league-ipl/', 'https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms', 'https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html', 'https://www.timesnownews.com/business-economy/industry/how-ipl-makes-money-breaking-down-multi-billion-dollar-indian-premier-league-cricket-business-article-110461871', 'https://medium.com/@theunitedindian500/ipl-revenue-per-year-4d740fa8a77e', 'https://finvests.in/ipl-winners-2008-to-2025-titles-captains-earnings/', 'https://www.kreedon.com/indian-premier-league-ipl-revenue-growth-breaking-down-the-numbers', 'https://en.wikipedia.org/wiki/List_of_Indian_Premier_League_records_and_statistics', 'https://blog.privatecircle.co/the-business-behind-the-ipl-sponsorships-revenues-and-the-rise-of-cricket-economics-fy24-deep-dive/']",
  "ipl_annual_revenue_data_T001": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
            "content": "The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) - BreakingGlobe Skip to content Tuesday, December 23, 2025 Responsive Menu About Us Disclaimer Privacy Policy Contact Us BreakingGlobe Search Search News Sports Entertainment Technology Home 2025 April 10 The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) Sports The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) 10 April 2025 breakingglobe.com When the Indian Premier League (IPL) was launched in 2008 by the Board of Control for Cricket in India (BCCI), few could have imagined the financial juggernaut it would become. What began as a bold experiment in franchise-based T20 cricket has evolved into one of the most profitable sporting leagues in the worldrivaling the likes of the NFL, NBA, and Premier League in terms of viewership, brand value, and revenue generation. Over nearly two decades, IPL has seen exponential growth in terms of broadcasting rights, sponsorship deals, franchise valuations, and digital monetization. Heres a comprehensive, year-wise journey through the leagues financial transformation from 2008 to 2025. 20082012: Humble Beginnings and Early Success 2008 The Launch Gross Revenue: 645 crore Net Profit: 51 crore Title Sponsor: DLF (40 crore/year) Broadcaster: Sony-WSG (10-year deal worth $1.026 billion) The inaugural season was a blockbuster success. The IPL immediately captured public imagination, thanks to its glamorous appeal, franchise culture, and star-studded matches. The revenue modelcomprising broadcasting rights, sponsorships, ticket sales, and merchandiseset a robust foundation. 20092012 Building Consistency Despite challenges like the 2009 season moving to South Africa due to elections, revenues held steady. The league maintained strong ad sales and increased franchise participation. Brand IPL began to attract global attention, especially with international players taking part. 20132015: Transition and Turbulence 2013 New Sponsorship & Growth Title Sponsor: PepsiCo (79.4 crore/year) PepsiCo signed a five-year deal, showing the IPLs growing appeal. However, 2013 also marked the start of controversies around spot-fixing, leading to a temporary dent in credibility. 20142015 Split Season & Sponsor Exit Part of the 2014 season was hosted in the UAE, again due to Indian general elections. Despite this, viewership and revenues remained stable. Pepsi eventually exited the sponsorship deal in 2015, cutting it short due to the ongoing controversies. 20162017: Commercial Reboot and Media Rights Evolution 2016 Vivo Steps In Title Sponsor: Vivo (100 crore/year) Chinese brand Vivo signed on as the title sponsor, signifying IPLs resilience and commercial trust. The league was recovering well and growing in confidence. 2017 Media Rights on the Horizon This year set the stage for a major shake-up in the IPLs commercial ecosystem. With digital consumption on the rise, interest in media rights surged. 20182022: Billion-Dollar League 2018 Star India Era Begins Media Rights (20182022): 16,347 crore Average Annual Media Revenue: ~3,270 crore Title Sponsor: Vivo (renewed for 439.8 crore/year) Star India acquired broadcasting rights, including TV and digital, for five years. This was a landmark moment, catapulting IPL into the billion-dollar league club. 20192021 COVID and Resilience Despite the pandemic disruptions in 2020 and 2021, IPL displayed extraordinary resilience. The tournament was held in the UAE and India under strict protocols. Digital viewership soared, compensating for ticket sale losses. 2021 Brand Value: ~$4.7 billion Rise of fantasy platforms and OTT consumption added new revenue streams. 20232025: Dominance, Digital Expansion, and Record Revenue 2023 Media Rights Skyrocket Media Rights (20232027): 48,390 crore (~$6.2 billion) TV Rights (Star): 23,575 crore Digital Rights (Viacom18): 20,500 crore Per Match Value: 118 crore (~$14.5 million) With each IPL match now valued higher than even some NFL and Premier League g",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
            "content": "Indian Premier League - statistics & facts | Statista Skip to main content Statistics All Industries Go to All Industries Consumer Goods & FMCG Go to Consumer Goods & FMCG E-Commerce Go to E-Commerce Economy & Politics Go to Economy & Politics Energy & Environment Go to Energy & Environment Internet Go to Internet Technology & Telecommunications Go to Technology & Telecommunications Transportation & Logistics Go to Transportation & Logistics Travel, Tourism & Hospitality Go to Travel, Tourism & Hospitality Most viewed Statistics Recent Statistics Popular Statistics Most used social networks 2024, by number of users Big Mac index worldwide 2024 Global retail e-commerce sales 2014-2027 Car brand market share worldwide 2023 Quarterly Netflix subscribers count worldwide 2013-2024 Topics More Topics E-commerce worldwide - statistics & facts Social media - Statistics & Facts Top Report View Report Industry Overview Most viewed statistics Recent Statistics Popular Statistics Global sales of the top performance apparel, accessories, and footwear companies 2023 Nike's global revenue 2005-2024 Value of the secondhand apparel market worldwide from 2021 to 2028 Brand value of the most valuable soft drink brands worldwide 2023 Revenue of the leading 10 beauty manufacturers worldwide 2023 Topics Topic overview Global apparel market - statistics & facts Cosmetics industry - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics E-commerce as share of total retail sales worldwide 2021-2027 Biggest online retailers in the U.S. 2023, by market share Revenue of the e-commerce industry in the U.S. 2019-2029 Fastest-growing retail e-commerce countries 2023 Retail e-commerce sales growth worldwide 2017-2027 Topics Topic overview Amazon - statistics & facts E-commerce in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Biggest companies in the world by market value 2023 Largest armies in the world by active military personnel 2024 U.S. border patrol apprehensions and expulsions FY 1990-2023 Gross domestic product (GDP) in India 2029 Countries with the highest military spending 2023 Topics Topic overview Inflation worldwide - statistics & facts Global GDP - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Global household electricity prices 2023, by select country Annual global emissions of carbon dioxide 1940-2023 Monthly electricity prices in selected EU countries 2020-2024 EU-ETS allowance prices in the European Union 2022-2024 Renewable energy capacity 2023 by country Topics Topic overview Global waste generation - statistics & facts Global climate change - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Worldwide digital population 2024 Average daily time spent on social media worldwide 2012-2024 Facebook: quarterly number of MAU (monthly active users) worldwide 2008-2023 Social media: global penetration rate 2024, by region Instagram accounts with the most followers worldwide 2024 Topics Topic overview TikTok - statistics & facts Social media usage in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Quarterly smartphone market share worldwide by vendor 2009-2023 Apple's revenue worldwide 2004-2023 Global IT spending forecast 2012-2024, by segment Semiconductor market revenue worldwide 1987-2025 Digital transformation spending worldwide 2017-2027 Topics Topic overview Artificial intelligence (AI) worldwide - statistics & facts Smartphones - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Annual car sales worldwide 2010-2023, with a forecast for 2024 Monthly container freight rate index worldwide 2023-2024 Automotive manufacturers' estimated market share in the U.S. 2023 Global air traff",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
            "content": "Crickets mammoth Indian Premier League Skip to main content World Business Legal Markets Breakingviews More The chart shows the valuation of the Indian Premier League in 2009 using squares. Each square represents $10 million. It rose to $3.3 billion in 2013. The chart shows the valuation of the Indian Premier League in 2009 and 2013 using squares. Each square represents $10 million. It crossed $5 billion in 2018. The chart shows the valuation of the Indian Premier League in 2009, 2013 and 2018 using squares. Each square represents $10 million. Its valuation more than doubled in six years and touched $12 billion in 2024. The chart shows the valuation of the Indian Premier League in 2009, 2013, 2018 and 2024 using squares. Each square represents $10 million. Graphics Crickets mammoth Indian Premier League By Sumanta Sen Published March 28, 202512:30 PM GMT+5:30 The months of April and May mean only one thing for Indias army of cricket fans: the Indian Premier League (IPL). Now in its 18th season, the IPL was crickets first franchise style league officially run by a cricket board. A franchise sports league is a tournament where teams are run like a business and can be privately owned. Leagues like soccers Premier League in England and basketballs National Basketball Association in the United States are domestic tournaments. Across all major sports played in the world, including soccer, American football, baseball and basketball, franchise-style leagues have long been almost as popular as international events. Not in cricket though. The sport is primarily played at international level among a handful of countries, most of them former colonies of Britain. The international governing body of cricket, the International Cricket Council (ICC), has 12 permanent members. It also has more than 90 associate member nations where the game is in various stages of development and popularity. While smaller than soccer, cricket is followed by over a billion people, the vast majority of them in south Asia. Fans in India account for more than 80% of crickets following globally. The graphic is a world map showing the full and associate members of the ICC. Full members are coloured in dark blue while associate members are coloured in light blue. With such massive popularity in India, it is not hard to understand that the sport is financially lucrative in the country. The Board of Control for Cricket in India (BCCI) wields the most influence in the sport. According to the ICCs revenue model agreed in 2023, the BCCI will take home nearly 40% of the ICCs annual net earnings from 2024 to 2027. All other boards receive a share less than 10%. The BCCIs earnings have also been substantially higher than its rivals. Its profit for the financial year ended March 2023, the latest year for which filings are available, was the highest at $160 million. In comparison, the South African cricket board recorded a profit of $45 million in the May 2023 to April 2024 period, a distant second. The graphic is a bar chart showing the latest available profits of various cricket boards. A report by the World Cricketers Association (WCA), an independent global players body in cricket, released on March 26, 2025called for an equitable revenue distribution system across cricket boards. Global crickets finances and distribution models are heavily imbalanced, self perpetuating, and do not effectively support global growth or competitive balance,\" it said. How it all started One of the reasons for the BCCIs riches is the IPL. Indias cricket board announced the Indian Premier League in 2007 around the time the inaugural edition of the Twenty20 (T20) Cricket World Cup was taking place. T20 was the newest format of the game, fast paced and played over three hours as opposed to the other two formats which take a whole day or five days. The first season was played in the Indian summer in 2008 over 44 days featuring eight Indian city-based franchises owned by some of the countrys riches",
            "images": [],
            "rank": 3
          },
          {
            "url": "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
            "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html\" on this server. Reference #18.8ed70b17.1767067472.c07c3e1a https://errors.edgesuite.net/18.8ed70b17.1767067472.c07c3e1a",
            "images": [],
            "rank": 4
          },
          {
            "url": "https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms",
            "content": "IPL a bigger hit, revenues surge - The Economic Times Benchmarks Nifty 26,027.30 -19.66 FEATURED FUNDS Motilal Oswal Midcap Fund Direct-Growth 5Y Return 30.1 % Invest Now FEATURED FUNDS UTI Aggressive Hybrid Fund Regular Plan-Growth 5Y Return 17.42 % Invest Now Enter search text: News English Edition English Edition     | Today's ePaper My Watchlist Subscribe Sign In Home ETPrime Markets Market Data Masterclass IPO News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu India WPL IPL 2026 Economy Economy Dashboard Agriculture Finance Foreign Trade Indicators Infrastructure Policy Politics Newsblogs Elections Assembly Elections Bihar More Sports Science GST 2.0 Defence Web Stories International US News Global Trends Trump Action Tracker Canada News UK News Australia New Zealand Saudi Arabia UAE Singapore Hong Kong Business World News ET Explains Company Corporate Trends Industry Trending Entertainment Decoded Morning Brief Podcast ET Evoke Bengaluru News Pune News Mumbai News Environment Videos Latest News Most Read Most Shared Most Commented Business News News Sports IPL a bigger hit, revenues surge The Economic Times daily newspaper is available online now. Read Today's Paper IPL a bigger hit, revenues surge SECTIONS IPL a bigger hit, revenues surge By Javed Farooqui , ET Bureau Last Updated: Dec 09, 2024, 10:46:00 AM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis The Indian Premier League (IPL) experienced remarkable financial growth in FY24, with the top 10 franchises more than doubling their combined revenue to 6,797 crore. A record-breaking media rights deal and lucrative sponsorships fueled this surge. Gujarat Titans led in revenue, closely followed by Mumbai Indians and Chennai Super Kings, while Punjab Kings emerged as the most profitable franchise. ANI IPL The Indian Premier League ( IPL ) is on a remarkable growth streak, with the top 10 franchises seeing their combined revenue more than double to 6,797 crore in FY24 from 3,082 crore in the previous year, according to financial data from Tofler. Experts attributed the surge to the leagues soaring commercial appeal, powered by smart media partnerships and lucrative sponsorship deals. The primary catalyst for growth was the record 48,390 crore media rights deal signed in 2022 between the Board of Control for Cricket in India (BCCI) and Disney Star and Viacom18, who have since combined to form JioStar. In addition to broadcasting revenue, the BCCI secured over 4,000 crore from multi-year sponsorship agreements with major brands, including Tata Group, My11Circle, Ceat , and AngelOne. According to a recent Brand Finance report, IPL's brand value has grown by 13% to reach $12 billion in 2024 compared to 2023, up from its $2 billion valuation in 2009. Notably, four franchisesChennai Super Kings (CSK), Mumbai Indians (MI), Royal Challengers Bangalore (RCB), and Kolkata Knight Riders (KKR)have crossed the $100 million mark in brand value. Live Events \"The three key drivers of growth for IPL teams are the central revenue pool, which includes media rights and sponsorship income, team-specific sponsorships, and gate revenue. In FY24, media rights income reached record levels, providing a substantial boost, said Ajimon Francis, managing director of Brand Finance India. Similarly, team sponsorships saw significant growth, contributing to increased financial stability. Additionally, gate revenue experienced a positive shift, driven by higher ticket prices and full capacity utilisation at stadiums, further enhancing overall revenue for IPL teams,\" he added. The financial performance of IPL franchises last fiscal marked a remarkable turnaround, with most teams reporting doubling of revenue and improved profitability. Leading the charge were Gujarat Titans (GT), MI, and CSK, who set new financial benchmarks, while Punjab Kings (PK) emerged as the most profitable franchise. GT, owned by CVC Capital",
            "images": [],
            "rank": 5
          }
        ],
        "annotations": null
      }
    ]
  },
  "ipl_revenue_urls_1A": [
    "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
    "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
    "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
    "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
    "https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms",
    "https://www.kreedon.com/indian-premier-league-ipl-revenue-growth-breaking-down-the-numbers",
    "https://www.linkedin.com/pulse/ipl-revenue-hits-new-high-fy24-key-takeaways-insights-satend-kushwaha-qtzmf",
    "https://medium.com/@theunitedindian500/ipl-revenue-per-year-4d740fa8a77e"
  ],
  "ipl_revenue_search_results_1A": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
            "content": "The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) - BreakingGlobe Skip to content Thursday, December 25, 2025 Responsive Menu About Us Disclaimer Privacy Policy Contact Us BreakingGlobe Search Search News Sports Entertainment Technology Home 2025 April 10 The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) Sports The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) 10 April 2025 breakingglobe.com When the Indian Premier League (IPL) was launched in 2008 by the Board of Control for Cricket in India (BCCI), few could have imagined the financial juggernaut it would become. What began as a bold experiment in franchise-based T20 cricket has evolved into one of the most profitable sporting leagues in the worldrivaling the likes of the NFL, NBA, and Premier League in terms of viewership, brand value, and revenue generation. Over nearly two decades, IPL has seen exponential growth in terms of broadcasting rights, sponsorship deals, franchise valuations, and digital monetization. Heres a comprehensive, year-wise journey through the leagues financial transformation from 2008 to 2025. 20082012: Humble Beginnings and Early Success 2008 The Launch Gross Revenue: 645 crore Net Profit: 51 crore Title Sponsor: DLF (40 crore/year) Broadcaster: Sony-WSG (10-year deal worth $1.026 billion) The inaugural season was a blockbuster success. The IPL immediately captured public imagination, thanks to its glamorous appeal, franchise culture, and star-studded matches. The revenue modelcomprising broadcasting rights, sponsorships, ticket sales, and merchandiseset a robust foundation. 20092012 Building Consistency Despite challenges like the 2009 season moving to South Africa due to elections, revenues held steady. The league maintained strong ad sales and increased franchise participation. Brand IPL began to attract global attention, especially with international players taking part. 20132015: Transition and Turbulence 2013 New Sponsorship & Growth Title Sponsor: PepsiCo (79.4 crore/year) PepsiCo signed a five-year deal, showing the IPLs growing appeal. However, 2013 also marked the start of controversies around spot-fixing, leading to a temporary dent in credibility. 20142015 Split Season & Sponsor Exit Part of the 2014 season was hosted in the UAE, again due to Indian general elections. Despite this, viewership and revenues remained stable. Pepsi eventually exited the sponsorship deal in 2015, cutting it short due to the ongoing controversies. 20162017: Commercial Reboot and Media Rights Evolution 2016 Vivo Steps In Title Sponsor: Vivo (100 crore/year) Chinese brand Vivo signed on as the title sponsor, signifying IPLs resilience and commercial trust. The league was recovering well and growing in confidence. 2017 Media Rights on the Horizon This year set the stage for a major shake-up in the IPLs commercial ecosystem. With digital consumption on the rise, interest in media rights surged. 20182022: Billion-Dollar League 2018 Star India Era Begins Media Rights (20182022): 16,347 crore Average Annual Media Revenue: ~3,270 crore Title Sponsor: Vivo (renewed for 439.8 crore/year) Star India acquired broadcasting rights, including TV and digital, for five years. This was a landmark moment, catapulting IPL into the billion-dollar league club. 20192021 COVID and Resilience Despite the pandemic disruptions in 2020 and 2021, IPL displayed extraordinary resilience. The tournament was held in the UAE and India under strict protocols. Digital viewership soared, compensating for ticket sale losses. 2021 Brand Value: ~$4.7 billion Rise of fantasy platforms and OTT consumption added new revenue streams. 20232025: Dominance, Digital Expansion, and Record Revenue 2023 Media Rights Skyrocket Media Rights (20232027): 48,390 crore (~$6.2 billion) TV Rights (Star): 23,575 crore Digital Rights (Viacom18): 20,500 crore Per Match Value: 118 crore (~$14.5 million) With each IPL match now valued higher than even some NFL and Premier League",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
            "content": "Indian Premier League - statistics & facts | Statista Skip to main content Statistics All Industries Go to All Industries Consumer Goods & FMCG Go to Consumer Goods & FMCG E-Commerce Go to E-Commerce Economy & Politics Go to Economy & Politics Energy & Environment Go to Energy & Environment Internet Go to Internet Technology & Telecommunications Go to Technology & Telecommunications Transportation & Logistics Go to Transportation & Logistics Travel, Tourism & Hospitality Go to Travel, Tourism & Hospitality Most viewed Statistics Recent Statistics Popular Statistics Most used social networks 2024, by number of users Big Mac index worldwide 2024 Global retail e-commerce sales 2014-2027 Car brand market share worldwide 2023 Quarterly Netflix subscribers count worldwide 2013-2024 Topics More Topics E-commerce worldwide - statistics & facts Social media - Statistics & Facts Top Report View Report Industry Overview Most viewed statistics Recent Statistics Popular Statistics Global sales of the top performance apparel, accessories, and footwear companies 2023 Nike's global revenue 2005-2024 Value of the secondhand apparel market worldwide from 2021 to 2028 Brand value of the most valuable soft drink brands worldwide 2023 Revenue of the leading 10 beauty manufacturers worldwide 2023 Topics Topic overview Global apparel market - statistics & facts Cosmetics industry - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics E-commerce as share of total retail sales worldwide 2021-2027 Biggest online retailers in the U.S. 2023, by market share Revenue of the e-commerce industry in the U.S. 2019-2029 Fastest-growing retail e-commerce countries 2023 Retail e-commerce sales growth worldwide 2017-2027 Topics Topic overview Amazon - statistics & facts E-commerce in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Biggest companies in the world by market value 2023 Largest armies in the world by active military personnel 2024 U.S. border patrol apprehensions and expulsions FY 1990-2023 Gross domestic product (GDP) in India 2029 Countries with the highest military spending 2023 Topics Topic overview Inflation worldwide - statistics & facts Global GDP - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Global household electricity prices 2023, by select country Annual global emissions of carbon dioxide 1940-2023 Monthly electricity prices in selected EU countries 2020-2024 EU-ETS allowance prices in the European Union 2022-2024 Renewable energy capacity 2023 by country Topics Topic overview Global waste generation - statistics & facts Global climate change - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Worldwide digital population 2024 Average daily time spent on social media worldwide 2012-2024 Facebook: quarterly number of MAU (monthly active users) worldwide 2008-2023 Social media: global penetration rate 2024, by region Instagram accounts with the most followers worldwide 2024 Topics Topic overview TikTok - statistics & facts Social media usage in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Quarterly smartphone market share worldwide by vendor 2009-2023 Apple's revenue worldwide 2004-2023 Global IT spending forecast 2012-2024, by segment Semiconductor market revenue worldwide 1987-2025 Digital transformation spending worldwide 2017-2027 Topics Topic overview Artificial intelligence (AI) worldwide - statistics & facts Smartphones - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Annual car sales worldwide 2010-2023, with a forecast for 2024 Monthly container freight rate index worldwide 2023-2024 Automotive manufacturers' estimated market share in the U.S. 2023 Global air traff",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
            "content": "Crickets mammoth Indian Premier League Skip to main content World Business Legal Markets Breakingviews More The chart shows the valuation of the Indian Premier League in 2009 using squares. Each square represents $10 million. It rose to $3.3 billion in 2013. The chart shows the valuation of the Indian Premier League in 2009 and 2013 using squares. Each square represents $10 million. It crossed $5 billion in 2018. The chart shows the valuation of the Indian Premier League in 2009, 2013 and 2018 using squares. Each square represents $10 million. Its valuation more than doubled in six years and touched $12 billion in 2024. The chart shows the valuation of the Indian Premier League in 2009, 2013, 2018 and 2024 using squares. Each square represents $10 million. Graphics Crickets mammoth Indian Premier League By Sumanta Sen Published March 28, 202512:30 PM GMT+5:30 The months of April and May mean only one thing for Indias army of cricket fans: the Indian Premier League (IPL). Now in its 18th season, the IPL was crickets first franchise style league officially run by a cricket board. A franchise sports league is a tournament where teams are run like a business and can be privately owned. Leagues like soccers Premier League in England and basketballs National Basketball Association in the United States are domestic tournaments. Across all major sports played in the world, including soccer, American football, baseball and basketball, franchise-style leagues have long been almost as popular as international events. Not in cricket though. The sport is primarily played at international level among a handful of countries, most of them former colonies of Britain. The international governing body of cricket, the International Cricket Council (ICC), has 12 permanent members. It also has more than 90 associate member nations where the game is in various stages of development and popularity. While smaller than soccer, cricket is followed by over a billion people, the vast majority of them in south Asia. Fans in India account for more than 80% of crickets following globally. The graphic is a world map showing the full and associate members of the ICC. Full members are coloured in dark blue while associate members are coloured in light blue. With such massive popularity in India, it is not hard to understand that the sport is financially lucrative in the country. The Board of Control for Cricket in India (BCCI) wields the most influence in the sport. According to the ICCs revenue model agreed in 2023, the BCCI will take home nearly 40% of the ICCs annual net earnings from 2024 to 2027. All other boards receive a share less than 10%. The BCCIs earnings have also been substantially higher than its rivals. Its profit for the financial year ended March 2023, the latest year for which filings are available, was the highest at $160 million. In comparison, the South African cricket board recorded a profit of $45 million in the May 2023 to April 2024 period, a distant second. The graphic is a bar chart showing the latest available profits of various cricket boards. A report by the World Cricketers Association (WCA), an independent global players body in cricket, released on March 26, 2025called for an equitable revenue distribution system across cricket boards. Global crickets finances and distribution models are heavily imbalanced, self perpetuating, and do not effectively support global growth or competitive balance,\" it said. How it all started One of the reasons for the BCCIs riches is the IPL. Indias cricket board announced the Indian Premier League in 2007 around the time the inaugural edition of the Twenty20 (T20) Cricket World Cup was taking place. T20 was the newest format of the game, fast paced and played over three hours as opposed to the other two formats which take a whole day or five days. The first season was played in the Indian summer in 2008 over 44 days featuring eight Indian city-based franchises owned by some of the countrys riches",
            "images": [],
            "rank": 3
          },
          {
            "url": "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
            "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html\" on this server. Reference #18.8ed70b17.1767066337.c045d14e https://errors.edgesuite.net/18.8ed70b17.1767066337.c045d14e",
            "images": [],
            "rank": 4
          },
          {
            "url": "https://www.firstpost.com/firstcricket/bcci-ipl-revenue-fy24-earnings-report-13908185.html",
            "content": "How much money the BCCI earned in FY24, with IPL as its biggest cash cow Firstpost Home Video Shows Vantage Firstpost America Firstpost Africa First Sports World US News Explainers News India Opinion Cricket Tech Entertainment Sports Health Photostories Asia Cup 2025 Apple Incorporated Modi ji Justin Trudeau Trending Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Impact Shorts Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Events Raisina Dialogue Independence Day Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Trending: PM Modi in Manipur Charlie Kirk killer Sushila Karki IND vs PAK India-US ties New human organ Downton Abbey: The Grand Finale Movie Review How much money the BCCI earned in FY24, with IPL as its biggest cash cow Whatsapp Facebook Twitter Whatsapp Facebook Twitter Apple Incorporated Modi ji Justin Trudeau Trending Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Impact Shorts Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Events Raisina Dialogue Independence Day Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Home First Cricket How much money the BCCI earned in FY24, with IPL as its biggest cash cow How much money the BCCI earned in FY24, with IPL as its biggest cash cow FirstCricket Staff July 18, 2025, 08:48:37 IST Whatsapp Facebook Twitter The IPL remains BCCIs biggest money maker, contributing over half of its annual earnings in FY24. Check out how much Indias richest sporting body made in the last financial year. The numbers will shock you. Advertisement Subscribe Join Us Add as a preferred source on Google Prefer Firstpost On Google The BCCI earned over Rs 9,000 crore in FY24 with IPL as its biggest money maker. Reuters/AFP The Indian Premier League (IPL) continues to be the biggest money-maker for the Board of Control for Cricket in India (BCCI). According to a report in The Hindu , which quoted Rediffusion , the IPL contributed more than 59 percent of BCCIs total revenue in FY24, proving once again why it is called the Boards cash cow. How much money BCCI made in FY24 In total, BCCI reportedly earned Rs. 9,741.7 crore (over $1 billion) in FY2324, out of which Rs 5,761 crore (over $580 million) came from the IPL alone. Apart from IPL, the Womens Premier League (WPL), international media rights, and sponsorship deals also added to the boards income. The report also mentioned that BCCI made Rs 361 crore from non-IPL media rights, like broadcasting Indias international matches. Apart from these, the Board has close to Rs 30,000 crore in reserves, earning nearly Rs 1,000 crore a year in interest alone. The board also gets Rs 1,000 crore from the ICC as annual revenue. STORY CONTINUES BELOW THIS AD Business strategist Lloyd Mathias said IPL is a perfect model for generating money and giving opportunities to players from the domestic level. BCCI in 2007 discovered a golden goose the IPL which is now a 100 per cent part of the BCCI. The tournament is the best and media rights are constantly going up. IPL also ensures that players from Ranji Trophy-levelget a playing field. IPL will continue to churn out profitability as it growth further, Mathias said. More from First Cricket Former New Zealand coach who defeated India in WTC final appointed Andhra Pradesh head coach for Ranji Trophy Sri Lanka crush Bangladesh by six wickets to record commanding win in Asia Cup 2025 Sandeep Goyal, Chief of Rediffusion, said that even tournaments like Ranji Trophy and Duleep Trophy can be commercialised to boost non-IPL income. He believes BCCIs overall revenue could grow 10 to 12 percent every year, thanks to sponsorships, media deals, a",
            "images": [],
            "rank": 5
          }
        ],
        "annotations": null
      }
    ]
  },
  "search_results_1A": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
            "content": "The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) - BreakingGlobe Skip to content Tuesday, December 23, 2025 Responsive Menu About Us Disclaimer Privacy Policy Contact Us BreakingGlobe Search Search News Sports Entertainment Technology Home 2025 April 10 The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) Sports The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) 10 April 2025 breakingglobe.com When the Indian Premier League (IPL) was launched in 2008 by the Board of Control for Cricket in India (BCCI), few could have imagined the financial juggernaut it would become. What began as a bold experiment in franchise-based T20 cricket has evolved into one of the most profitable sporting leagues in the worldrivaling the likes of the NFL, NBA, and Premier League in terms of viewership, brand value, and revenue generation. Over nearly two decades, IPL has seen exponential growth in terms of broadcasting rights, sponsorship deals, franchise valuations, and digital monetization. Heres a comprehensive, year-wise journey through the leagues financial transformation from 2008 to 2025. 20082012: Humble Beginnings and Early Success 2008 The Launch Gross Revenue: 645 crore Net Profit: 51 crore Title Sponsor: DLF (40 crore/year) Broadcaster: Sony-WSG (10-year deal worth $1.026 billion) The inaugural season was a blockbuster success. The IPL immediately captured public imagination, thanks to its glamorous appeal, franchise culture, and star-studded matches. The revenue modelcomprising broadcasting rights, sponsorships, ticket sales, and merchandiseset a robust foundation. 20092012 Building Consistency Despite challenges like the 2009 season moving to South Africa due to elections, revenues held steady. The league maintained strong ad sales and increased franchise participation. Brand IPL began to attract global attention, especially with international players taking part. 20132015: Transition and Turbulence 2013 New Sponsorship & Growth Title Sponsor: PepsiCo (79.4 crore/year) PepsiCo signed a five-year deal, showing the IPLs growing appeal. However, 2013 also marked the start of controversies around spot-fixing, leading to a temporary dent in credibility. 20142015 Split Season & Sponsor Exit Part of the 2014 season was hosted in the UAE, again due to Indian general elections. Despite this, viewership and revenues remained stable. Pepsi eventually exited the sponsorship deal in 2015, cutting it short due to the ongoing controversies. 20162017: Commercial Reboot and Media Rights Evolution 2016 Vivo Steps In Title Sponsor: Vivo (100 crore/year) Chinese brand Vivo signed on as the title sponsor, signifying IPLs resilience and commercial trust. The league was recovering well and growing in confidence. 2017 Media Rights on the Horizon This year set the stage for a major shake-up in the IPLs commercial ecosystem. With digital consumption on the rise, interest in media rights surged. 20182022: Billion-Dollar League 2018 Star India Era Begins Media Rights (20182022): 16,347 crore Average Annual Media Revenue: ~3,270 crore Title Sponsor: Vivo (renewed for 439.8 crore/year) Star India acquired broadcasting rights, including TV and digital, for five years. This was a landmark moment, catapulting IPL into the billion-dollar league club. 20192021 COVID and Resilience Despite the pandemic disruptions in 2020 and 2021, IPL displayed extraordinary resilience. The tournament was held in the UAE and India under strict protocols. Digital viewership soared, compensating for ticket sale losses. 2021 Brand Value: ~$4.7 billion Rise of fantasy platforms and OTT consumption added new revenue streams. 20232025: Dominance, Digital Expansion, and Record Revenue 2023 Media Rights Skyrocket Media Rights (20232027): 48,390 crore (~$6.2 billion) TV Rights (Star): 23,575 crore Digital Rights (Viacom18): 20,500 crore Per Match Value: 118 crore (~$14.5 million) With each IPL match now valued higher than even some NFL and Premier League g",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
            "content": "Indian Premier League - statistics & facts | Statista Skip to main content Statistics All Industries Go to All Industries Consumer Goods & FMCG Go to Consumer Goods & FMCG E-Commerce Go to E-Commerce Economy & Politics Go to Economy & Politics Energy & Environment Go to Energy & Environment Internet Go to Internet Technology & Telecommunications Go to Technology & Telecommunications Transportation & Logistics Go to Transportation & Logistics Travel, Tourism & Hospitality Go to Travel, Tourism & Hospitality Most viewed Statistics Recent Statistics Popular Statistics Most used social networks 2024, by number of users Big Mac index worldwide 2024 Global retail e-commerce sales 2014-2027 Car brand market share worldwide 2023 Quarterly Netflix subscribers count worldwide 2013-2024 Topics More Topics E-commerce worldwide - statistics & facts Social media - Statistics & Facts Top Report View Report Industry Overview Most viewed statistics Recent Statistics Popular Statistics Global sales of the top performance apparel, accessories, and footwear companies 2023 Nike's global revenue 2005-2024 Value of the secondhand apparel market worldwide from 2021 to 2028 Brand value of the most valuable soft drink brands worldwide 2023 Revenue of the leading 10 beauty manufacturers worldwide 2023 Topics Topic overview Global apparel market - statistics & facts Cosmetics industry - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics E-commerce as share of total retail sales worldwide 2021-2027 Biggest online retailers in the U.S. 2023, by market share Revenue of the e-commerce industry in the U.S. 2019-2029 Fastest-growing retail e-commerce countries 2023 Retail e-commerce sales growth worldwide 2017-2027 Topics Topic overview Amazon - statistics & facts E-commerce in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Biggest companies in the world by market value 2023 Largest armies in the world by active military personnel 2024 U.S. border patrol apprehensions and expulsions FY 1990-2023 Gross domestic product (GDP) in India 2029 Countries with the highest military spending 2023 Topics Topic overview Inflation worldwide - statistics & facts Global GDP - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Global household electricity prices 2023, by select country Annual global emissions of carbon dioxide 1940-2023 Monthly electricity prices in selected EU countries 2020-2024 EU-ETS allowance prices in the European Union 2022-2024 Renewable energy capacity 2023 by country Topics Topic overview Global waste generation - statistics & facts Global climate change - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Worldwide digital population 2024 Average daily time spent on social media worldwide 2012-2024 Facebook: quarterly number of MAU (monthly active users) worldwide 2008-2023 Social media: global penetration rate 2024, by region Instagram accounts with the most followers worldwide 2024 Topics Topic overview TikTok - statistics & facts Social media usage in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Quarterly smartphone market share worldwide by vendor 2009-2023 Apple's revenue worldwide 2004-2023 Global IT spending forecast 2012-2024, by segment Semiconductor market revenue worldwide 1987-2025 Digital transformation spending worldwide 2017-2027 Topics Topic overview Artificial intelligence (AI) worldwide - statistics & facts Smartphones - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Annual car sales worldwide 2010-2023, with a forecast for 2024 Monthly container freight rate index worldwide 2023-2024 Automotive manufacturers' estimated market share in the U.S. 2023 Global air traff",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
            "content": "Crickets mammoth Indian Premier League Skip to main content World Business Legal Markets Breakingviews More The chart shows the valuation of the Indian Premier League in 2009 using squares. Each square represents $10 million. It rose to $3.3 billion in 2013. The chart shows the valuation of the Indian Premier League in 2009 and 2013 using squares. Each square represents $10 million. It crossed $5 billion in 2018. The chart shows the valuation of the Indian Premier League in 2009, 2013 and 2018 using squares. Each square represents $10 million. Its valuation more than doubled in six years and touched $12 billion in 2024. The chart shows the valuation of the Indian Premier League in 2009, 2013, 2018 and 2024 using squares. Each square represents $10 million. Graphics Crickets mammoth Indian Premier League By Sumanta Sen Published March 28, 202512:30 PM GMT+5:30 The months of April and May mean only one thing for Indias army of cricket fans: the Indian Premier League (IPL). Now in its 18th season, the IPL was crickets first franchise style league officially run by a cricket board. A franchise sports league is a tournament where teams are run like a business and can be privately owned. Leagues like soccers Premier League in England and basketballs National Basketball Association in the United States are domestic tournaments. Across all major sports played in the world, including soccer, American football, baseball and basketball, franchise-style leagues have long been almost as popular as international events. Not in cricket though. The sport is primarily played at international level among a handful of countries, most of them former colonies of Britain. The international governing body of cricket, the International Cricket Council (ICC), has 12 permanent members. It also has more than 90 associate member nations where the game is in various stages of development and popularity. While smaller than soccer, cricket is followed by over a billion people, the vast majority of them in south Asia. Fans in India account for more than 80% of crickets following globally. The graphic is a world map showing the full and associate members of the ICC. Full members are coloured in dark blue while associate members are coloured in light blue. With such massive popularity in India, it is not hard to understand that the sport is financially lucrative in the country. The Board of Control for Cricket in India (BCCI) wields the most influence in the sport. According to the ICCs revenue model agreed in 2023, the BCCI will take home nearly 40% of the ICCs annual net earnings from 2024 to 2027. All other boards receive a share less than 10%. The BCCIs earnings have also been substantially higher than its rivals. Its profit for the financial year ended March 2023, the latest year for which filings are available, was the highest at $160 million. In comparison, the South African cricket board recorded a profit of $45 million in the May 2023 to April 2024 period, a distant second. The graphic is a bar chart showing the latest available profits of various cricket boards. A report by the World Cricketers Association (WCA), an independent global players body in cricket, released on March 26, 2025called for an equitable revenue distribution system across cricket boards. Global crickets finances and distribution models are heavily imbalanced, self perpetuating, and do not effectively support global growth or competitive balance,\" it said. How it all started One of the reasons for the BCCIs riches is the IPL. Indias cricket board announced the Indian Premier League in 2007 around the time the inaugural edition of the Twenty20 (T20) Cricket World Cup was taking place. T20 was the newest format of the game, fast paced and played over three hours as opposed to the other two formats which take a whole day or five days. The first season was played in the Indian summer in 2008 over 44 days featuring eight Indian city-based franchises owned by some of the countrys riches",
            "images": [],
            "rank": 3
          },
          {
            "url": "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
            "content": "IPL revenue: IPL franchises' revenue more than double, BCCI surplus jumps to Rs 5,120 cr | IPL 2024 News - Business Standard Tuesday, December 16, 2025 | 07:43 PM IST  Home Cricket South Africa Tour of India Series Schedule Results E-Paper Decoded Opinion India News Latest News Home / Cricket / IPL / News / IPL franchises' revenue more than double, BCCI surplus jumps to Rs 5,120 cr IPL franchises' revenue more than double, BCCI surplus jumps to Rs 5,120 cr The 10 IPL teams collectively earned Rs 4,670 crore from the Board of Control for Cricket in India (BCCI) for IPL 2023, up from Rs 2,205 crore received from the central pool in IPL 2022 Photo: Sportzpics Abhijeet Kumar New Delhi 3 min read Last Updated : Sep 06 2024 | 5:47 PM IST Listen to This Article Indian Premier League (IPL) franchises saw their revenues more than double in the financial year ending in March 2024, driven by a notable rise in profitability, according to a report by The Economic Times. This boost was largely due to a larger portion of the league's central revenue pool received during IPL 2023. According to the BCCIs annual report for FY23, the 10 IPL teams collectively earned Rs 4,670 crore from the Board of Control for Cricket in India (BCCI) for IPL 2023, up from Rs 2,205 crore received from the central pool in IPL 2022. Increase in revenue in FY24 Also Read Digi Yatra service to be available now at nine more airports. Details Nepal lifts ban on social media app TikTok after 10 months of restrictions J-K polls: 50% phase one candidates crorepatis, PDP contender richest India may cut petrol, diesel prices as global oil prices reach 2024 lows J-K Assembly polls: Kashmiri Pandit woman enters race after three decade Reliance Industries-owned Mumbai Indians saw their revenue soar to Rs 737 crore in FY24, a significant increase from Rs 358 crore in FY23, according to their annual report. This made them the highest-earning team in the IPL. The franchise also turned around its financial performance, achieving a profit of Rs 109 crore in the last financial year, in contrast to a net loss of Rs 49 crore in FY23. Similarly, the Chennai Super Kings saw its revenue increase to Rs 676 crore last year, up from Rs 292 crore in FY23, as detailed in their recent annual report. The team saw its profits increase four times to Rs 229 crore. Royal Challengers Bangalore, owned by Diageo's United Spirits and featuring Virat Kohli, reported a net profit of Rs 222 crore for FY24, a turnaround from a net loss of Rs 12 crore the previous year. The team's revenue also surged to Rs 650 crore from Rs 247 crore. In its FY24 annual report, Sun TV Network, the owner of Sunrisers Hyderabad, reported a significant increase in income from its cricket franchises, rising to Rs 659.03 crore from Rs 276.01 crore in FY23. Additionally, the network, which also holds the SA20 franchise Sunrisers Eastern Cape, saw franchise fees soar to Rs 142 crore in FY24, up from Rs 64 crore the previous year. In FY24, RPSG Sports, which owns the Lucknow Super Giants, posted a net profit of Rs 59 crore, reversing the previous years net loss of Rs 243 crore. The company's revenue nearly tripled, reaching Rs 695 crore. The BCCI has also experienced a substantial boost in earnings, thanks to a historic five-year media rights deal with Disney Star and Viacom18 valued at Rs 48,390 crore, starting with the IPL 2023 season. In comparison, the previous media rights cycle, which concluded with IPL 2022, generated Rs 16,347 crore from Star India. BCCIs sponsorship revenue has similarly increased, with new agreements with Tata Sons, MyCircle11, RuPay, AngelOne, and Ceat, collectively worth Rs 4,000 crore. The board's surplus from IPL 2023 jumped to Rs 5,120 crore, up from Rs 2,367 crore the previous season, due to the new media rights arrangement. The franchise fees collected from the 10 IPL teams in 2023 amounted to Rs 2,117 crore, compared to Rs 1,730 crore in the previous season. More From This Section Coach Kumar Sa",
            "images": [],
            "rank": 4
          },
          {
            "url": "https://www.firstpost.com/firstcricket/bcci-ipl-revenue-fy24-earnings-report-13908185.html",
            "content": "How much money the BCCI earned in FY24, with IPL as its biggest cash cow Firstpost Home Video Shows Vantage Firstpost America Firstpost Africa First Sports World US News Explainers News India Opinion Cricket Tech Entertainment Sports Health Photostories Asia Cup 2025 Apple Incorporated Modi ji Justin Trudeau Trending Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Impact Shorts Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Events Raisina Dialogue Independence Day Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Trending: PM Modi in Manipur Charlie Kirk killer Sushila Karki IND vs PAK India-US ties New human organ Downton Abbey: The Grand Finale Movie Review How much money the BCCI earned in FY24, with IPL as its biggest cash cow Whatsapp Facebook Twitter Whatsapp Facebook Twitter Apple Incorporated Modi ji Justin Trudeau Trending Sections Home Live TV Videos Shows World India Explainers Opinion Sports Cricket Health Tech/Auto Entertainment Web Stories Business Impact Shorts Shows Vantage Firstpost America Firstpost Africa First Sports Fast and Factual Between The Lines Flashback Live TV Events Raisina Dialogue Independence Day Champions Trophy Delhi Elections 2025 Budget 2025 US Elections 2024 Firstpost Defence Summit Home First Cricket How much money the BCCI earned in FY24, with IPL as its biggest cash cow How much money the BCCI earned in FY24, with IPL as its biggest cash cow FirstCricket Staff July 18, 2025, 08:48:37 IST Whatsapp Facebook Twitter The IPL remains BCCIs biggest money maker, contributing over half of its annual earnings in FY24. Check out how much Indias richest sporting body made in the last financial year. The numbers will shock you. Advertisement Subscribe Join Us Add as a preferred source on Google Prefer Firstpost On Google The BCCI earned over Rs 9,000 crore in FY24 with IPL as its biggest money maker. Reuters/AFP The Indian Premier League (IPL) continues to be the biggest money-maker for the Board of Control for Cricket in India (BCCI). According to a report in The Hindu , which quoted Rediffusion , the IPL contributed more than 59 percent of BCCIs total revenue in FY24, proving once again why it is called the Boards cash cow. How much money BCCI made in FY24 In total, BCCI reportedly earned Rs. 9,741.7 crore (over $1 billion) in FY2324, out of which Rs 5,761 crore (over $580 million) came from the IPL alone. Apart from IPL, the Womens Premier League (WPL), international media rights, and sponsorship deals also added to the boards income. The report also mentioned that BCCI made Rs 361 crore from non-IPL media rights, like broadcasting Indias international matches. Apart from these, the Board has close to Rs 30,000 crore in reserves, earning nearly Rs 1,000 crore a year in interest alone. The board also gets Rs 1,000 crore from the ICC as annual revenue. STORY CONTINUES BELOW THIS AD Business strategist Lloyd Mathias said IPL is a perfect model for generating money and giving opportunities to players from the domestic level. BCCI in 2007 discovered a golden goose the IPL which is now a 100 per cent part of the BCCI. The tournament is the best and media rights are constantly going up. IPL also ensures that players from Ranji Trophy-levelget a playing field. IPL will continue to churn out profitability as it growth further, Mathias said. More from First Cricket Former New Zealand coach who defeated India in WTC final appointed Andhra Pradesh head coach for Ranji Trophy Sri Lanka crush Bangladesh by six wickets to record commanding win in Asia Cup 2025 Sandeep Goyal, Chief of Rediffusion, said that even tournaments like Ranji Trophy and Duleep Trophy can be commercialised to boost non-IPL income. He believes BCCIs overall revenue could grow 10 to 12 percent every year, thanks to sponsorships, media deals, a",
            "images": [],
            "rank": 5
          }
        ],
        "annotations": null
      }
    ]
  },
  "average_ipl_annual_revenue_T003": "393.07 Crore"
}