{
  "dhurandhar_box_office_search_results_T001": "{\n  \"content\": [\n    {\n      \"type\": \"text\",\n      \"text\": \"[{'url': 'https://indianexpress.com/article/entertainment/bollywood/dhurandhar-box-office-collection-worldwide-day-17-update-10431890/', 'content': 'Dhurandhar Box Office Collection Day 17: Ranveer Singh film crosses Rs 800 crore mark, to become no 1 earner in India skip to content Skip To Content by Subscribe Sign In Bollywood Hollywood Videos Television Tamil Telugu Malayalam Regional Web series Movie Review Advertisement News Entertainment Bollywood Dhurandhar Box Office Collection Worldwide Day 17: Ranveer Singh film earns over Rs 565 cr in India; eyes Rs 900 cr club globally Dhurandhar Box Office Collection Worldwide Day 17: Ranveer Singh film earns over Rs 565 cr in India; eyes Rs 900 cr club globally Dhurandhar Box Office Collection Day 17: On the global front, Dhurandhar has crossed the Rs 800 crore mark worldwide and is just a few crores away from surpassing the lifetime collection of Kantara: The Legend Chapter 1. Whatsapp twitter Facebook Reddit By: Entertainment Desk Updated: December 23, 2025 06:39 AM IST Dhurandhar Box Office Collection Worldwide Day 17 Update: Ranveer Singh film earns Rs 870 plus crore globally. Dhurandhar Box Office Collection Worldwide Day 17: Dhurandhar continues to dominate the box office with no signs of slowing down. After earning a whopping Rs 34.25 crore in India on its third Saturday, the Ranveer Singh-starrer followed it up with an impressive Rs 38.5 crore on Sunday, pushing its total India collection to Rs 555.75 crore. On the global front, the Aditya Dhar directorial has now crossed the Rs 800 crore mark worldwide and is just a few crores away from surpassing the lifetime collection of Kantara: The Legend Chapter 1, positioning itself to become the highest-grossing Indian film of the year. Kantara 2 earned Rs 852.27 crore globally. Story continues below this ad Also Read: Aditya Dhar says Dhurandhar could run because RGV walked first; Satya director says he took risks out of ignorance The Aditya Dhar directorial has also achieved another major milestone by overtaking the lifetime worldwide collection of Vicky Kaushals period drama Chhaava, which also starred Akshaye Khanna and Rashmika Mandanna. Released on Valentines Day, Chhaava had wrapped up its global run at Rs 807.91 crore. On Sunday, Dhurandhar recorded an impressive overall occupancy of 61.89% across 5,332 shows, underlining its sustained audience pull. If the current pace continues, Dhurandhar is well on track to cross the Rs 1,000 crore mark worldwidea first in Ranveer Singhs 15-year career. Even his critically acclaimed blockbusters Bajirao Mastani and Padmaavat had concluded their runs at approximately Rs 357 crore and Rs 585 crore, respectively. Also Read: Dhurandhar: Real-life Uzair Baloch inherited Rehman Dakaits gang after his encounter; played football with gangster Arshad Pappus severed head Originally, Dhurandhar was expected to face competition from Ikkis, directed by Sriram Raghavan and starring Agastya Nanda, Jaideep Ahlawat and Dharmendra. However, the makers of Ikkis pushed its release from Christmas to January 1, clearing the path further for Dhurandhar. The film, however, might face competition from Tu Meri Main Tera Main Tera Tu Meri, starring Kartik Aaryan and Ananya Panday in the lead roles. Live Updates Dec 22, 2025 08:39 PM IST Dhurandhar Fan Reaction: Ranveer Singh \\\\'is unmatched as an actor in the current generation\\\\' User @_Opinionated_A7 shared on X, \\\"Dhurandhar shows the power Ranveer Singh the actor holds on the audience. You can feel his pain in every moment. The eyes, voice modulation, body language, expression.. He is unmatched as an actor in the current generation.\\\" Dec 22, 2025 08:13 PM IST Dhurandhar Box Office Collection: Ranveer Singh-starrer crosses Rs 565 cr mark in India According to trade tracker Sacnilk, Ranveer Singh-starrer Dhurandhar has earned Rs 10.32 crore as of 8 pm on Monday. The Aditya Dhar films total domestic collection now stands at Rs 566.07 crore. Dec 22, 2025 07:31 PM IST Dhurandhar Box Office Collection: Ranveer Singh-starrer set to cross Rs 10 cr mark on Monday According to trade tracker Sacnilk, Ranveer Singh-sta', 'images': [], 'rank': 1}, {'url': 'https://www.bollywoodhungama.com/movie/dhurandhar/box-office/', 'content': 'Dhurandhar Box Office Collection | India | Day Wise | Box Office - Bollywood Hungama Skip to content Bollywood Entertainment at its best SEARCH LANGUAGE FOLLOW US ON FEEDBACK X News Bollywood News Bollywood Features News Slideshows South Cinema International Television OTT / Web Series Fashion & Lifestyle K-Pop Movies New Latest Movies Upcoming Releases Movie Release Dates Top 100 Movies Movie Reviews Celebs Top 100 Celebs Digital Celebs Photos Parties and Events Celeb Photos Celeb Wallpapers Movie Stills First Look Movie Wallpapers Toons Music Song Lyrics Music Reviews Videos Trailers Celeb Interviews OTT Short Videos First Day First Show Parties & Events Television Exclusive & Specials Movie Songs Box Office Box Office Collection Analysis & Features All Time Top Grossers Overseas Box Office 100 Crore club 200 Crore club Top Male Celebs Top Female Celebs Trending Wake Up Dead Man: A Knives Out Mystery (English) Movie Review Kis Kisko Pyaar Karoon 2 Movie Review Dhurandhar Movie Review Tere Ishk Mein Movie Review Mastiii 4 Movie Review OTT India Fest 25 Bollywood Entertainment at its best feedback language follow us on Bollywood Hungama Movies Dhurandhar Dhurandhar Movie Box Office Collection Aditya Dhar Rate it Add to Favorites Dhurandhar Release date: 05 December, 2025 Timeline Cast & Crew Videos Photos Music Review News Box Office Dhurandhar Box Office All amounts in their respective local currencies INDIA BOX OFFICE COLLECTION Schedule Amount Opening Day 28.60 cr. End of Opening Weekend 106.50 cr. End of Week 1 218 cr. End of Week 2 479.50 cr. Lifetime Collection 598.90 cr. DAY WISE BOX OFFICE COLLECTION Day Date Amount % Day 1 05-Dec-2025 (Fri) 28.60 cr. N/A Day 2 06-Dec-2025 (Sat) 33.10 cr. +15.73% Day 3 07-Dec-2025 (Sun) 44.80 cr. +35.35% Day 4 08-Dec-2025 (Mon) 24.30 cr. -45.76% Day 5 09-Dec-2025 (Tue) 28.60 cr. +17.70% Day 6 10-Dec-2025 (Wed) 29.20 cr. +2.10% Day 7 11-Dec-2025 (Thu) 29.40 cr. +0.68% Day 8 12-Dec-2025 (Fri) 34.70 cr. +18.03% Day 9 13-Dec-2025 (Sat) 53.70 cr. +54.76% Day 10 14-Dec-2025 (Sun) 58.20 cr. +8.38% Day 11 15-Dec-2025 (Mon) 31.80 cr. -45.36% Day 12 16-Dec-2025 (Tue) 32.10 cr. +0.94% Day 13 17-Dec-2025 (Wed) 25.70 cr. -19.94% Day 14 18-Dec-2025 (Thu) 25.30 cr. -1.56% Day 15 19-Dec-2025 (Fri) 23.70 cr. -6.32% Day 16 20-Dec-2025 (Sat) 35.70 cr. +50.63% Day 17 21-Dec-2025 (Sun) 40.30 cr. +12.89% Day 18 22-Dec-2025 (Mon) 19.70 cr. -51.12% WEEK WISE BOX OFFICE COLLECTION Day Amount % Week 1 218.00 cr. N/A Week 2 261.50 cr. +19.95% WEEKEND BOX OFFICE COLLECTION Day Amount % Weekend1 106.5 cr. N/A Weekend2 146.6 cr. +37.65% Weekend3 99.7 cr. -31.99% TERRITORY WISE BOX OFFICE COLLECTION Day Amount Mumbai 140.70 cr. View Delhi-U.P 99.00 cr. View East Punjab 51.70 cr. View CP 24.31 cr. View CI 20.35 cr. View Rajasthan 27.17 cr. View Nizam-AP 33.55 cr. View Mysore 24.97 cr. View West Bengal 22.00 cr. View Bihar & Jharkhand 16.50 cr. View Assam 6.60 cr. View Orissa 7.15 cr. View Tamil Nadu & Kerala 5.50 cr. View X CINEMA CHAIN BOX OFFICE COLLECTION Cinema Amount PVR 103.17 cr. View INOX 74.70 cr. View Cinepolis 44.40 cr. View Movie Time 5.63 cr. View Wave 5.72 cr. Miraj 17.94 cr. Rajhans 7.18 cr. Mukta 4.07 cr. Gold Digital 2.66 cr. SVF 2.03 cr. Maxus 2.26 cr. Fortune 0.19 cr. Priya 1.38 cr. City Pride 6.20 cr. M2K 0.94 cr. SRS 0.46 cr. Movie Max 11.65 cr. X OVERSEAS BOX OFFICE COLLECTION Schedule Amount (in mil. USD) Opening Weekend 3.83 Day 1 0.80 Day 2 1.403 Day 3 1.627 Day 4 0.89 Day 5 0.96 Day 6 1.01 Day 7 1.11 Day 8 1.41 Day 9 2.118 Day 10 2.30 Day 11 0.91 Day 12 1.05 Day 13 0.80 Day 14 0.65 Day 15 1.05 Day 16 1.5 Day 17 1.2 Total Overseas Gross 20.90 WORLDWIDE GROSS BOX OFFICE COLLECTION Schedule Amount India box office Nett cr. 598.90 cr. India box office Gross cr. 712.98 cr. Overseas Gross cr. 188.02 cr. Worldwide collections Gross cr. 901 cr. AUSTRALIA BOX OFFICE COLLECTION Date Rank Weekend Amount (in A$) Screens Total Gross (in A$) 19-Dec-2025 5 726,322 78 3,766,727 12-Dec-2025 4 1,247,742 7', 'images': [], 'rank': 2}, {'url': 'https://boxofficeindex.in/dhurandhar-box-office-collection-worldwide-budget-verdict-hit-or-flop/', 'content': 'Dhurandhar Box Office Collection Worldwide Budget Verdict (Hit or Flop) - Box Office Index Skip to content Home Box Office OTT Amazon Prime Video News Movies English English Search for: Search Search Search for: Search Search English English Home Box Office OTT Amazon Prime Video News Movies English English Home Box Office Dhurandhar | Box Office Collection Worldwide | Budget | Verdict (Hit or Flop) By Team BOI | December 19, 2025 Here is Dhurandhars box office collection worldwide total day-wise. Dhurandhar is a Hindi language film directed by Aditya Dhar and [] Here is Dhurandhars box office collection worldwide total day-wise. Dhurandhar is a Hindi language film directed by Aditya Dhar and produced by Lokesh Dhar, Aditya Dhar, and Jyoti Deshpande under the banner of B62 Studios, Jio Studios. The film stars Ranveer Singh, Sanjay Dutt, Akshaye Khanna, R. Madhavan, Arjun Rampal, Sara Arjun, in the key roles. Dhurandhar Box Office Collection (India Net) Day Wise All Languages Day India Net Collection Change (+/-) Day 1 [1st Friday] 28 Cr Day 2 [1st Saturday] 32 Cr 14.29% Day 3 [1st Sunday] 43 Cr 34.38% Day 4 [1st Monday] 23.25 Cr -45.93% Day 5 [1st Tuesday] 27 Cr 16.13% Day 6 [1st Wednesday] 27.00 Cr 0.00% Day 7 [1st Thursday] 27.00 Cr 0.00% Week 1 Collection 207.25 Cr Day 8 [2nd Friday] 32.50 Cr 20.07% Day 9 [2nd Saturday] 53.00 Cr 63.08% Day 10 [2nd Sunday] 58.00 Cr 9.43% Day 11 [2nd Monday] 30.50 Cr -47.41% Day 12 [2nd Tuesday] 30.50 Cr -0.00% Day 13 [2nd Wednesday] 25.50 Cr -16.39% Day 14 [2nd Thursday] 23.25 Cr -8.82% Week 2 Collection 253.25 Cr 22.20% Day 15 [3rd Friday] 20.17 Cr * early estimates Total 480.67 Cr Dhurandhar Box Office Collection Worldwide Total Worldwide India Net India Gross Overseas 737.5 Cr 483 Cr 579.5 Cr 158 Cr Dhurandhar Box Office Collection Worldwide Day Wise Day Worldwide India Net India Gross Overseas Day 1 [1st Fri]  Cr  Cr  Cr  Cr Total  Cr  Cr  Cr  Cr Dhurandhar Budget, Box Office, Verdict (Hit or Flop) Budget: est 140 Cr Also Read: Dhurandhar Box Office Collection Day 13 Worldwide Total Verdict: Coming Soon Box Office: 710.50 Cr (14 days) Dhurandhar Screen count India: * expected Overseas: * expected Worldwide total: About This Film Title: Dhurandhar Director: Aditya Dhar Screenplay: Aditya Dhar Producer: Lokesh Dhar, Aditya Dhar, Jyoti Deshpande Cast: Ranveer Singh, Sanjay Dutt, Akshaye Khanna, R. Madhavan, Arjun Rampal, Sara Arjun, Rakesh Bedi, Naveen Kaushik, Manav Gohil, Danish Pandor, Mashhoor Amrohi, Jaroslav Shvets, Vikash Rai, Gaurav Gera, Mir Salman, Shrysh Zutshi, Vinod Tharani, Rouhallah Gazi, Saumya Tandon, Krystle DSouza Also Read: The Devil Box Office Collection Day 10 Worldwide Dialogue: Cinematography: Vikash Nowlakha Editor: Shivkumar V. Panicker Music: Shashwat Sachdev Production: B62 Studios, Jio Studios Distributed: Jio Studios Release date: 05 Dec 2025 Running time : 3h 34m Country: India Language : Hindi Share this post: Share on X (Twitter) Share on Facebook Share on Pinterest Share on LinkedIn Share on Email Share on WhatsApp Previous Akhanda 2: Thaandavam Box Office Collection Day 1 Prediction:Set for Record-Breaking 50 Crore Opening Day Prediction Next Kalamkaval | Box Office Collection Worldwide | Budget | Verdict (Hit or Flop) Related Posts Tere Ishk Mein Box Office Collection Day 23 Worldwide (Hit or Flop) Kis Kisko Pyaar Karoon 2 Box Office Collection Day 9 The Devil Box Office Collection Day 10 Worldwide Kalamkaval Box Office Collection Day 16 Worldwide Bha. Bha. Ba. Box Office Collection Day 3 Akhanda 2 Box Office Collection Day 9Worldwide Search Search Home About Us Contact Us Disclaimer Privacy Policy Terms and Conditions Feed Copyright 2025 Box Office Index Scroll to Top', 'images': [], 'rank': 3}, {'url': 'https://www.sacnilk.com/news/Dhurandhar_2025_Box_Office_Collection_Day_Wise_Worldwide', 'content': \\\"Dhurandhar Box Office Collection | All Language | Day Wise | Worldwide - Sacnilk Sacnilk Special News Daily All India Gross Data [Only For Subscribed Users] All India Gross Live Data [Only For Subscribed Users] Tu Meri Main Tera Main Tera Tu Meri First Day Advance Booking Report Dhurandhar Overseas Box Office: Ranveer Singh-fronted Becomes Highest Indian Grosser of 2025, Beating Rajinikanth's Coolie Dhurandhar Box Office: Aditya Dhar's Directorial Becomes The Highest-Grossing Indian Film of 2025 Worldwide Dhurandhar becomes the First Indian Film to Feature Thrice in Global Top 5 Charts Avatar Fire and Ash Box Office: James Cameron's Film Debuts With $345 Million Worldwide Dhurandhar Box Office: Ranveer Singh-starrer Records Near 100 Crore Third Weekend Ajay Devgn Officially Announces Drishyam 3 With Release Date OTT Release This Week Dec 22 to Dec 28: From Ek Deewane Ki Deewaniyat to Revolver Rita, 10 Must Watch Christmas Movies. Box Office Links Box Office Collection Bollywood Box Office 2024 Tollywood Box Office 2024 Kollywood Box Office 2024 Mollywood Box Office 2024 Sandalwood Box Office 2024 Hollywood Box Office 2024 Gollywood Box Office 2024 Pollywood Box Office 2024 Bengali Box Office 2024 Marathi Box Office 2024 Articles Entertainment Box Office Dhurandhar Box Office Collection | All Language | Day Wise | Worldwide Views: 387795 | 23 Dec 2025 11:04:18 am IST | By Sacnilk Team Join Us on Google News Here is the Hindi movie Dhurandhar box office collection, which is a spy action thriller film. This film is directed by Aditya Dhar and produced by Jio Studios and B62 Studios. Dhurandhar stars Ranveer Singh , Sanjay Dutt , Akshaye Khanna , R. Madhavan , Arjun Rampal , and Sara Arjun in key roles. Dhurandhar Review - Coming Soon! Dhurandhar Box Office Collection Day Wise | All Language [ See Footfalls ] Day India Net Collection Change(+/-) Day 1 [1st Friday] 28 Cr - Day 2 [1st Saturday] 32 Cr 14.29% Day 3 [1st Sunday] 43 Cr 34.38% Day 4 [1st Monday] 23.25 Cr -45.93% Day 5 [1st Tuesday] 27 Cr 16.13% Day 6 [1st Wednesday] 27 Cr 0.00% Day 7 [1st Thursday] 27 Cr 0.00% Week 1 Collection 207.25 Cr - Day 8 [2nd Friday] 32.5 Cr 20.37% Day 9 [2nd Saturday] 53 Cr 63.08% Day 10 [2nd Sunday] 58 Cr 9.43% Day 11 [2nd Monday] 30.5 Cr -47.41% Day 12 [2nd Tuesday] 30.5 Cr 0.00% Day 13 [2nd Wednesday] 25.5 Cr -16.39% Day 14 [2nd Thursday] 23.25 Cr -8.82% Week 2 Collection 253.25 Cr 22.20% Day 15 [3rd Friday] 22.5 Cr -3.23% Day 16 [3rd Saturday] 34.25 Cr 52.22% Day 17 [3rd Sunday] 38.5 Cr 12.41% Day 18 [3rd Monday] 16.5 Cr -57.14% Total 572.25 Cr (estimated) - Take Subscription To See Footfalls India Net Collection 572.25 Cr Worldwide Collection 876.5 Cr Overseas Collection 190 Cr India Gross Collection 686.5 Cr Dhurandhar Budget: - Cr * Approx Dhurandhar Verdict: Coming Soon Dhurandhar Screen count India: - Overseas: - Worldwide total: - Release Date: 5th December 2025 For more and the latest news about Bollywood Box Office Collection , Stay tuned to us. Disclaimer: The Box Office Data are compiled from various sources and by our own research.\\\\r \\\\t These data can be approximate or may have huge difference from producer figure and Sacnilk does not make any claims about the authenticity of the data. Tags Bollywood Hindi Dhurandhar Box Office Box Office 2025 Day Wise Collection Worldwide Collection Ranveer Singh Sanjay Dutt Akshaye Khanna R. Madhavan Arjun Rampal Sara Arjun Comments Nothing too say about -> Shikha 18 Dec 2025 03:24:38 pm IST Can you please update your template it's getting very old make a new fresh Template and make some code of work to make your site more Authentic -> Mayank 14 Dec 2025 10:00:10 am IST Write Your Comment Here Max comment length: 100 words; Please don't use bad language otherwise your comment will be removed Related News Bollywood Dhurandhar Box Office: Ranveer Singh-Starrer Creates History With Biggest Second... Bollywood Dhurandhar Box Office (Worldwide): Aditya Dhar's Spy Actioner S\\\", 'images': [], 'rank': 4}, {'url': 'https://gulfnews.com/entertainment/dhurandhar-box-office-update-film-crosses-rs8-billion-worldwide-1.500387215', 'content': \\\"Box Office Triumph: Dhurandhar Surpasses Rs 8 Billion Globally DUBAI 21C GOLD/FOREX PRAYER TIMES NEWSLETTERS LOGIN GOLD/FOREX DUBAI 21C PRAYER TIMES ENTERTAINMENT ENTERTAINMENT HOLLYWOOD BOLLYWOOD SOUTH INDIAN MUSIC OTT Dhurandhar Box Office update: Film crosses Rs8 billion worldwide The films steady third-week performance highlights sustained audience interest Last updated: December 22, 2025 | 12:02 Areeba Hashmi , Special to Gulf News 2 MIN READ Dhurandhar movie poster Instagram@officialjiostudios Dubai: Ranveer Singh 's Dhurandhar continues its strong theatrical run, now entering its third week in cinemas. According to Indian Express, the film has crossed the Rs 8 billion mark worldwide and is approaching the lifetime collection of Kantara: The Legend Chapter 1. Day 17 performance On its third Saturday, Dhurandhar earned Rs 342.5 million in India, followed by Rs 385 million on Sunday. This brought the film's total India collection to Rs 5.575 billion. On Sunday, the film recorded an overall occupancy of 61.89 per cent across 5,332 shows. Global milestones Globally, the Aditya Dhar directorial has now crossed Rs 8 billion and is positioned to potentially surpass Kantara 2, which earned Rs 8.5227 billion worldwide, making it a contender for the highest-grossing Indian film of the year. The film has also overtaken the lifetime worldwide collection of Vicky Kaushal's Chhaava, which wrapped up its global run at Rs 8.07 billion after its Valentine's Day release. Also Read: Dhurandhar is unapologetically raw and brutal, say first reviews: 'Ranveer Singh is fantastic as usual' Tracking towards Rs 10 billion If the current pace continues, Dhurandhar could cross the Rs 10 billion mark worldwide, which would be a first in Ranveer Singh's 15-year career. His previous films Bajirao Mastani and Padmaavat concluded their runs at approximately Rs 3.57 billion and Rs 5.85 billion respectively. Competition landscape Originally, Dhurandhar was expected to face competition from Ikkis, directed by Sriram Raghavan and starring Agastya Nanda, Jaideep Ahlawat and Dharmendra. However, the makers of Ikkis pushed its release from Christmas to January 1. The film may face new competition from Tu Meri Main Tera Main Tera Tu Meri, starring Kartik Aaryan and Ananya Panday, which is scheduled for release during the holiday period. What the numbers mean The sustained box office performance indicates strong audience retention beyond opening weekend, typically a key indicator of a film's commercial viability. How long this momentum continues will depend on word-of-mouth, competition from new releases, and whether the film can maintain its current occupancy rates heading into the new year. Also In This Package Where was Dhurandhar's Lyari scenes shot? How Arabic rapper Flipperachi went viral in India Dhurandhar at Rs 5 billion, Akshaye Khanna still a star Ranveer Singhs shoot stalled due to food poisoning Sign up for the Daily Briefing Get the latest news and updates straight to your inbox SIGN UP Up Next Related Stories Dhurandhar races towards Rs 10 billion worldwide 2 m read Dhurandhar becomes years second biggest Hindi hit 2 m read Dhurandhar crosses Rs 5 billion worldwide 2 m read Police complaint against Dhurandhar star Ranveer Singh 2 m read Go back to top Network links: GN Store About Gulf News Terms & Conditions Reach by GN Sitemap Contact us Privacy Policy GN Focus Have your say Work with us Advertise with us Gulf News epaper Printing Services Find us on social Download our app Al Nisr Publishing LLC 2025. All rights reserved.\\\", 'images': [], 'rank': 5}]\",\n      \"annotations\": null\n    }\n  ]\n}"
}