{
  "trump_oil_duty_info_T001": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://www.moneycontrol.com/news/india/explained-what-trump-s-approval-of-bill-imposing-500-tariffs-means-for-india-china-13763363.html",
            "content": "Explained: What Trumps approval of bill imposing 500% tariffs means for India, China Get App Open In App Enjoy seamless experience on APP 10x faster & More Feature Get App Go PRO Now Open App Search Quotes, News, Mutual Fund NAVs Quotes Mutual Funds Commodities Futures & Options Currency News Topic Cryptocurrency Forum Notices Videos Glossary All Auri ferous Aqua Farma, 519363 Get App / Open App Home PRO Markets News Budget 2026 Editors Picks Tech India Learning Curve Portfolio Watchlist Commodities MF PF Forum Videos Invest Now Invest in Cryptoassets Powered by Invest in Unlisted stocks Powered by Home News India Explained: What Trumps approval of bill imposing 500% tariffs means for India, China Trending Topics Shashi Tharoor Pratik Jain Jyotiraditya Scindia Mamata Banerjee Omar Abdullah Sonam Wangchuk Explained: What Trumps approval of bill imposing 500% tariffs means for India, China The bill proposes sanctions on financial institutions engaged in dealings with Russian entities and heavy tariffs for purchase of Moscow's oil and uranium Curated by : Arindam Roy January 08, 2026 / 13:44 IST Story continues below Advertisement Remove Ad The bill could further isolate Russia and strengthen enforcement mechanisms that limit Moscows access to advanced technologies such as AI and semiconductors. Trump okays bill to impose up to 500% tariffs on nations buying Russian oil India's Russian oil imports may drop further amid US tariff threats Bill could strain US-India ties and impact China, Brazil, and other buyers Did our AI summary help? US President Donald Trump has okayed a bipartisan bill that can further add to Indias tariff troubles. The bill, if passed, could impose up to 500 percent tariff on countries maintaining trade ties with Russia and purchasing its petroleum products. US Senator Lindsey Graham, the sponsor of the Sanctioning Russia Act of 2025, said the bill seeks to punish those nations who are buying cheap Russian oil. This could directly affect New Delhis energy imports and further sour the relationship with Washington. Story continues below Advertisement Remove Ad What the bill says The bill was introduced by Graham on January 4 this year and is backed by several lawmakers, including Senator Richard Blumenthal. The bill proposes penalties on individuals and entities associated with the Russian government or acting at Moscows behest if they refuse to negotiate a peace deal with Ukraine or violate any agreement. The punitive measures can also be imposed if the said person or entity is involved in another invasion of Ukraine or overthrow of the Ukrainian government. Story continues below Advertisement Remove Ad Related Stories OPINION | The conflict between the carbon offset mechanism and green credit programme OPINION | China hooks up with Pakistan to challenge Indias primacy in South Asia 500% US tariff on India? Gokaldas Exports, Avanti Feeds, other export-oriented shares tumble up to 13% If US President makes such conclusion, then the bill mandates the imposition of visa and property-blocking sanctions and must increase of duties on all goods being imported from Russia to the US to at least 500 percent. The bill also requires the US President to hike tariffs to at least 500 percent on all countries engaged in exchange of Russian-origin uranium and petroleum products. In addition, the bill proposes sanctions on any financial institutions engaged in transaction with Russian entities, apart from the Russian institutions themselves. The bill also requires ban on exports of US energy products to Russia. Story continues below Advertisement Remove Ad How will the bill affect Russia and its trading partners, including India and China? The bill could further isolate Russia and strengthen enforcement mechanisms that limit Moscows access to advanced technologies such as AI and semiconductors. However, the bill could also mean trouble for India, China and several other countries engaged in trade with Russia. India emerged as",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://www.business-standard.com/economy/news/trump-500-percent-tariff-india-sanctioning-russia-act-2025-crude-oil-import-126010800277_1.html",
            "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/economy/news/trump-500-percent-tariff-india-sanctioning-russia-act-2025-crude-oil-import-126010800277_1.html\" on this server. Reference #18.d4d70b17.1767956966.42415699 https://errors.edgesuite.net/18.d4d70b17.1767956966.42415699",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://timesofindia.indiatimes.com/business/india-business/500-tariffs-ahead-for-india-china-trump-clears-russia-sanctions-bill-what-it-means/articleshow/126405011.cms",
            "content": "500% tariffs ahead for India & China? Trump clears Russia sanctions bill; what it means - The Times of India Read ePaper Sign In News TOI Games Live Videos World India City Life & Style Entertainment Business Tech Cricket Sports TV Web Series Education Speaking Tree Voice Of Conscience TOI Newsletters Trending Gold price prediction Top stocks today Gratuity calculation US mortgage rate Trump tariffs Stock market today Budget 2026 500% tariffs ahead for India & China? Trump clears Russia sanctions bill; what it means TOI Business Desk / TIMESOFINDIA.COM / Updated: Jan 09, 2026, 12:04 IST US President Donald Trump has approved a new bill that allows massive duties on countries that import Russian petroleum products. The bill, 'Sanctioning Russia Act of 2025' threatens at least 500% tariffs on countries that \"knowingly engage in the exchange. Tired of too many ads? go ad free now \" US senator Lindsey Graham said that the bill, which is now headed for bipartisan approval aims to punish nations who buy cheap Russian oil, a move that could directly impact Indias energy imports and further strain its trade ties with Washington. The proposed legislation sets out sweeping punitive measures that would be triggered if the US President finds that Russian government or a person acting at Russia's direction refuses to negotiate a peace agreement with Ukraine. The measures will also be revoked in case a negotiated peace agreement is violated, another invasion of Ukraine or involved with overthrowing is initiated, dismantling, or seeking to subvert the Ukrainian government. Trump Clears Russia Sanctions Bill, 500% Tariff Threat Looms As India Reworks Oil Import Strategy The bill states that Trump \"must increase the rate of duty on all goods and services imported into the United States from countries that knowingly engage in the exchange of Russian-origin uranium and petroleum products to at least 500% relative to the value of such goods and services.\" Also read: Donald Trump claims PM Modi not that happy with steep tariffs, flags delays in Apache helicopter delivery In his post on X, Graham said, \"After a very productive meeting today with President Trump on a variety of issues, he greenlit the bipartisan Russia sanctions bill that I have been working on for months with Senator Blumenthal and many others.\" Explaining the crucial timing of the bill, the executive further added, \"Ukraine is making concessions for peace and Putin is all talk, continuing to kill the innocent.\" \"This bill will allow President Trump to punish those countries who buy cheap Russian oil fueling Putins war machine. Tired of too many ads? go ad free now This bill would give President Trump tremendous leverage against countries like China, India and Brazil to incentivize them to stop buying the cheap Russian oil that provides the financing for Putins bloodbath against Ukraine.\" Earlier this week, Graham said that India was urging Washington to roll back steep tariffs imposed in August 2025, over the same issue. Graham claimed that Indias ambassador to the US, Vinay Mohan Kwatra, met him last month to highlight New Delhis reduced purchases of Russian oil and to seek relief from the additional 25% duties. India and US have been working on a trade deal since months but no agreement has been sealed as of now, with the issue of Russian oil and dairy products being the major trade flashpoints. The latest trade meeting was held from December 10 to December 12, when US officials arrived in India. Speaking to reporters aboard Air Force One alongside Trump, the senator said, I was at the Indian Ambassador's house a month ago, and all he wanted to talk about was how India is buying less Russian oil. And he asked me to tell the President to relieve the 25% tariff. The tariffs were imposed in August, with the US arguing that Indias energy trade with Russia was indirectly supporting Moscows war effort in Ukraine. With the extra levy, total duties on certain Indian goods rose to 50%. T",
            "images": [],
            "rank": 3
          },
          {
            "url": "https://www.ndtv.com/world-news/us-president-trump-backs-russian-sanctions-bill-threatening-500-tariff-on-india-for-russian-oil-10507365",
            "content": "Access Denied Access Denied You don't have permission to access \"http://www.ndtv.com/world-news/us-president-trump-backs-russian-sanctions-bill-threatening-500-tariff-on-india-for-russian-oil-10507365\" on this server. Reference #18.1f2a336a.1767956967.37d2a79e https://errors.edgesuite.net/18.1f2a336a.1767956967.37d2a79e",
            "images": [],
            "rank": 4
          },
          {
            "url": "https://www.cnbctv18.com/world/russian-oil-sanctions-bill-trump-allows-bipartisan-push-to-penalise-buying-countries-ws-l-19816561.htm",
            "content": "Bill threatening 500% tariff on India, China and others for buying Russian oil gets Trump's nod - CNBC TV18 Join Us Log in / Sign up Become a Member Language English Latest news Live Updates Markets Business Personal Finance Impact Shorts Economy India World Upcoming Events Engage with CNBC-TV18 Photos Videos Minis Web Stories Polls Quiz Healthcare Politics Travel Education & Careers Sports Views Auto Entertainment Technology Startups Lifestyle Retail Real Estate Minis Special Coverage India Business Leader Awards Branded Content HealthX Elevate India Retirement Insights Summit The Growth Summit Ceo awards Accelerate Your Cloud Journey Accelerating to a Connected Future Financial Services Cloud Symposium Crypto Education Next Ey Entrepreneur Of The Year IRMA Wizards of finance The Thought League Discover CNBCTV18 About Contact Advertise Disclaimer Terms of Use Privacy Policy Shows Anchors Polls 11:11 Newsletter Life Advertise with us Watch Live TV New Budget #MFCorner Latest News #MarketKaSachWithFundsIndiaResearch New #HealthXElevate #NavigateWithHSBC #NiveshKaSahiKadam Nifty Sensex MCX Home World News Bill threatening 500% tariff on India, China and others for buying Russian oil gets Trump's nod Bill threatening 500% tariff on India, China and others for buying Russian oil gets Trump's nod Lindsey Graham announced Donald Trump supports the Sanctioning of Russia Act 2025, targeting countries like China, India, and Brazil for buying Russian oil amid the Ukraine war. By CNBCTV18.com January 8, 2026, 12:02:31 PM IST (Updated) 3 Min Read American Senator Lindsey Graham said US President Donald Trump has given the green light to the bipartisan Russian sanctions bill, which will allow President Trump to punish those countries that buy cheap Russian oil. Graham said in a statement that Trump had \"greenlit\" the legislation after the pair met on Wednesday. The legislation, which Graham has been working on with fellow Republicans and Democrats for months, would impose sanctions on countries doing business with Russia, including buyers of its energy exports, over Moscow's failure to negotiate a peace deal with Ukraine. Russia invaded Ukraine in 2022. \"This bill will allow President Trump to punish those countries that buy cheap Russian oil fuelling Putin's war machine. This bill would give President Trump tremendous leverage against countries like China, India, and Brazil to incentivise them to stop buying the cheap Russian oil that provides the financing for Putin's bloodbath against Ukraine,\" Graham posted on X. After a very productive meeting today with President Trump on a variety of issues, he greenlit the bipartisan Russia sanctions bill that I have been working on for months with Senator Blumenthal and many others. This will be well-timed, as Ukraine is making concessions for peace Lindsey Graham (@LindseyGrahamSC) January 7, 2026 Graham, a senator from South Carolina, said he is looking forward to a \"strong bipartisan vote\" on the legislation to take place as early as next week. What is the 'Sanctioning of Russia Act 2025'? According to the official website of the US Congress, the bill is titled the \"Sanctioning of Russia Act 2025\". It proposes sweeping punitive measures, including penalties on individuals and entities linked to Russia. One of the key provisions includes raising duties on all goods and services imported from Russia into the US to at least 500% of their value. Another provision says the President must increase the rate of duty on all goods and services imported into the United States from countries that knowingly engage in the exchange of Russian-origin uranium and petroleum products to at least 500% relative to the value of such goods and services. On January 6, a European think tank said India imported about 144 billion euros' worth of crude oil from Russia since the start of the Ukraine war, estimating the Kremlin's cumulative earnings from global oil sales since February 2022 at around 1 trillion euros. Ind",
            "images": [],
            "rank": 5
          }
        ],
        "annotations": null,
        "_meta": null
      }
    ]
  }
}