{
  "raw_market_analysis_T002": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://www.kotaksecurities.com/investing-guide/share-market/stock-market-decline/",
            "content": "Indian Stock Market Decline: Key Reasons Behind the Fall | Kotak Securities Products Investment Suite Stocks Mutual Funds Future and Options IPO Exchange Traded Funds Commodity Stockcase (Stock Baskets) Non Convertible Debentures Sovereign Gold Bond Exclusive NRI Account Corporate/HUF Trading Account Private Client Group Features SipIt MTF Platform Trading Platforms Kotak Neo App & Web Nest Trading Terminal NEO Trade APIs Trade From Charts Features and Tools MTF Securities Accepted as Collateral Margin Requirements Equity Screeners Payoff Analyzer Calculators SIP Calculator Lumpsum Calculator Brokerage Calculator Margin Calculator MTF Calculator SWP Calculator CAGR Calculator Simple Interest Calculator ELSS Calculator Step up SIP Calculator All Calculators Pricing Research Research Calls Long Term Stocks Short Term Stocks Intraday Stocks Derivatives Calls Stock of the Week Top Monthly Picks Stock Research Recommendations MTF Stock Recommendations Research Reports Fundamental Research Report Technical Research Report Derivative Research Report Commodities Research Report Market Market Movers Share Market Today Top Gainers Top Losers 52 Week High 52 Week Low Volume Shockers Stocks Large Cap Mid Cap Small Cap Lenskart Share Price Groww Share Price ICICI Prudential Share Price Indices Nifty 50 Nifty Bank FinNifty Nifty Midcap India India VIX All Indices Mutual Funds SBI Mutual Funds HDFC Mutual Funds Axis Mutual Funds ICICI Prudential Mutual Funds Nippon India Mutual Funds All AMC's Market Movers Stocks Indices Mutual Funds Market Today Share Market Today Top Gainers Top Losers 52 Week High 52 Week Low Volume Shockers Price Wise Stocks Stocks Under 5 Rs Stocks Under 10 Rs Stocks Under 50 Rs Stocks Under 100 Rs Stocks Under 500 Rs Stocks Under 1000 Rs Sector Wise Stocks Multibagger Stocks Defence Stocks Green Energy Stocks Pharma Stocks Textile Stocks Sugar Stocks Large Cap Mid Cap Small Cap Lenskart Share Price Groww Share Price ICICI Prudential Share Price State Bank of India Share Price Reliance Industries Share Price HDFC Bank Share Price Infosys Share Price Tata Capital Share Price LG Electronics India Share Price Tata Consultancy Services Share Price Hindustan Unilever Share Price ITC Share Price IRCTC Share Price Meesho Share Price NSE Nifty 50 Nifty Bank FinNifty Nifty Midcap India India VIX All Indices BSE Sensex BSE Bankex BSE Small Cap BSE Mid Cap BSE 100 Indian Indices Global Indices Gift Nifty Dow Jones Nikkei Index Hang Seng Index KOSPI Index Global Indices AMC's SBI Mutual Funds HDFC Mutual Funds Axis Mutual Funds ICICI Prudential Mutual Funds Nippon India Mutual Funds All AMC's Schemes Parag Parikh Flexi Cap SBI Small Cap Fund SBI Contra Fund Nippon Small Cap Fund ICICI Pru Technology Fund Silver ETFs Gold ETFs Nifty 50 ETFs NSE ETFs Sensex ETFs NFO Learn Stockshaala Basics of Stock Market Introduction to Fundamental Analysis Introduction to Technical Analysis Derivatives, Risk management & Option Trading Strategies Personal Finance Explore More Resource Market Ready Kotak Insights Infographic Podcast Webinars Youtube Channel Investing Guide Demat Account Trading Account Share Market Intraday Trading IPO Mutual Funds Events Budget 2026 Market Outlook 2026 Share Market Holiday NSE Holidays BSE Holidays MCX Holidays Partner Business Associates Kotak Connect Plus Startup connect Support FAQs Circulars Bulletins Contact Us Forms Download Get your Statement News IPO Mainboard IPO Current IPO Upcoming IPO Recently Closed IPO Recently Listed IPO IPO Subscription Status IPO Allotment Status SME IPO All SME IPOs Current SME IPO Upcoming SME IPO Recently Closed SME IPO Live IPOs Bharat Coking Coal Ltd (BCCL) IPO Yajur Fibres IPO Defrail Technologies IPO View All Upcoming IPOs Avana Electrosystems IPO Narmadesh Brass Industries IPO GRE Renew Enertech IPO Amagi Media Labs IPO Indo SMC IPO View All Open Demat Account Login Open Demat Account Products Investment Suite Stocks Mutual Funds Future and Options IPO Exchange Traded Fun",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://www.ebc.com/forex/indian-stock-market-crash-2025-causes-and-outlook",
            "content": "Indian Stock Market Crash 2025: Causes and Outlook | EBC Financial Group   Espaol Bahasa Indonesia Ting Vit Portugus    Trading Trading Trading Products Forex Commodities Indices Stocks ETFs Accounts & Conditions Trading Accounts Leverage & Margin Deposits & Withdrawals Dividends Institutional Services Financial Technology Trading Tools MT4 Download MT5 Download PAMM Analytical Tools & Indicators Order Flow Tools Market Analysis Academy About EBC About EBC About EBC WHY EBC Sustainability & Impact EBC News Announcements Partners FC Barcelona University of Oxford Affiliate Programmes Customer Service FAQ Official Channel Verification Activities Copy Trading FAQ Official Channel Verification FCA Account Register Login   Espaol Bahasa Indonesia Ting Vit Portugus    Skill Hub Trading Dictionary Learning Centre Market Legends Online Webinars Podcast Market Research Trading News Technical Analysis Market Analysis Market Journal Trading Tools Trading Software Order Flow Investment Toolkit Trading Calculators Economic Calendar Trading Dictionary Learning Centre Market Legends Online Webinars Trading News Technical Analysis Market Analysis Market Journal Trading Software Order Flow Investment Toolkit Trading Calculators Economic Calendar Skill Hub Trading Dictionary Learning Centre Market Legends Online Webinars Market Research Trading News Technical Analysis Market Analysis Market Journal Trading Tools Trading Software Order Flow Investment Toolkit Trading Calculators Economic Calendar Trading Academy Stock Indian Stock Market Crash 2025: Causes and Outlook Indian Stock Market Crash 2025: Causes and Outlook Published on: 2025-09-19 The Indian stock market crash of 2025 wiped out several lakh crore in market value within weeks, driven by foreign portfolio investor (FPI) exits, a rupee crash past 88/$, and tariff fears shaking confidence. FPIs have pulled ~USD 1315 billion (1.11.2 lakh crore) YTD from India, while the rupee slid past 88/$, and ultra-low headline inflation removed the case for faster monetary easing. That combination created a rapid unwinding of crowded positions and increased volatility. This article explains the causes, the mechanics of the sell-off, the likely paths ahead (three scenarios), which sectors and investor types win or lose, and practical action steps for traders and long-term investors in India. What Happened to the Indian Stock Market in 2025? From mid-August to mid-September 2025, Indian markets experienced repeated bouts of selling pressure. Index moves were meaningful: the Nifty 50 slipped below key technical supports (near the 24,70025,100 area), and the Sensex crash wiped out multi-hundred points on headline days. In one notable session, the BSE market capitalisation decreased by several lakh crore rupees as risk aversion escalated. Domestic headlines and intraday trade commentary repeatedly flagged FPI outflows, the rupee crash, and U.S. tariff shocks as the triggers. What Caused the Indian Stock Market Crash of 2025? 5 Key Factors 1. Large Foreign Outflows Foreign portfolio investors have been net sellers through 2025. Trackers indicated FPIs have withdrawn approximately USD 1315 billion (1.11.2 lakh crore) so far in 2025, with fresh selling continuing into September. [1] August saw a notable spike in selling across financials and IT names. When non-resident sellers accelerate, domestic liquidity and valuations come under pressure. 2. Rupee Weakness and Dollar/FX Shocks In early to mid-September 2025, the Indian rupee fell below 88 per USD due to concerns about increasing U.S. tariffs on Indian goods and volatility in global policies. A weaker rupee heightens the risk of imported inflation and discourages foreign investment. Reuters reported that the rupee reached record low levels, highlighting how Foreign Portfolio Investors (FPIs) are sensitive to currency fluctuations, often reducing their exposure to India when the risk associated with the rupee increases. 3. Macro Surprises: Low",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://www.finnovate.in/learn/blog/fpi-sell-equities-2-5-billion-december-2025",
            "content": "FPIs Sell $2.5 Billion in Equities in December 2025 - Sector Analysis & Market Trends FPIs Sell $2.5 Billion in Equities in December 2025 - Sector Analysis & Market Trends Explore the major reasons behind the $2.5 billion worth of FPI selling in December 2025. Understand sectoral trends, FPI behavior, and how geopolitical risks, earnings slowdown, and currency volatilit By About Services Products Mutual Funds Equity Fixed Income Insurance Others Track Learn Finnversity Blogs Podcast Videos News Article Tools DOCTORPro Schedule Call Login Menu Home Blogs Economy January 09, 2026 5 min read Share Link copied Share Link copied FPIs Sell Equities Worth $2.5 Billion in December 2025 Foreign Portfolio Investors (FPIs) have been selling off Indian equities at an alarming rate in December 2025, to the tune of $2.5 billion. This has added to an already significant sell-off for the year, with FPIs net sellers by $18.8 billion for the entirety of 2025. Despite substantial inflows into major IPOs - nearly $8.2 billion- the secondary market has witnessed close to $27 billion in selling. Lets break down the key drivers behind this trend and its impact on the Indian stock market. FPI Selling Story: December 2025 Overview The month of December is traditionally not one where FPIs actively sell off large portions of their holdings in emerging markets, as it distorts their year-end performance. However, December 2025 proved to be an exception. Along with the $2.5 billion in selling during the first half of December, FPIs were net sellers throughout the year, adding to a significant $18.8 billion sell-off despite the $8.2 billion IPO inflows. So, whats driving this massive selling? Valuation concerns : The market's rising valuations, especially after a series of bullish rallies in 202324, have caused FPIs to rethink their positions in India. Earnings slowdown : Many FPIs believe that Indias earnings growth is not aligning with stock price appreciation. Geopolitical risks : Tensions in international markets, especially related to tariffs and supply chain disruptions, have spooked investors. Weak Rupee : The Indian rupee's decline, crossing 90/$ at one point, has also contributed to FPI nervousness. The currency weakness puts pressure on FPI returns, especially when repatriating funds. Lets look deeper into the sectoral data behind the $2.5 billion sell-off in December. Breakdown of December 2025 FPI Flows FPI flows in December 2025 were driven by a mix of sector-specific factors, with some sectors seeing positive flows and others bearing the brunt of FPI selling. Sectoral FPI Flows (December 2025) Sector Dec-25 (H1) ($ Million) Dec-25 (H2) ($ Million) Total ($ Million) Consumer Services -5 377 372 Metals & Mining 89 242 331 Oil & Gas 331 -72 259 Others 101 37 138 IT Sector -367 496 129 Consumer Durables 44 22 66 Telecommunication -97 124 27 Construction -19 43 24 Utilities -1 -2 -3 Chemicals -2 -3 -5 Diversified -9 -3 -12 Media -4 -31 -35 Textiles -29 -30 -59 Automobiles 67 -295 -228 Capital Goods -134 -150 -284 Power -233 -71 -304 Healthcare -259 -71 -330 Services -357 -116 -473 FMCG Sector -156 -492 -648 Realty -74 -30 -104 Cement -124 -61 -185 Automobiles 67 -295 -228 Capital Goods -134 -150 -284 Telecommunication -97 124 27 Power -233 -71 -304 Construction -19 43 24 Healthcare -259 -71 -330 Utilities -1 -2 -3 Services -357 -116 -473 Chemicals -2 -3 -5 FMCG Sector -156 -492 -648 BFSI -718 -446 -1,164 Grand Total -1,962 -532 -2,494 Data Source: NSDL (All figures are $ Million) What Are the Three Key Segments in December FPI Flows? 1. Green Segment (Positive Flows): These sectors saw net buying, including oil & gas, metals, and consumer services (mainly e-commerce). These flows were driven by secondary market purchases as well as IPOs. 2. Yellow Segment (Neutral Flows): Sectors that saw no clear trend in FPI buying or selling in December, possibly reflecting sectoral adjustments due to year-end portfolio realignment. 3. Pink Segment (Maximum Sell",
            "images": [],
            "rank": 3
          },
          {
            "url": "https://www.angelone.in/news/market-updates/market-correction-2025-why-indian-stocks-are-struggling-while-global-markets-surge",
            "content": "Market Correction in 2025: Why Indian Stocks Are Struggling While Global Markets Surge CALCULATE YOUR SIP RETURNS Open Demat Account Login Open Demat Account Login Trade & Invest Stocks Indices Upcoming IPO Commodity F&O ETF MTF Mutual Funds & SIP SIP Calculator Mutual Funds AMCs NFO Types of Mutual Fund Mutual Fund Screener Learn Knowledge Center Smart Money Live Blog Finance Wiki News Stock Market News Market Updates Personal Finance Mutual Funds IPO Products Angel One Super App Angel One Trade Calculators Smart API Wealth Management Become a Partner Influencer Partner (DRA) Insurance POSP Authorised Person Mutual Fund Distributor Authorised Person Locator Pricing Support User Manual Read FAQs Contact Us Download App Home Page News Stock Market Updates Market Correction in 2025: Why Indian Stocks Are Struggling While Global Markets Surge Market Correction in 2025: Why Indian Stocks Are Struggling While Global Markets Surge Written by: Team Angel One Updated on: 28 Feb 2025, 9:22 pm IST The Indian stock market is facing a sharp correction in 2025, with indices plunging while global markets remain resilient. Share Topics Covered Volatility Grips Dalal Street Indices Extend Losses for 5 Consecutive Months Indian Markets Underperform Global Peers Market Capitalisation Drops Below $4 Trillion Retail Investors Face Wealth Erosion Conclusion Show More The Indian stock market, once soaring to new heights, is now experiencing a severe downturn in 2025. Selling pressure has intensified, pushing indices to multi-month lows and shaking investor confidence. The worlds 5th-largest market, which once seemed unstoppable, is now struggling to find a floor to arrest the sell-off. Volatility Grips Dalal Street Market sentiment has turned fragile, with heightened volatility amplifying price swings. Stocks across sectors are facing significant pressure, with mid-and small-cap stocks leading the decline. Every small development is triggering sharp reactions, adding to the uncertainty. Indices Extend Losses for 5 Consecutive Months What began as profit booking in October 2024 has now snowballed into a broader market correction. The benchmark indices have posted losses for 5 straight months, with: Nifty50 plunging 13% Sensex sliding 12% The impact has been even more pronounced in the mid-and small-cap space on a YTD basis as of February 27, 2025: Nifty50 has corrected by 4.65% Sensex has slipped by 4.53% Nifty Midcap 100 has dropped 14% Nifty Smallcap 100 has tanked 19% Indian Markets Underperform Global Peers While Indian equities are under pressure, global markets have displayed resilience despite economic uncertainties. Major indices across Asia, Europe, and the US are showing gains on a YTD basis as of February 27, 2025: Shanghai Composite (China): Up 1.08% Hang Seng (Hong Kong): Surged 18.2% DAX (Germany), CAC 40 (France), FTSE 100 (UK): Gained up to 13.3% Dow Jones (US): Rose 2.09% S&P 500 (US): Up 1.27% Market Capitalisation Drops Below $4 Trillion With continued selling pressure, Indias market capitalisation has fallen below the $4 trillion markthe first time in over 14 months. Foreign Portfolio Investors (FPIs) have been aggressively offloading Indian equities, pulling out over 1 lakh crore so far in 2025. Retail Investors Face Wealth Erosion As overseas investors withdraw capital, retail investors are also facing heavy losses, especially in the small-cap segment, which continues to slide with no signs of recovery. The combination of FPI outflows, market volatility, and global underperformance has led to significant wealth erosion. Conclusion As the correction deepens, market participants remain cautious, closely watching global cues and domestic developments. Whether the tide will turn or if the downturn will persist remains a key question for investors in 2025. Disclaimer: This blog has been written exclusively for educational purposes. The securities mentioned are only examples and not recommendations. This does not constitute a pers",
            "images": [],
            "rank": 4
          },
          {
            "url": "https://timesofindia.indiatimes.com/business/india-business/stock-market-crash-today-why-has-nifty50-bse-sensex-crashed-in-the-last-5-trading-sessions-january-09-2026-top-reasons-explained/articleshow/126431275.cms",
            "content": "Stock market crash today: Why has Sensex plunged over 2,100 points, Nifty down over 2% in 5 days? Top 5 reasons explained - The Times of India Read ePaper Sign In News TOI Games Live Videos World India City Life & Style Entertainment Business Tech Cricket Sports TV Web Series Education Speaking Tree Voice Of Conscience TOI Newsletters Trending Gold price prediction Top stocks today Gratuity calculation US mortgage rate Trump tariffs Stock market today Budget 2026 Stock market crash today: Why has Sensex plunged over 2,100 points, Nifty down over 2% in 5 days? Top 5 reasons explained TOI Business Desk / TIMESOFINDIA.COM / Updated: Jan 09, 2026, 16:18 IST The steady exit of overseas funds has intensified the weakness in benchmark indices. (AI image) Stock market crash: Equity benchmark indices, Nifty50 and BSE Sensex , have plunged by over 2% in the last few trading sessions, with both indices seeing the fifth consecutive day of crash on Friday. Tired of too many ads? go ad free now Concerns over global trade tensions and political developments in Washington have disrupted investor sentiment, adding to caution. Over the past five trading sessions, the BSE Sensex has shed over 2,100 points, falling from its January 2 close of 85,762.01 to an intraday trough of 83,402.28 on Friday. During the same period, the NSE Nifty 50 has declined to levels below 25,700. Nifty50 ended the day at 25,683.30, down 194 points or 0.75%. BSE Sensex closed at 83,576.24, down 605 points or 0.72%. Why is the stock market crashing? 1. FIIs sell-off : Ongoing foreign investor outflows have added to the pressure on equities during the prolonged slide. Foreign institutional investors sold shares worth Rs 3,367.12 crore on Thursday, January 8, marking the fourth straight session of net selling following a brief respite on January 2. The steady exit of overseas funds has intensified the weakness in benchmark indices, deepening losses amid an uncertain global backdrop and reinforcing a risk-averse stance among investors already navigating unfavourable external conditions. 2. Trump trade & tariff uncertainty: Equity markets have remained under strain after US President Donald Trump indicated that tariffs on Indian exports could be increased over New Delhis continued purchases of Russian crude. A new bill proposing 500% tariffs on countries buying Russian oil has been given a nod by Trump. A proposed bilateral trade agreement between the two countries remains unresolved despite six rounds of discussions held since March. Tired of too many ads? go ad free now Speaking on the All-In Podcast, US Commerce Secretary Howard Lutnick suggested the talks lost momentum after Prime Minister Narendra Modi did not place a call to Trump. The Trump administration has already imposed tariffs of up to 50% on Indian goods, including a 25% levy linked to Indias imports of Russian oil, among the steepest applied to any trading partner. India has termed these measures unfair, unjustified and unreasonable. The uncertainty has intensified ahead of a pending ruling by the US Supreme Court on the legality of Trumps tariff actions. If the court finds the levies unlawful, Washington could be required to return close to $150 billion to importers, a decision that would have far-reaching implications for global trade. After the sharp correction yesterday triggered by the possibility of about 500% tariff on India under the provisions of the Russia Sanctioning Act approved by President Trump, the market will be focused on the verdict expected today from the US Supreme Court on the legality of Trump tariffs, said Dr. VK Vijayakumar, Chief Investment Strategist at Geojit Investments. There is a high probability of the verdict going against Trump. But the details are significant: that is, whether it would be a partial striking down of the tariffs or completely declaring the tariffs illegal. The market reaction would depend on the details. If the Supreme Court declares Trump tariffs illegal, ther",
            "images": [],
            "rank": 5
          }
        ],
        "annotations": null,
        "_meta": null
      }
    ]
  },
  "raw_market_data_T001": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://www.nseindia.com/reports-indices-historical-index-data",
            "content": "Historical Index Data Option Chain Market Turnover Listings IPO Circulars Daily Report Holidays Corporates Press Releases Contact Us English English (Hindi) (Marathi) (Gujarati) (Bengali) (Kannada) (Tamil) (Telugu) (Punjabi) (Malayalam) (Oriya) (Assamese) (Urdu) Font Size A+ | Reset | A- Contrast High Contrast | Reset View All 25,732.30 -57.95 ( -0.22 %) 13-Jan-2026 15:30 Streaming Streaming on off Streaming Speed Slow Medium Fast 25,732.30 -57.96 ( -0.22 %) 13-Jan-2026 15:30 Indicative close Futures 27-Jan-2026 25770.50 -182.50 ( -0.70 %) 13-Jan-2026 15:39 USDINR Futures 23-Jan-2026 | 89.9700 13-Jan-2026 16:16 Market Capitalization Lac Crs 465.77 | Tn $ 5.16 13-Jan-2026 Home About About NSE About Us Structure & Key Personnel Investor Relations Awards and Recognitions Regulations Event Gallery Media Holidays Careers Contact Us NSE Group companies NSE Academy NSE Clearing NSE Data & Analytics NSE Foundation NSE Indices NSE International Exchange NSE International Clearing NSE Investments View all Products & Services Equity Market Indices Emerge Platform Mutual Funds Equity Derivatives Currency Derivatives Commodity Derivatives Interest Rate Derivatives Fixed Income and Debt Public Issues About Us Find everything about the leading stock exchange of India Our Group Check NSE's group of the companies Our Products Browse a comprehensive and innovative product and service offerings by NSE Market Data Equity New Listings Pre-Open Market Equity & SME Market Indices Gainers/Losers Most Active Equities Price Band Hitters 52 Week High/Low Large Deals Advances / Declines Securities Lending & Borrowing Call auction for Illiquid Securities Securities available for Trading Price Bands & Surveillance Actions Position/Investment Limits Legend of series Daily Reports Historical Reports Derivatives Pre-Open Market Derivatives Market Option Chain Most Active Contracts Most Active Underlying Change in Open Interest Liquidity Enhancement Scheme Contracts available for Trading Daily Reports Historical Reports Debt & Fixed Income Traded on CM CBRICS RFQ Negotiated Trades Trade Repository Tri-Party Repo Daily Reports Historical Reports Primary Markets IPO Offer For Sale NCB G-SEC Institutional Placement Program (IPP) Tender Offer Rights INVITS REITS Reverse Book Building Liquidity Window Facility EBP Market Snapshot Live Analysis of top gainers/losers, most active securities/contracts, price band hitters, overview of the market. Option Chain View Option chain for the exchange Historical Reports View Historical Reports of securities/contracts traded on the Exchange. Invest Investor Education Investing in Securities Market Charges and Taxes Investor Awareness Investor Charter Protection from Fraud Investor Awareness Programs Regulatory Action Registered Investors Foreign Portfolio Investors (FPI) Resources & Tools Locate your Stock Broker Company Directory Exit Option for shareholders Feedback Investor's Home Investor education on how to invest safely and protect your investments. Product Information Browse NSE products under Cash, derivatives, currency derivatives etc. LOGIN TO SMARTODR Online Dispute Resolution Mechanism for filing complaints List Raising Capital On-boarding Process Primary Market - Main Board Primary Market - SME Debt - Private Placement Social Stock Exchange Mutual Fund/ETFs/AIFs Further Issues Public Issue Advertisements Corporate Filings Announcements Board Meetings Corporate Actions Financial Results Shareholding Pattern Shareholding Pattern SDD Issuer Offer documents/Issue Summary Document Integrated Filing Scheme of Arrangement Resources for Listed Companies SEBI Regulations Compliance Information XBRL Information XBRL To Excel Converter Company Directory Circulars to Listed Companies NEAPS Portal Delisting Delisting of Companies Public Notice Compulsory Delisting Orders of Delisting Committee Corporates Home Important information, reference material and latest announcements for corporates Company Compliance Informa",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://www.investing.com/indices/sensex-historical-data",
            "content": "BSE Sensex Historical Data (BSESN) - Investing.com Investing.com - Financial Markets Worldwide Open in App Popular Searches Please try another search Find your edge in 2026 with 55% off InvestingPro Sign In Free Sign Up English (UK) English (India) English (Canada) English (Australia) English (South Africa) English (Philippines) English (Nigeria) Deutsch Espaol (Espaa) Espaol (Mxico) Franais Italiano Nederlands Polski Portugus (Portugal) Portugus (Brasil) Trke  Svenska Suomi   Bahasa Indonesia Bahasa Melayu Ting Vit  Find your edge in 2026 with 55% off InvestingPro Sign In Free Sign Up Markets Indices Indices Futures Major Indices Indices Real-Time World Indices Global Indices Dow Jones Futures S&P 500 Futures Nasdaq Futures S&P 500 Dow Jones Nasdaq 100 DAX FTSE 100 Euro Stoxx 50 Nikkei 225 Stocks Stock Screener Trending Stocks Stocks Picked by AI United States Pre-Market After Hours Earnings Calendar Americas Europe 52 Week High 52 Week Low Most Active Top Gainers Top Losers Undervalued Stocks Overvalued Stocks World ADRs Marijuana Stocks Top Bank Stocks Renewable Energy Stocks Apple Tesla Meta Platforms Amazon.com Microsoft NVIDIA Netflix Pfizer AMD Boeing GameStop Corp AMC Entertainment Nio A ADR Super Micro Computer Commodities Real Time Commodities Metals Energy Grains Softs Meats Commodity Indices Gold Crude Oil WTI Brent Oil Silver Natural Gas Copper US Wheat Cryptocurrency All Cryptocurrencies Cryptocurrency Pairs Bitcoin Ethereum Cardano Solana Dogecoin SHIBA INU Polkadot OFFICIAL TRUMP XRP Currency Converter BTC/USD ETH/USD BCH/USD LTC/USD DOGE/USD ETC/USD ETH/BTC XRP/USD pDOTn/USD Bitcoin Futures CME Currencies Currency Rates Single Currency Crosses Live Currency Cross Rates Exchange Rates Table Forward Rates Currency Futures Currency Options EUR/USD GBP/USD EUR/CHF AUD/USD USD/JPY USD/CAD USD/CHF USD/TRY USD/MXN BTC/USD USD/RUB Dollar Index ETFs World ETFs Major ETFs USA ETFs Marijuana ETFs Bitcoin ETFs SPDR S&P 500 iShares MSCI Emerging Markets SPDR Dow Jones Industrial Average Invesco QQQ Trust Funds World Funds Major Funds Vanguard 500 Index Admiral Vanguard Total Bond Market II Index Fund Investor American Funds Capital Income Builder A PIMCO Commodity Real Return Strategy Institutional Bonds US Treasury Yield Curve World Government Bonds Financial Futures Government Bond Spreads Bond Indices Forward Rates World Credit Default Swap Rates (CDS) U.S. 10Y U.S. 30Y U.S. 2Y U.S. 5Y U.S. 3M US 10Y T-Note US 30Y T-Bond Euro Bund Certificates Major Certificates World Certificates SG FTSE MIB Gross TR 5x Daily Short Strategy RT 18 Vontobel 7X Long Fixed Lever on Natural Gas 8.06 BNP Call 500.59 EUR AEX 31Dec99 COMMERZBANK AG Put CAC FUT 05/17 31Dec99 My Watchlist Investing Challenges News Financial News Stock Markets Earnings Analyst Ratings Transcripts Cryptocurrency Commodities Currencies Economy Economic Indicators Breaking News Pro News More In News Latest Most Popular Sports & General World Politics Press Releases Company News Insider Trading Investment Ideas SEC Filings SWOT Analysis Analysis Analysis Market Overview Currencies Stock Markets Commodities Bonds Cryptocurrency ETFs More In Opinion Most Popular Editor's Picks Comics Charts Real Time Charts Live Charts Currency Chart Futures Chart Stocks Chart Indices Chart Cryptocurrency Chart Interactive Currency Chart Interactive Futures Chart Interactive Indices Chart Interactive Stocks Chart Multiple Currency Charts Multiple Indices Charts Technical Tools Technical Summary Technical Analysis Pivot Points Moving Averages Indicators Candlestick Patterns More In Technical Candlestick Patterns Fibonacci Calculator Pivot Point Calculator Brokers Brokers Currency Brokers Stock Brokers Online Brokers Crypto Exchanges More In Brokers Cryptocurrency Brokers Gold IRA Futures Brokers Tools Calendars Economic Calendar Holiday Calendar Earnings Calendar Dividend Calendar Splits Calendar IPO Calendar Futures Expiry Calendar Investment Tools Stock Screener Fed Rate Monit",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://www.bseindia.com/Indices/IndexArchiveData.html",
            "content": "Historical - Indices Historical Data Daily Indices Snapshot {{filedwnld.DTTM | date:'dd/MM/yyyy'}} Index Select Index All Indices {{indx.shortalias}} Period Daily Monthly Yearly From To From MMM Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec {{yr}} From {{yr}} Indices : {{lblIndex}} Period : {{lblPeriod}} Date Month Year Index Name Open High Low Close Points Change Change(%) Volume(Cr.) Turnover (Rs.Cr.) P/E P/B Div Yield {{checknull(iarch.date)?'--':(iarch.date|date:'dd/MM/yyyy')}} {{checknull(iarch.I_name)?'--' : (iarch.I_name)}} {{checknull(iarch.I_open)?'--':(iarch.I_open |number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} {{checknull(iarch.Chg)?'--' : (iarch.Chg|number:2)}} {{checknull(iarch.ChgPer)?'--' : (iarch.ChgPer|number:2)}} {{checknull(iarch.Volume)?'--' : (iarch.Volume|number:2)}} {{checknull(iarch.Turnover)?'--' : (iarch.Turnover|number:2)}} {{checknull(iarch.I_pe)?'--' : (iarch.I_pe|number:2)}} {{checknull(iarch.I_pb)?'--' : (iarch.I_pb|number:2)}} {{checknull(iarch.I_yl)?'--' : (iarch.I_yl|number:2)}} {{iarch.Day}}/{{iarch.Month|indxfrmMMM}}/{{iarch.year}} {{checknull(iarch.I_open)?'--':(iarch.I_open |number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} {{iarch.Month|monthfmtMMM}} {{iarch.year|yearfmtyy}} {{checknull(iarch.I_open)?'--' :(iarch.I_open|number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} {{iarch.year}} {{checknull(iarch.I_open)?'--':(iarch.I_open |number:2)}} {{checknull(iarch.I_high)?'--' : (iarch.I_high |number:2)}} {{checknull(iarch.I_low)?'--' : (iarch.I_low|number:2)}} {{checknull(iarch.I_close)?'--' : (iarch.I_close|number:2)}} Note: Kindly download the csv file to view all records. Effective (open of) April 16th 2015, Asia Index Private Limited (AIPL) has cancelled BSE MID CAP, BSE SMALL CAP, BSE HEALTHCARE, BSE IT and BSE FMCG indices and replaced them with BSE MidCap, BSE SmallCap, BSE Healthcare, BSE Information Technology and BSE Fast Moving Consumer Goods, respectively. For more information please click here The closing value as of April 15th 2015 for respective legacy indices is used as base index value for the new indices. For more information you may write to us at bseindex@bseindia.com",
            "images": [],
            "rank": 3
          },
          {
            "url": "https://finance.yahoo.com/quote/%5EBSESN/history/",
            "content": "BSE - Delayed Quote INR S&P BSE SENSEX (^BSESN) At close: 3:30:52 PM GMT+5:30 Currency in INR | Date | Open | High | Low | Close Close price adjusted for splits. | Adj Close Adjusted close price adjusted for splits and dividend and/or capital gain distributions. | Volume | |---|---|---|---|---|---|---| | Jan 13, 2026 | 84,079.32 | 84,258.03 | 83,262.79 | 83,627.69 | 83,627.69 | - | | Jan 12, 2026 | 83,435.31 | 83,962.33 | 82,861.07 | 83,878.17 | 83,878.17 | 9,300 | | Jan 9, 2026 | 84,022.09 | 84,406.22 | 83,402.28 | 83,576.24 | 83,576.24 | 12,500 | | Jan 8, 2026 | 84,778.02 | 84,965.27 | 84,110.10 | 84,180.96 | 84,180.96 | 26,300 | | Jan 7, 2026 | 84,620.40 | 85,075.99 | 84,617.49 | 84,961.14 | 84,961.14 | 19,200 | | Jan 6, 2026 | 85,331.14 | 85,397.78 | 84,900.10 | 85,063.34 | 85,063.34 | 23,300 | | Jan 5, 2026 | 85,640.05 | 85,883.50 | 85,315.33 | 85,439.62 | 85,439.62 | 12,600 | | Jan 2, 2026 | 85,259.36 | 85,812.27 | 85,068.88 | 85,762.01 | 85,762.01 | 17,900 | | Jan 1, 2026 | 85,255.55 | 85,451.70 | 85,101.52 | 85,188.60 | 85,188.60 | 20,600 | | Dec 31, 2025 | 84,793.58 | 85,437.17 | 84,705.57 | 85,220.60 | 85,220.60 | 11,600 | | Dec 30, 2025 | 84,600.99 | 84,806.99 | 84,470.94 | 84,675.08 | 84,675.08 | 6,900 | | Dec 29, 2025 | 85,004.75 | 85,250.00 | 84,637.86 | 84,695.54 | 84,695.54 | 53,300 | | Dec 26, 2025 | 85,225.28 | 85,378.51 | 84,937.82 | 85,041.45 | 85,041.45 | 4,800 | | Dec 24, 2025 | 85,533.11 | 85,738.18 | 85,342.19 | 85,408.70 | 85,408.70 | 8,400 | | Dec 23, 2025 | 85,690.10 | 85,704.93 | 85,342.99 | 85,524.84 | 85,524.84 | 6,100 | | Dec 22, 2025 | 85,145.90 | 85,601.33 | 85,145.86 | 85,567.48 | 85,567.48 | 6,100 | | Dec 19, 2025 | 84,756.79 | 85,067.50 | 84,734.96 | 84,929.36 | 84,929.36 | 8,100 | | Dec 18, 2025 | 84,518.33 | 84,780.19 | 84,238.43 | 84,481.81 | 84,481.81 | 15,000 | | Dec 17, 2025 | 84,856.26 | 84,889.45 | 84,415.98 | 84,559.65 | 84,559.65 | 11,200 | | Dec 16, 2025 | 85,025.61 | 85,059.96 | 84,620.61 | 84,679.86 | 84,679.86 | 9,600 | | Dec 15, 2025 | 84,891.75 | 85,278.63 | 84,840.32 | 85,213.36 | 85,213.36 | 10,600 | | Dec 12, 2025 | 85,051.03 | 85,320.82 | 84,956.74 | 85,267.66 | 85,267.66 | 8,200 | | Dec 11, 2025 | 84,456.75 | 84,906.93 | 84,150.19 | 84,818.13 | 84,818.13 | 15,800 | | Dec 10, 2025 | 84,607.49 | 85,020.34 | 84,313.62 | 84,391.27 | 84,391.27 | 8,800 | | Dec 9, 2025 | 84,742.87 | 84,947.89 | 84,382.96 | 84,666.28 | 84,666.28 | 8,500 | | Dec 8, 2025 | 85,624.84 | 85,722.97 | 84,875.59 | 85,102.69 | 85,102.69 | 10,700 | | Dec 5, 2025 | 85,125.48 | 85,796.72 | 85,078.12 | 85,712.37 | 85,712.37 | 7,900 | | Dec 4, 2025 | 84,987.56 | 85,487.21 | 84,949.98 | 85,265.32 | 85,265.32 | 17,900 | | Dec 3, 2025 | 85,150.64 | 85,269.68 | 84,763.64 | 85,106.81 | 85,106.81 | 17,400 | | Dec 2, 2025 | 85,325.51 | 85,553.51 | 85,053.00 | 85,138.27 | 85,138.27 | 5,800 | | Dec 1, 2025 | 86,065.92 | 86,159.02 | 85,489.65 | 85,641.90 | 85,641.90 | 8,500 | | Nov 28, 2025 | 85,791.55 | 85,969.89 | 85,577.82 | 85,706.67 | 85,706.67 | 6,400 | | Nov 27, 2025 | 85,745.05 | 86,055.86 | 85,473.85 | 85,720.38 | 85,720.38 | 15,800 | | Nov 26, 2025 | 84,503.44 | 85,644.19 | 84,478.13 | 85,609.51 | 85,609.51 | 13,800 | | Nov 25, 2025 | 85,008.93 | 85,110.24 | 84,536.73 | 84,587.01 | 84,587.01 | 6,200 | | Nov 24, 2025 | 85,320.04 | 85,473.47 | 84,710.11 | 84,900.71 | 84,900.71 | 9,600 | | Nov 21, 2025 | 85,347.40 | 85,609.40 | 85,187.84 | 85,231.92 | 85,231.92 | 14,200 | | Nov 20, 2025 | 85,470.92 | 85,801.70 | 85,201.22 | 85,632.68 | 85,632.68 | 24,300 | | Nov 19, 2025 | 84,643.78 | 85,236.77 | 84,525.98 | 85,186.47 | 85,186.47 | 8,900 | | Nov 18, 2025 | 85,042.37 | 85,042.41 | 84,558.36 | 84,673.02 | 84,673.02 | 10,700 | | Nov 17, 2025 | 84,700.50 | 84,988.09 | 84,581.08 | 84,950.95 | 84,950.95 | 10,500 | | Nov 14, 2025 | 84,060.14 | 84,697.87 | 84,029.32 | 84,562.78 | 84,562.78 | 8,800 | | Nov 13, 2025 | 84,525.89 | 84,919.43 | 84,253.05 | 84,478.67 | 84,478.67 | 25,600 | | Nov 12, 2025 | 84,238.86 | 84,652",
            "images": [],
            "rank": 4
          },
          {
            "url": "https://www.5paisa.com/sensex-historical-data",
            "content": "Sensex Historical Data: Get BSE Sensex Index Historical Data | 5paisa Invest Investment Products Stocks MTFs, advanced charts, advisory & moreright at your fingertips. Mutual Funds Invest in top performing direct mutal funds at 0% commission IPOs Apply for IPOs within few clicks! ETF Enjoy easy diversification with flexible investment US Stocks Diversify into US Stocks & ETFs seamlessly! Tools Brokerage Calculator SIP Calculator Stock Comparison Stock Screener ELSS Calculator Compare Mutual Funds All Calculators Trade Trading Products Future & Options Trade F&O contracts across segments along with far expiry contracts Commodity Diversify your portfolios beyond traditional securities Tools Margin Calculator MTF Calculator Expand your trading horizons with global currency trading! Stock Screener All Calculators Products 5paisa Products 5paisa Trading App A go-to mobile app for savvy traders and investors! Trader's Terminal A desktop trading platform for a seamless big-screen trading experience. 5paisa EXE Go-to desktop-based platform for the fast and agile trader FnO360 A trading terminal designed exclusively for derivatives traders. Xstream APIs Unleash the Future of Trading with our Free, Fast and Simple API Platform Publisher Js Seamlessly add the 5paisa trade button to your website with minimal codingabsolutely FREE! Scalper Terminal New Lightning-fast scalping interface with instant keyboard execution. Pay Later MTF Seize market opportunities instantly, pay later 5paisa MCP Your AI trading companion all through natural conversations Trade on Charts Trade directly from TradingView charts with Tv.5paisa. Pricing Markets Market Movers Stocks Popular Stocks Indices IPO Mutual Funds Market Today 52 Week High 52 Week Low FII DII Top Gainers Top Losers Volume Shockers Value Shockers Only Buyers Only Sellers F&O Ban List Active Contracts Stocks to Buy Today Penny Stocks Stocks Under 10 Stocks Under 50 Stocks Under 100 View All Stocks BTST Stocks Multibagger Stocks Bonus Rights Splits Dividends Large Cap Stocks Mid Cap Stocks Small Cap Stocks Group Stocks Nifty 50 Stock List Indian ADRs LIC Tata Motors IRFC ITC Tata Steel Adani Enterprises Yes Bank Suzlon TCS SBI Infosys Adani Power Reliance Tata Power Idea Jio Financial Services Zomato Adani Wilmar NSE Nifty 50 Bank Nifty FINNIFTY Nifty Midcap India VIX Know More BSE Sensex BSE Bankex BSE Smallcap BSE Midcap BSE 100 Know More Global Indices Gift Nifty Dow Hang Seng S&P Nikkei 225 Know More IPO Upcoming IPO Current IPO Closed IPO Recently Listed IPO IPO Allotment Status IPO Calendar Categories Large Cap Funds Mid Cap Funds Small Cap Funds ELSS Equity Debt AMCs SBI Mutual Funds HDFC Mutual Funds Axis Mutual Funds ICICI Pru Mutual Fund Nippon India Mutual Funds All AMC's Schemes Parag Parikh Flexi Cap SBI Small Cap Fund SBI Contra Fund Nippon Small Cap Fund ICICI Pru Technology Fund All Schemes Learn Learn with us FinSchool One-stop destination for FREE courses to master investing and trading! Market Guide Ultimate guide to the stock market, covering investments, demat accounts, IPOs & more. Stock Market News Track the latest trends in the Indian stock market with 5paisa. Blogs Making the stock market simplelearn, invest, and grow! Videos Demystify the stock market with our easy-to-understand investment videos. TradeBetter A Community for traders and investors. Talk Trades. Learn Features. Swap Ideas. Stocks in News Stay updated with all the news related to stocks! Partner Partner with us Authorised Person Refer and Earn 5paisa Partner Program 5paisa Partner Dashboard Open Account English English  Invest Investment Products Stocks MTFs, advanced charts, advisory & moreright at your fingertips. Mutual Funds Invest in top performing direct mutal funds at 0% commission IPOs Apply for IPOs within few clicks! ETF Enjoy easy diversification with flexible investment US Stocks Diversify into US Stocks & ETFs seamlessly! Tools Brokerage Calculator SIP Calculator Stock Comparison Stock Scree",
            "images": [],
            "rank": 5
          }
        ],
        "annotations": null,
        "_meta": null
      }
    ]
  }
}