{
  "latest_revenue_data_T001": {
    "content": [
      {
        "type": "text",
        "text": [
          {
            "url": "https://hindidohe.in/dhurandhar-box-office-collection/",
            "content": "Dhurandhar Box Office Collection: Day-Wise Earnings & Records in 2026 Skip to content Contact Us Privacy Policy Terms and Conditions Disclaimer Blog Trending Topics Sitemap Facebook Pinterest Twitter Tumblr Menu Menu      Search Dhurandhar Box Office Collection: Day-Wise Earnings & Records in 2026 January 10, 2026 by Ruma Sharma You step into the world of high-stakes espionage with Dhurandhar, a gripping spy action thriller that hit theaters on December 5, 2025. Directed by Aditya Dhar, the film boasts a powerhouse cast including Ranveer Singh in the lead, alongside Akshaye Khanna, R Madhavan, Sanjay Dutt, and Arjun Rampal. Its all about intense drama, patriotic vibes, and edge-of-your-seat action that keeps you hooked. What draws you in? Dhurandhar shattered expectations, emerging as the highest-grossing Hindi film in the post-COVID era. It stormed into the 1000 Crore Club faster than most, outpacing blockbusters like Pushpa 2 in Hindi net collections and even surpassing RRR worldwide. Imagine thata single-language Hindi release without dubbed versions, yet it conquered global charts. You cant ignore its record-breaking run, from massive openings to sustained earnings amid holidays and competition. This dhurandhar earnings saga isnt just numbers; its a testament to star power and storytelling. The film crossed key milestones, like entering the elite club of films with over Rs 800 crore net in India, proving its dominance in the box office report landscape. Day-Wise Box Office Collection in India You want the nitty-gritty on how Dhurandhar built its empire day by day. Net collections reflect earnings after taxes, while gross includes everythingvital for understanding true performance. Factors like weekends, Christmas boosts, and rivals like The Raja Saab influenced the flow. Weekends spiked with family crowds, but weekdays dipped naturally. Dhurandhars dhurandhar box office collection started strong, holding double digits for an astonishing 28 days. Thats rare. Competition from Prabhas The Raja Saab caused a dip on Day 36, its lowest yet. But you see resilience herethe film bounced back. Day-Wise Collection Table (India Net) Day Date India Net Collection ( Cr) Change (+/-) Day 1 (1st Friday) 05-Dec-2025 28.60 Day 2 (1st Saturday) 06-Dec-2025 33.10 +15.73% Day 3 (1st Sunday) 07-Dec-2025 44.80 +35.35% Day 4 (1st Monday) 08-Dec-2025 24.30 -45.76% Day 5 (1st Tuesday) 09-Dec-2025 28.60 +17.70% Day 6 (1st Wednesday) 10-Dec-2025 29.20 +2.10% Day 7 (1st Thursday) 11-Dec-2025 29.40 +0.68% Day 8 (2nd Friday) 12-Dec-2025 34.70 +18.03% Day 9 (2nd Saturday) 13-Dec-2025 53.70 +54.76% Day 10 (2nd Sunday) 14-Dec-2025 58.20 +8.38% Day 11 (2nd Monday) 15-Dec-2025 31.80 -45.36% Day 12 (2nd Tuesday) 16-Dec-2025 32.10 +0.94% Day 13 (2nd Wednesday) 17-Dec-2025 25.70 -19.94% Day 14 (2nd Thursday) 18-Dec-2025 25.30 -1.56% Day 15 (3rd Friday) 19-Dec-2025 23.70 -6.32% Day 16 (3rd Saturday) 20-Dec-2025 35.70 +50.63% Day 17 (3rd Sunday) 21-Dec-2025 40.30 +12.89% Day 18 (3rd Monday) 22-Dec-2025 19.70 -51.12% Day 19 (3rd Tuesday) 23-Dec-2025 20.40 +3.55% Day 20 (3rd Wednesday) 24-Dec-2025 20.90 +2.45% Day 21 (3rd Thursday) 25-Dec-2025 28.60 +36.84% Day 22 (4th Friday) 26-Dec-2025 16.70 -41.61% Day 23 (4th Saturday) 27-Dec-2025 20.90 +25.15% Day 24 (4th Sunday) 28-Dec-2025 24.30 +16.27% Day 25 (4th Monday) 29-Dec-2025 11.20 -53.91% Day 26 (4th Tuesday) 30-Dec-2025 12.60 +12.50% Day 27 (4th Wednesday) 31-Dec-2025 12.40 -1.59% Day 28 (4th Thursday) 01-Jan-2026 17.60 +41.94% Day 29 (5th Friday) 02-Jan-2026 9.70 -44.89% Day 30 (5th Saturday) 03-Jan-2026 12.60 +29.90% Day 31 (5th Sunday) 04-Jan-2026 13.50 +7.14% Day 32 (5th Monday) 05-Jan-2026 5.40 -60.00% Day 33 (5th Tuesday) 06-Jan-2026 5.70 +5.56% Day 34 (5th Wednesday) 07-Jan-2026 4.75 -16.67% Day 35 (5th Thursday) 08-Jan-2026 4.70 -1.05% Day 36 (6th Friday) 09-Jan-2026 3.60 -23.40% Total 844.45 See also  The Odyssey:   Peaks hit on Sundays, like Day 10s Rs 58.20 crore surge. Drops came mid-week,",
            "images": [],
            "rank": 1
          },
          {
            "url": "https://www.ndtv.com/entertainment/dhurandhar-earns-rs-1-240-crore-worldwide-becomes-highest-grossing-indian-film-of-all-time-in-a-single-language-10458212",
            "content": "Access Denied Access Denied You don't have permission to access \"http://www.ndtv.com/entertainment/dhurandhar-earns-rs-1-240-crore-worldwide-becomes-highest-grossing-indian-film-of-all-time-in-a-single-language-10458212\" on this server. Reference #18.34a21ab8.1768300794.f7939a3 https://errors.edgesuite.net/18.34a21ab8.1768300794.f7939a3",
            "images": [],
            "rank": 2
          },
          {
            "url": "https://www.indiatvnews.com/entertainment/news/box-office-january-7-2026-dhurandhar-ikkis-collection-2026-01-08-1024959",
            "content": "Box Office [January 7, 2026]: Dhurandhar becomes highest-grossing Hindi film; set to beat RRR's worldwide | Entertainment News India TV Welcome User! Sign In / Register Sign Out Dark Mode Videos Aap Ki Adalat Aaj Ki Baat News Astrology Originals Yoga Kurukshetra Haqiqat Kya Hai Muqabla Entertainment Sports Lifestyle India Maharashtra Karnataka Uttar Pradesh Delhi Bihar Madhya Pradesh Rajasthan Haryana Chhattisgarh Gujarat West Bengal Jammu & Kashmir Telangana Tamil Nadu North East Photos Video Web Stories Sports Entertainment News Tech Lifestyle Health Business Astrology Entertainment Bollywood TV OTT Reviews Regional Hollywood Korean Photos Web Stories Videos Sports Cricket Football Tennis Photos Web Stories Video Photos India Sports Entertainment World Fashion Lifestyle Lifestyle Food Travel Beauty Photos Web Stories Video Spirituality Events Education Higher Studies Career Results Jobs Technology Gadgets Reviews Web Stories Business markets Personal Finance Income Tax Web Stories World Astrology Health Live Cricket Score LiveTV Science Auto Brand Content Pincode Topic Elections Trending Fact-check Explainers Crime Home Videos India World Sports Entertainment Tech Photos Lifestyle Health Business Explainer Advertisement News Entertainment Box Office [January 7, 2026]: Dhurandhar becomes highest-grossing Hindi film; set to beat RRR's worldwide Box Office [January 7, 2026]: Dhurandhar becomes highest-grossing Hindi film; set to beat RRR's worldwide Ranveer Singh's Dhurandhar becomes India's highest-grossing Hindi film, earning Rs 1,222 crore worldwide, set to surpass RRR. Read further to know the detailed box office report. Dhurandhar emerged as India's highest grossing Hindi film. Image Source : TMDB Written By: Twinkle Gupta Published: January 08, 2026 9:56 IST , Updated: January 08, 2026 9:56 IST New Delhi: Ranveer Singh 's spy thriller Dhurandhar has become India's highest-grossing Hindi film. Directed by Aditya Dhar, the film saw a dip in its collections during the fifth week, earning single-digit crores on its fifth Friday, but bounced back over the weekend. Despite the slowdown, the film continues to dominate the Indian box office. Notably, it recorded a 62.75% drop on Day 32, its fifth Monday, earning Rs 4.75 crore. According to industry tracker Sacnilk, Dhurandhar has earned Rs 1,222 crore worldwide and is set to surpass the global collection of Jr NTR and Ram Charan's RRR in the coming days. Dhurandhar becomes highest-grossing Hindi film Aditya Dhar's Dhurandhar has emerged as the highest-grossing single-language Indian film of all time. The film has been running in theatres for 34 days, earning Rs 786 crore in India. On Day 34, it collected 4.25 crore, with an overall Hindi occupancy of 10.69% on Wednesday, January 7, 2026. The spy action thriller Dhurandhar features an esemble star cast including Ranveer Singh, Akshaye Khanna, Arjun Rampal, Sanjay Dutt, and R Madhavan in pivotal roles. The makers already announced its Part 2, which is set to be released on March 2026, clashing with Yash's Toxic A Fairytale for Grown-Ups. Dhurandhar set to beat RRR's worldwide collection According to industry tracker Sacnilk, Ranveer Singh and Akshaye Khanna's Dhurandhar is closing in on the worldwide collection of SS Rajamouli's RRR. So far, the Bollywood film has earned Rs 1,222 crore globally. For comparison, Jr NTR and Ram Charan's RRR has collected Rs 1,230 crore worldwide. Ikkis box office collection Dharmendra and Agastya Nanda's Ikkis collected Rs 1.15 crore on its seventh day at the Indian box office, bringing its total collection to Rs 24.25 crore. Sriram Raghavan's directorial opened with Rs 7 crore on its first day, followed by Rs 3.5 crore on Day 2, Rs 4.65 crore on Day 3, and 5 crore on Day 5. The film saw its first drop in earnings on Day 5, its first Monday, collecting Rs 1.35 crore. On Day 6, it earned Rs 1.6 crore. Also Read: YRF hails Dhurandhar for becoming highest-grossing Indian film; Ranveer Singh responds t",
            "images": [],
            "rank": 3
          },
          {
            "url": "https://www.sacnilk.com/news/Ranveer_Singhs_Dhurandhar_Faces_90_Crore_Revenue_Hit_Despite_Blockbuster_Status_Heres_Why",
            "content": "Ranveer Singh's Dhurandhar Faces 90 Crore Revenue Hit Despite Blockbuster Status; Here's Why - Sacnilk Sacnilk Special News Daily All India Gross Data [Only For Subscribed Users] All India Gross Live Data [Only For Subscribed Users] The Raja Saab First Day Advance Booking Report Jana Nayagan First Day Advance Booking Report Vijay's Jana Nayagan Postponed: A Big Advantage For Sivakarthikeyan-Starrer Parasakthi The Raja Saab Box Office Preview (Hindi): Prabhas-Starrer Heads For A Slow Start Ranveer Singh Starrer Dhurandhar Nears Pushpa 2 Record Ahead of The Second Part's Titanic Clash with Yash's Toxic Drishyam 3 Release Date: Jeethu Joseph Confirms Release Date of Mohanlal-Starrer OFFICIAL: Thalapathy Vijay's Jana Nayagan Postponed; Over 100 Crore in Advance Bookings Wiped Out? Big Advantage for Prabhas's The Raja Saab Vijay's Jana Nayagan Postponed After Censor Certificate Delay Box Office Links Box Office Collection Bollywood Box Office 2024 Tollywood Box Office 2024 Kollywood Box Office 2024 Mollywood Box Office 2024 Sandalwood Box Office 2024 Hollywood Box Office 2024 Gollywood Box Office 2024 Pollywood Box Office 2024 Bengali Box Office 2024 Marathi Box Office 2024 Articles Entertainment Bollywood Ranveer Singh's Dhurandhar Faces 90 Crore Revenue Hit Despite Blockbuster Status; Here's Why Views: 9778 | 01 Jan 2026 11:13:42 pm IST | By Christa Lincy Join Us on Google News Aditya Dhar's high-octane espionage thriller Dhurandhar has taken the global box office by storm, shattering records for Ranveer Singh. However, despite its historic collection and All Time Blockbuster verdict, the film has faced a massive financial setback in international territories. According to a verified report by Mid-day, the film has suffered a revenue loss of approximately 90 crore ($10.8 million). The significant deficit is attributed to the film being banned across the Middle East (Gulf countries). Overseas distributor Pranab Kapadia confirmed that the film did not receive clearance from the censor boards in the UAE, Saudi Arabia, Qatar, Kuwait, Bahrain, and Oman.\r The ban reportedly stems from the film's storyline, which involves an Indian intelligence operation targeting criminal syndicates in Karachi, Pakistan. Regional censors in the Gulf perceived the content as anti Pakistan, a trend previously seen with films like Fighter and Tiger 3. Given that the Middle East is a primary market for Indian action cinema, the absence of a theatrical release there resulted in a direct hit to the film's potential international gross. While 90 crore is a substantial figure that would have further bolstered the film's standing, trade experts suggest the blow was partially mitigated by the December holiday season. Pranab Kapadia noted that many Indian and Pakistani residents living in the Gulf were traveling to the UK, USA, and Canada during the year-end break, where they were able to watch the film on international screens. In North America alone, Dhurandhar has performed exceptionally well, earning over $17.5 million, which has helped offset the losses from the Middle East. Despite the ban, the film's massive Return on Investment (ROI) and record breaking run in India ensure it remains the biggest hit of the actor director duo's career. Despite the significant financial hit in the Gulf region, Dhurandhar continues to maintain an iron grip on the box office. As of its Day 28 (4th Thursday), the film showed remarkable holding power, earning 15 Cr to take its total India Net Collection to a massive 723.25 Cr. The film's overall financial health remains exceptional, with an India Gross Collection of 867.9 Cr and an Overseas Collection of 250 Cr. This brings its total Worldwide Collection to a towering 1117.9 Cr, solidifying its status as an All Time Blockbuster and proving that the film's domestic and other international markets successfully compensated for the missing 90 crore Middle East revenue. Tags Dhurandhar Ranveer Singh Aditya Dhar Akshaye Khanna Box",
            "images": [],
            "rank": 4
          },
          {
            "url": "https://www.livemint.com/entertainment/dhurandhar-box-office-collection-day-31-ranveer-singh-led-blockbuster-eyes-pushpa-2-s-worldwide-box-office-record-11767532105957.html",
            "content": "Dhurandhar Box Office Collection Day 31: Ranveer Singh-led blockbuster eyes Pushpa 2s worldwide box office record | Mint English Subscribe Sign in View Market Dashboard Home Latest News Markets Market News Stock Markets IPO US Markets Mark to Market Bonds Commodities Cryptocurrency Market Data Stock Pages Index pages Bullion Gold Silver Fuel Petrol Diesel News India World WSJ Economist US News Trends Premium e-paper Global Partners WSJ Economist Barron's Mint Specials Mint Explainers Mark to Market Long Story Plain Facts Snapview Sections Companies Technology Markets Personal Finance Mutual Funds Insurance Auto Industry Lounge Opinion Budget 2026 Companies Start-ups Company Results People Money Personal Finance Insurance Ask Mint Money Mutual Funds MyMint US Market Today Technology Gadgets Tech Reviews App News 5G Tech Foldable Smartphones Mint Hindi More Election 2025 Sports Cricket News Science Health Entertainment Tools IFSC Code Finder Income Tax Calculator Gold Rate Today Gold Rate in Delhi Gold Rate Hyderabad Silver Rate Today Silver Rate in Delhi Silver Rate in Bangalore US US Trending Hollywood Business Explore Mint About us Print subscription Subscriber terms of use Privacy Policy Terms of Use Disclaimer Mint code Cookie Policy Code of ethics Sitemap Contact Us Hindustan Times Live Hindustan Healthshots HT US News HT Auto HT Tech Nifty 50 Auto News Mint Money Hello User Sign in Sign Out My Account Subscribe My Watchlist Newsletters My Vouchers Notifications My Reads For You View Less - View More + Data Insights Market Dashboard Bullion Gold Silver Fuel Petrol Diesel Commodities Gold GoldM Aluminium Menthaoil Silver SilverMIC GoldPetal Natural Gas Copper Zinc SilverM CrudeOil GoldGinuea Lead Cryptocurrency Smart Money Gold Prices Today Gold Price in Delhi Gold Price in Mumbai Gold Price in Chennai Gold Price in Hyderabad Gold Price in Kolkata Silver Prices Today Silver Price in Delhi Silver Price in Mumbai Silver Price in Chennai Silver Price in Hyderabad Silver Price in Kolkata View Less - View More + Top Sections Latest News Today India News World News US News Today Markets Stock Markets IPO News US Stock Market Today Mark To Market Bonds Commodity News Cryptocurrency Companies IPO News Start-ups Company Results Top Company Leader Premium Money News Personal Finance Q&A Opinion Economy Technology News Gadgets Tech Reviews App News Personal Loan personal loan emi calculator Personal Loan Interest Rate Personal Loan Eligibility Business Loan Instant Personal Loan Brand Studio Oracle CXO Leaders DialogueCXO Leaders Dialogue Oracle CXO Leaders Dialogue Hyderabad Oracle Seamless Cloud Migration Oracle Scaling Ambitions Oracle Mastering Multi cloud Strategy Zoho The Long Game Thoughtworks Digital Banking Platform Journey Lentra The State of Credit Mirae Asset MF Winning Over Volatility PGIM India MF Amend, Adjust, Adapt Goalteller Personal Financial Strategies Oracle Unlock The Value of CX Microsoft Future Tech Series Zoho Navigating The Future Of Work Databricks Generation AI Series Microsoft Future Ready Salesforce Tech4good Awards Rolling with the Boss Fairfox The Unstoppables Focus View Less - View More + Premium Offerings e-paper WSJ Economist Barron's MyMint Mint Premium View Less - View More + Tools and Calculators IFSC Code Finder Income Tax Calculator SIP Calculator EMI Calculator Home Loan EMI Calculator Car Loan EMI NPS Calculator View Less - View More + MultiMedia Collections Videos Photos Podcasts View Less - View More + More From Mint Mint Lounge Mint Hindi Livehindustan Hindustan Times View Less - Explore Mint About Us Print Subscription Mint Authors Terms of Use Disclaimer Mint Code Code of ethics Cookie Policy Privacy Policy Privacy and cookie settings Subscriber - Terms of Use SITEMAP Contact Us Mint Apps View Less - View More + Copyright HT Digital Streams Limited All Rights Reserved. Dhurandhar Box Office Collection Day 31: Ranveer Singh-led blockbuster eyes Pushpa 2s worldwide box office record The",
            "images": [],
            "rank": 5
          }
        ],
        "annotations": null,
        "_meta": null
      }
    ]
  }
}