{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "1766472146",
    "original_query": "how much revenue does Indian Premier League makes every year? ",
    "file_manifest": [],
    "created_at": "2025-12-23T06:42:26.367883",
    "status": "completed",
    "globals_schema": {
      "ipl_annual_revenue_data_T001": {
        "content": [
          {
            "type": "text",
            "text": [
              {
                "url": "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
                "content": "The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) - BreakingGlobe Skip to content Tuesday, December 23, 2025 Responsive Menu About Us Disclaimer Privacy Policy Contact Us BreakingGlobe Search Search News Sports Entertainment Technology Home 2025 April 10 The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) Sports The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) 10 April 2025 breakingglobe.com When the Indian Premier League (IPL) was launched in 2008 by the Board of Control for Cricket in India (BCCI), few could have imagined the financial juggernaut it would become. What began as a bold experiment in franchise-based T20 cricket has evolved into one of the most profitable sporting leagues in the worldrivaling the likes of the NFL, NBA, and Premier League in terms of viewership, brand value, and revenue generation. Over nearly two decades, IPL has seen exponential growth in terms of broadcasting rights, sponsorship deals, franchise valuations, and digital monetization. Heres a comprehensive, year-wise journey through the leagues financial transformation from 2008 to 2025. 20082012: Humble Beginnings and Early Success 2008 The Launch Gross Revenue: 645 crore Net Profit: 51 crore Title Sponsor: DLF (40 crore/year) Broadcaster: Sony-WSG (10-year deal worth $1.026 billion) The inaugural season was a blockbuster success. The IPL immediately captured public imagination, thanks to its glamorous appeal, franchise culture, and star-studded matches. The revenue modelcomprising broadcasting rights, sponsorships, ticket sales, and merchandiseset a robust foundation. 20092012 Building Consistency Despite challenges like the 2009 season moving to South Africa due to elections, revenues held steady. The league maintained strong ad sales and increased franchise participation. Brand IPL began to attract global attention, especially with international players taking part. 20132015: Transition and Turbulence 2013 New Sponsorship & Growth Title Sponsor: PepsiCo (79.4 crore/year) PepsiCo signed a five-year deal, showing the IPLs growing appeal. However, 2013 also marked the start of controversies around spot-fixing, leading to a temporary dent in credibility. 20142015 Split Season & Sponsor Exit Part of the 2014 season was hosted in the UAE, again due to Indian general elections. Despite this, viewership and revenues remained stable. Pepsi eventually exited the sponsorship deal in 2015, cutting it short due to the ongoing controversies. 20162017: Commercial Reboot and Media Rights Evolution 2016 Vivo Steps In Title Sponsor: Vivo (100 crore/year) Chinese brand Vivo signed on as the title sponsor, signifying IPLs resilience and commercial trust. The league was recovering well and growing in confidence. 2017 Media Rights on the Horizon This year set the stage for a major shake-up in the IPLs commercial ecosystem. With digital consumption on the rise, interest in media rights surged. 20182022: Billion-Dollar League 2018 Star India Era Begins Media Rights (20182022): 16,347 crore Average Annual Media Revenue: ~3,270 crore Title Sponsor: Vivo (renewed for 439.8 crore/year) Star India acquired broadcasting rights, including TV and digital, for five years. This was a landmark moment, catapulting IPL into the billion-dollar league club. 20192021 COVID and Resilience Despite the pandemic disruptions in 2020 and 2021, IPL displayed extraordinary resilience. The tournament was held in the UAE and India under strict protocols. Digital viewership soared, compensating for ticket sale losses. 2021 Brand Value: ~$4.7 billion Rise of fantasy platforms and OTT consumption added new revenue streams. 20232025: Dominance, Digital Expansion, and Record Revenue 2023 Media Rights Skyrocket Media Rights (20232027): 48,390 crore (~$6.2 billion) TV Rights (Star): 23,575 crore Digital Rights (Viacom18): 20,500 crore Per Match Value: 118 crore (~$14.5 million) With each IPL match now valued higher than even some NFL and Premier League g",
                "images": [],
                "rank": 1
              },
              {
                "url": "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
                "content": "Indian Premier League - statistics & facts | Statista Skip to main content Statistics All Industries Go to All Industries Consumer Goods & FMCG Go to Consumer Goods & FMCG E-Commerce Go to E-Commerce Economy & Politics Go to Economy & Politics Energy & Environment Go to Energy & Environment Internet Go to Internet Technology & Telecommunications Go to Technology & Telecommunications Transportation & Logistics Go to Transportation & Logistics Travel, Tourism & Hospitality Go to Travel, Tourism & Hospitality Most viewed Statistics Recent Statistics Popular Statistics Most used social networks 2024, by number of users Big Mac index worldwide 2024 Global retail e-commerce sales 2014-2027 Car brand market share worldwide 2023 Quarterly Netflix subscribers count worldwide 2013-2024 Topics More Topics E-commerce worldwide - statistics & facts Social media - Statistics & Facts Top Report View Report Industry Overview Most viewed statistics Recent Statistics Popular Statistics Global sales of the top performance apparel, accessories, and footwear companies 2023 Nike's global revenue 2005-2024 Value of the secondhand apparel market worldwide from 2021 to 2028 Brand value of the most valuable soft drink brands worldwide 2023 Revenue of the leading 10 beauty manufacturers worldwide 2023 Topics Topic overview Global apparel market - statistics & facts Cosmetics industry - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics E-commerce as share of total retail sales worldwide 2021-2027 Biggest online retailers in the U.S. 2023, by market share Revenue of the e-commerce industry in the U.S. 2019-2029 Fastest-growing retail e-commerce countries 2023 Retail e-commerce sales growth worldwide 2017-2027 Topics Topic overview Amazon - statistics & facts E-commerce in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Biggest companies in the world by market value 2023 Largest armies in the world by active military personnel 2024 U.S. border patrol apprehensions and expulsions FY 1990-2023 Gross domestic product (GDP) in India 2029 Countries with the highest military spending 2023 Topics Topic overview Inflation worldwide - statistics & facts Global GDP - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Global household electricity prices 2023, by select country Annual global emissions of carbon dioxide 1940-2023 Monthly electricity prices in selected EU countries 2020-2024 EU-ETS allowance prices in the European Union 2022-2024 Renewable energy capacity 2023 by country Topics Topic overview Global waste generation - statistics & facts Global climate change - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Worldwide digital population 2024 Average daily time spent on social media worldwide 2012-2024 Facebook: quarterly number of MAU (monthly active users) worldwide 2008-2023 Social media: global penetration rate 2024, by region Instagram accounts with the most followers worldwide 2024 Topics Topic overview TikTok - statistics & facts Social media usage in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Quarterly smartphone market share worldwide by vendor 2009-2023 Apple's revenue worldwide 2004-2023 Global IT spending forecast 2012-2024, by segment Semiconductor market revenue worldwide 1987-2025 Digital transformation spending worldwide 2017-2027 Topics Topic overview Artificial intelligence (AI) worldwide - statistics & facts Smartphones - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Annual car sales worldwide 2010-2023, with a forecast for 2024 Monthly container freight rate index worldwide 2023-2024 Automotive manufacturers' estimated market share in the U.S. 2023 Global air traff",
                "images": [],
                "rank": 2
              },
              {
                "url": "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
                "content": "Crickets mammoth Indian Premier League Skip to main content World Business Legal Markets Breakingviews More The chart shows the valuation of the Indian Premier League in 2009 using squares. Each square represents $10 million. It rose to $3.3 billion in 2013. The chart shows the valuation of the Indian Premier League in 2009 and 2013 using squares. Each square represents $10 million. It crossed $5 billion in 2018. The chart shows the valuation of the Indian Premier League in 2009, 2013 and 2018 using squares. Each square represents $10 million. Its valuation more than doubled in six years and touched $12 billion in 2024. The chart shows the valuation of the Indian Premier League in 2009, 2013, 2018 and 2024 using squares. Each square represents $10 million. Graphics Crickets mammoth Indian Premier League By Sumanta Sen Published March 28, 202512:30 PM GMT+5:30 The months of April and May mean only one thing for Indias army of cricket fans: the Indian Premier League (IPL). Now in its 18th season, the IPL was crickets first franchise style league officially run by a cricket board. A franchise sports league is a tournament where teams are run like a business and can be privately owned. Leagues like soccers Premier League in England and basketballs National Basketball Association in the United States are domestic tournaments. Across all major sports played in the world, including soccer, American football, baseball and basketball, franchise-style leagues have long been almost as popular as international events. Not in cricket though. The sport is primarily played at international level among a handful of countries, most of them former colonies of Britain. The international governing body of cricket, the International Cricket Council (ICC), has 12 permanent members. It also has more than 90 associate member nations where the game is in various stages of development and popularity. While smaller than soccer, cricket is followed by over a billion people, the vast majority of them in south Asia. Fans in India account for more than 80% of crickets following globally. The graphic is a world map showing the full and associate members of the ICC. Full members are coloured in dark blue while associate members are coloured in light blue. With such massive popularity in India, it is not hard to understand that the sport is financially lucrative in the country. The Board of Control for Cricket in India (BCCI) wields the most influence in the sport. According to the ICCs revenue model agreed in 2023, the BCCI will take home nearly 40% of the ICCs annual net earnings from 2024 to 2027. All other boards receive a share less than 10%. The BCCIs earnings have also been substantially higher than its rivals. Its profit for the financial year ended March 2023, the latest year for which filings are available, was the highest at $160 million. In comparison, the South African cricket board recorded a profit of $45 million in the May 2023 to April 2024 period, a distant second. The graphic is a bar chart showing the latest available profits of various cricket boards. A report by the World Cricketers Association (WCA), an independent global players body in cricket, released on March 26, 2025called for an equitable revenue distribution system across cricket boards. Global crickets finances and distribution models are heavily imbalanced, self perpetuating, and do not effectively support global growth or competitive balance,\" it said. How it all started One of the reasons for the BCCIs riches is the IPL. Indias cricket board announced the Indian Premier League in 2007 around the time the inaugural edition of the Twenty20 (T20) Cricket World Cup was taking place. T20 was the newest format of the game, fast paced and played over three hours as opposed to the other two formats which take a whole day or five days. The first season was played in the Indian summer in 2008 over 44 days featuring eight Indian city-based franchises owned by some of the countrys riches",
                "images": [],
                "rank": 3
              },
              {
                "url": "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
                "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html\" on this server. Reference #18.8ed70b17.1767067472.c07c3e1a https://errors.edgesuite.net/18.8ed70b17.1767067472.c07c3e1a",
                "images": [],
                "rank": 4
              },
              {
                "url": "https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms",
                "content": "IPL a bigger hit, revenues surge - The Economic Times Benchmarks Nifty 26,027.30 -19.66 FEATURED FUNDS Motilal Oswal Midcap Fund Direct-Growth 5Y Return 30.1 % Invest Now FEATURED FUNDS UTI Aggressive Hybrid Fund Regular Plan-Growth 5Y Return 17.42 % Invest Now Enter search text: News English Edition English Edition     | Today's ePaper My Watchlist Subscribe Sign In Home ETPrime Markets Market Data Masterclass IPO News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu India WPL IPL 2026 Economy Economy Dashboard Agriculture Finance Foreign Trade Indicators Infrastructure Policy Politics Newsblogs Elections Assembly Elections Bihar More Sports Science GST 2.0 Defence Web Stories International US News Global Trends Trump Action Tracker Canada News UK News Australia New Zealand Saudi Arabia UAE Singapore Hong Kong Business World News ET Explains Company Corporate Trends Industry Trending Entertainment Decoded Morning Brief Podcast ET Evoke Bengaluru News Pune News Mumbai News Environment Videos Latest News Most Read Most Shared Most Commented Business News News Sports IPL a bigger hit, revenues surge The Economic Times daily newspaper is available online now. Read Today's Paper IPL a bigger hit, revenues surge SECTIONS IPL a bigger hit, revenues surge By Javed Farooqui , ET Bureau Last Updated: Dec 09, 2024, 10:46:00 AM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis The Indian Premier League (IPL) experienced remarkable financial growth in FY24, with the top 10 franchises more than doubling their combined revenue to 6,797 crore. A record-breaking media rights deal and lucrative sponsorships fueled this surge. Gujarat Titans led in revenue, closely followed by Mumbai Indians and Chennai Super Kings, while Punjab Kings emerged as the most profitable franchise. ANI IPL The Indian Premier League ( IPL ) is on a remarkable growth streak, with the top 10 franchises seeing their combined revenue more than double to 6,797 crore in FY24 from 3,082 crore in the previous year, according to financial data from Tofler. Experts attributed the surge to the leagues soaring commercial appeal, powered by smart media partnerships and lucrative sponsorship deals. The primary catalyst for growth was the record 48,390 crore media rights deal signed in 2022 between the Board of Control for Cricket in India (BCCI) and Disney Star and Viacom18, who have since combined to form JioStar. In addition to broadcasting revenue, the BCCI secured over 4,000 crore from multi-year sponsorship agreements with major brands, including Tata Group, My11Circle, Ceat , and AngelOne. According to a recent Brand Finance report, IPL's brand value has grown by 13% to reach $12 billion in 2024 compared to 2023, up from its $2 billion valuation in 2009. Notably, four franchisesChennai Super Kings (CSK), Mumbai Indians (MI), Royal Challengers Bangalore (RCB), and Kolkata Knight Riders (KKR)have crossed the $100 million mark in brand value. Live Events \"The three key drivers of growth for IPL teams are the central revenue pool, which includes media rights and sponsorship income, team-specific sponsorships, and gate revenue. In FY24, media rights income reached record levels, providing a substantial boost, said Ajimon Francis, managing director of Brand Finance India. Similarly, team sponsorships saw significant growth, contributing to increased financial stability. Additionally, gate revenue experienced a positive shift, driven by higher ticket prices and full capacity utilisation at stadiums, further enhancing overall revenue for IPL teams,\" he added. The financial performance of IPL franchises last fiscal marked a remarkable turnaround, with most teams reporting doubling of revenue and improved profitability. Leading the charge were Gujarat Titans (GT), MI, and CSK, who set new financial benchmarks, while Punjab Kings (PK) emerged as the most profitable franchise. GT, owned by CVC Capital",
                "images": [],
                "rank": 5
              }
            ],
            "annotations": null
          }
        ]
      },
      "ipl_annual_revenue_table_T002": {
        "summary_bullets": [
          "2008: Gross Revenue: 645 crore, Net Profit: 51 crore. Title Sponsor: DLF (40 crore/year), Broadcaster: Sony-WSG (10-year deal worth $1.026 billion)",
          "2009-2012: Revenues held steady despite the 2009 season moving to South Africa.",
          "2013: Title Sponsor: PepsiCo (79.4 crore/year)",
          "2014-2015: Viewership and revenues remained stable despite part of the 2014 season being hosted in the UAE. Pepsi exited sponsorship in 2015.",
          "2016: Title Sponsor: Vivo (100 crore/year)",
          "2018: Media Rights (2018-2022): 16,347 crore, Average Annual Media Revenue: ~3,270 crore, Title Sponsor: Vivo (renewed for 439.8 crore/year)",
          "2021: Brand Value: ~$4.7 billion",
          "2023: Media Rights (2023-2027): 48,390 crore (~$6.2 billion). TV Rights (Star): 23,575 crore, Digital Rights (Viacom18): 20,500 crore, Per Match Value: 118 crore (~$14.5 million)",
          "2024: Top 10 franchises combined revenue more than doubled to 6,797 crore. IPL's brand value has grown by 13% to reach $12 billion. Four franchises (CSK, MI, RCB, KKR) have crossed the $100 million mark in brand value."
        ]
      },
      "average_ipl_annual_revenue_T003": "393.07 Crore",
      "ipl_highest_revenue_year_T004": {
        "year": "2023",
        "revenue": "48,390 crore (Media Rights from 2023-2027)"
      },
      "ipl_lowest_revenue_year_T004": {
        "year": "2008",
        "revenue": "645 crore (Gross Revenue)"
      },
      "ipl_revenue_summary_T005": [
        "The IPL's average annual revenue is 393.07 Crore.",
        "The highest revenue year was 2023, with 48,390 crore (Media Rights from 2023-2027).",
        "The lowest revenue year was 2008, with 645 crore (Gross Revenue)."
      ],
      "ipl_revenue_report_T006": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0,
      "id": "ROOT"
    },
    {
      "description": "Formulate execution plan",
      "agent": "PlannerAgent",
      "status": "completed",
      "reads": [
        "original_query"
      ],
      "writes": [
        "plan_graph"
      ],
      "output": {
        "plan_graph": {
          "nodes": [
            {
              "id": "T001",
              "description": "Research total annual revenue of the Indian Premier League (IPL) from 2008 to 2024.",
              "agent": "RetrieverAgent",
              "agent_prompt": "Research the total annual revenue of the Indian Premier League (IPL) from its inception in 2008 to the most recent available year, 2024. Provide specific figures and sources for each year.",
              "reads": [],
              "writes": [
                "ipl_annual_revenue_data_T001"
              ]
            },
            {
              "id": "T002",
              "description": "Extract structured data of IPL annual revenue from the research results.",
              "agent": "DistillerAgent",
              "agent_prompt": "From the research data in `ipl_annual_revenue_data_T001`, extract the annual revenue figures for each year (2008-2024) and organize them into a structured format suitable for analysis. Note any missing years or data gaps.",
              "reads": [
                "ipl_annual_revenue_data_T001"
              ],
              "writes": [
                "ipl_annual_revenue_table_T002"
              ]
            },
            {
              "id": "T003",
              "description": "Calculate the average annual revenue of IPL based on the extracted data.",
              "agent": "CoderAgent",
              "agent_prompt": "Calculate the average annual revenue of the Indian Premier League (IPL) based on the structured data in `ipl_annual_revenue_table_T002`. Handle any missing values appropriately. Output the average revenue with appropriate units.",
              "reads": [
                "ipl_annual_revenue_table_T002"
              ],
              "writes": [
                "average_ipl_annual_revenue_T003"
              ]
            },
            {
              "id": "T004",
              "description": "Identify the highest and lowest revenue years for IPL.",
              "agent": "ThinkerAgent",
              "agent_prompt": "Analyze the `ipl_annual_revenue_table_T002` to identify the year with the highest revenue and the year with the lowest revenue for the Indian Premier League (IPL). Provide the specific revenue figures for these years.",
              "reads": [
                "ipl_annual_revenue_table_T002"
              ],
              "writes": [
                "ipl_highest_revenue_year_T004",
                "ipl_lowest_revenue_year_T004"
              ]
            },
            {
              "id": "T005",
              "description": "Summarize the IPL annual revenue data, including average, highest, and lowest revenue years.",
              "agent": "DistillerAgent",
              "agent_prompt": "Summarize the key findings regarding the Indian Premier League's (IPL) annual revenue. Include the average annual revenue from `average_ipl_annual_revenue_T003`, the highest revenue year from `ipl_highest_revenue_year_T004`, and the lowest revenue year from `ipl_lowest_revenue_year_T004`. Provide a concise overview of the IPL's financial performance.",
              "reads": [
                "average_ipl_annual_revenue_T003",
                "ipl_highest_revenue_year_T004",
                "ipl_lowest_revenue_year_T004"
              ],
              "writes": [
                "ipl_revenue_summary_T005"
              ]
            },
            {
              "id": "T006",
              "description": "Format the IPL revenue summary into a human-readable report.",
              "agent": "FormatterAgent",
              "agent_prompt": "Format the IPL revenue summary from `ipl_revenue_summary_T005` into a comprehensive and human-readable report. Include the annual revenue table (`ipl_annual_revenue_table_T002`), the calculated average annual revenue (`average_ipl_annual_revenue_T003`), the years with the highest and lowest revenues (`ipl_highest_revenue_year_T004` and `ipl_lowest_revenue_year_T004`). Present the data in a visually appealing and easily understandable format.",
              "reads": [
                "ipl_revenue_summary_T005",
                "ipl_annual_revenue_table_T002",
                "average_ipl_annual_revenue_T003",
                "ipl_highest_revenue_year_T004",
                "ipl_lowest_revenue_year_T004"
              ],
              "writes": [
                "ipl_revenue_report_T006"
              ]
            }
          ],
          "edges": [
            {
              "source": "ROOT",
              "target": "T001"
            },
            {
              "source": "T001",
              "target": "T002"
            },
            {
              "source": "T002",
              "target": "T003"
            },
            {
              "source": "T002",
              "target": "T004"
            },
            {
              "source": "T003",
              "target": "T005"
            },
            {
              "source": "T004",
              "target": "T005"
            },
            {
              "source": "T005",
              "target": "T006"
            }
          ]
        },
        "next_step_id": "T007",
        "cost": 0.00023140000000000001,
        "input_tokens": 30,
        "output_tokens": 571,
        "total_tokens": 601
      },
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": "2025-12-23T06:42:34.918270",
      "execution_time": 0.0,
      "id": "Query"
    },
    {
      "description": "Research total annual revenue of the Indian Premier League (IPL) from 2008 to 2024.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Research the total annual revenue of the Indian Premier League (IPL) from its inception in 2008 to the most recent available year, 2024. Provide specific figures and sources for each year.",
      "reads": [],
      "writes": [
        "ipl_annual_revenue_data_T001"
      ],
      "status": "completed",
      "output": {
        "ipl_annual_revenue_data_T001": [],
        "call_self": false,
        "code_variants": {
          "CODE_1A": "results = json.loads(search_web_with_text_content('Indian Premier League IPL annual revenue 2008 2024', 8))\nreturn {'ipl_annual_revenue_data_T001': results}",
          "CODE_1B": "urls = json.loads(fetch_search_urls('IPL revenue by year 2008 2024', 10))\nreturn {'ipl_annual_revenue_data_T001': urls}"
        },
        "cost": 2.72e-05,
        "input_tokens": 88,
        "output_tokens": 46,
        "total_tokens": 134,
        "execution_result": {
          "ipl_annual_revenue_data_T001": {
            "content": [
              {
                "type": "text",
                "text": [
                  {
                    "url": "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
                    "content": "The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) - BreakingGlobe Skip to content Tuesday, December 23, 2025 Responsive Menu About Us Disclaimer Privacy Policy Contact Us BreakingGlobe Search Search News Sports Entertainment Technology Home 2025 April 10 The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) Sports The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) 10 April 2025 breakingglobe.com When the Indian Premier League (IPL) was launched in 2008 by the Board of Control for Cricket in India (BCCI), few could have imagined the financial juggernaut it would become. What began as a bold experiment in franchise-based T20 cricket has evolved into one of the most profitable sporting leagues in the worldrivaling the likes of the NFL, NBA, and Premier League in terms of viewership, brand value, and revenue generation. Over nearly two decades, IPL has seen exponential growth in terms of broadcasting rights, sponsorship deals, franchise valuations, and digital monetization. Heres a comprehensive, year-wise journey through the leagues financial transformation from 2008 to 2025. 20082012: Humble Beginnings and Early Success 2008 The Launch Gross Revenue: 645 crore Net Profit: 51 crore Title Sponsor: DLF (40 crore/year) Broadcaster: Sony-WSG (10-year deal worth $1.026 billion) The inaugural season was a blockbuster success. The IPL immediately captured public imagination, thanks to its glamorous appeal, franchise culture, and star-studded matches. The revenue modelcomprising broadcasting rights, sponsorships, ticket sales, and merchandiseset a robust foundation. 20092012 Building Consistency Despite challenges like the 2009 season moving to South Africa due to elections, revenues held steady. The league maintained strong ad sales and increased franchise participation. Brand IPL began to attract global attention, especially with international players taking part. 20132015: Transition and Turbulence 2013 New Sponsorship & Growth Title Sponsor: PepsiCo (79.4 crore/year) PepsiCo signed a five-year deal, showing the IPLs growing appeal. However, 2013 also marked the start of controversies around spot-fixing, leading to a temporary dent in credibility. 20142015 Split Season & Sponsor Exit Part of the 2014 season was hosted in the UAE, again due to Indian general elections. Despite this, viewership and revenues remained stable. Pepsi eventually exited the sponsorship deal in 2015, cutting it short due to the ongoing controversies. 20162017: Commercial Reboot and Media Rights Evolution 2016 Vivo Steps In Title Sponsor: Vivo (100 crore/year) Chinese brand Vivo signed on as the title sponsor, signifying IPLs resilience and commercial trust. The league was recovering well and growing in confidence. 2017 Media Rights on the Horizon This year set the stage for a major shake-up in the IPLs commercial ecosystem. With digital consumption on the rise, interest in media rights surged. 20182022: Billion-Dollar League 2018 Star India Era Begins Media Rights (20182022): 16,347 crore Average Annual Media Revenue: ~3,270 crore Title Sponsor: Vivo (renewed for 439.8 crore/year) Star India acquired broadcasting rights, including TV and digital, for five years. This was a landmark moment, catapulting IPL into the billion-dollar league club. 20192021 COVID and Resilience Despite the pandemic disruptions in 2020 and 2021, IPL displayed extraordinary resilience. The tournament was held in the UAE and India under strict protocols. Digital viewership soared, compensating for ticket sale losses. 2021 Brand Value: ~$4.7 billion Rise of fantasy platforms and OTT consumption added new revenue streams. 20232025: Dominance, Digital Expansion, and Record Revenue 2023 Media Rights Skyrocket Media Rights (20232027): 48,390 crore (~$6.2 billion) TV Rights (Star): 23,575 crore Digital Rights (Viacom18): 20,500 crore Per Match Value: 118 crore (~$14.5 million) With each IPL match now valued higher than even some NFL and Premier League g",
                    "images": [],
                    "rank": 1
                  },
                  {
                    "url": "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
                    "content": "Indian Premier League - statistics & facts | Statista Skip to main content Statistics All Industries Go to All Industries Consumer Goods & FMCG Go to Consumer Goods & FMCG E-Commerce Go to E-Commerce Economy & Politics Go to Economy & Politics Energy & Environment Go to Energy & Environment Internet Go to Internet Technology & Telecommunications Go to Technology & Telecommunications Transportation & Logistics Go to Transportation & Logistics Travel, Tourism & Hospitality Go to Travel, Tourism & Hospitality Most viewed Statistics Recent Statistics Popular Statistics Most used social networks 2024, by number of users Big Mac index worldwide 2024 Global retail e-commerce sales 2014-2027 Car brand market share worldwide 2023 Quarterly Netflix subscribers count worldwide 2013-2024 Topics More Topics E-commerce worldwide - statistics & facts Social media - Statistics & Facts Top Report View Report Industry Overview Most viewed statistics Recent Statistics Popular Statistics Global sales of the top performance apparel, accessories, and footwear companies 2023 Nike's global revenue 2005-2024 Value of the secondhand apparel market worldwide from 2021 to 2028 Brand value of the most valuable soft drink brands worldwide 2023 Revenue of the leading 10 beauty manufacturers worldwide 2023 Topics Topic overview Global apparel market - statistics & facts Cosmetics industry - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics E-commerce as share of total retail sales worldwide 2021-2027 Biggest online retailers in the U.S. 2023, by market share Revenue of the e-commerce industry in the U.S. 2019-2029 Fastest-growing retail e-commerce countries 2023 Retail e-commerce sales growth worldwide 2017-2027 Topics Topic overview Amazon - statistics & facts E-commerce in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Biggest companies in the world by market value 2023 Largest armies in the world by active military personnel 2024 U.S. border patrol apprehensions and expulsions FY 1990-2023 Gross domestic product (GDP) in India 2029 Countries with the highest military spending 2023 Topics Topic overview Inflation worldwide - statistics & facts Global GDP - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Global household electricity prices 2023, by select country Annual global emissions of carbon dioxide 1940-2023 Monthly electricity prices in selected EU countries 2020-2024 EU-ETS allowance prices in the European Union 2022-2024 Renewable energy capacity 2023 by country Topics Topic overview Global waste generation - statistics & facts Global climate change - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Worldwide digital population 2024 Average daily time spent on social media worldwide 2012-2024 Facebook: quarterly number of MAU (monthly active users) worldwide 2008-2023 Social media: global penetration rate 2024, by region Instagram accounts with the most followers worldwide 2024 Topics Topic overview TikTok - statistics & facts Social media usage in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Quarterly smartphone market share worldwide by vendor 2009-2023 Apple's revenue worldwide 2004-2023 Global IT spending forecast 2012-2024, by segment Semiconductor market revenue worldwide 1987-2025 Digital transformation spending worldwide 2017-2027 Topics Topic overview Artificial intelligence (AI) worldwide - statistics & facts Smartphones - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Annual car sales worldwide 2010-2023, with a forecast for 2024 Monthly container freight rate index worldwide 2023-2024 Automotive manufacturers' estimated market share in the U.S. 2023 Global air traff",
                    "images": [],
                    "rank": 2
                  },
                  {
                    "url": "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
                    "content": "Crickets mammoth Indian Premier League Skip to main content World Business Legal Markets Breakingviews More The chart shows the valuation of the Indian Premier League in 2009 using squares. Each square represents $10 million. It rose to $3.3 billion in 2013. The chart shows the valuation of the Indian Premier League in 2009 and 2013 using squares. Each square represents $10 million. It crossed $5 billion in 2018. The chart shows the valuation of the Indian Premier League in 2009, 2013 and 2018 using squares. Each square represents $10 million. Its valuation more than doubled in six years and touched $12 billion in 2024. The chart shows the valuation of the Indian Premier League in 2009, 2013, 2018 and 2024 using squares. Each square represents $10 million. Graphics Crickets mammoth Indian Premier League By Sumanta Sen Published March 28, 202512:30 PM GMT+5:30 The months of April and May mean only one thing for Indias army of cricket fans: the Indian Premier League (IPL). Now in its 18th season, the IPL was crickets first franchise style league officially run by a cricket board. A franchise sports league is a tournament where teams are run like a business and can be privately owned. Leagues like soccers Premier League in England and basketballs National Basketball Association in the United States are domestic tournaments. Across all major sports played in the world, including soccer, American football, baseball and basketball, franchise-style leagues have long been almost as popular as international events. Not in cricket though. The sport is primarily played at international level among a handful of countries, most of them former colonies of Britain. The international governing body of cricket, the International Cricket Council (ICC), has 12 permanent members. It also has more than 90 associate member nations where the game is in various stages of development and popularity. While smaller than soccer, cricket is followed by over a billion people, the vast majority of them in south Asia. Fans in India account for more than 80% of crickets following globally. The graphic is a world map showing the full and associate members of the ICC. Full members are coloured in dark blue while associate members are coloured in light blue. With such massive popularity in India, it is not hard to understand that the sport is financially lucrative in the country. The Board of Control for Cricket in India (BCCI) wields the most influence in the sport. According to the ICCs revenue model agreed in 2023, the BCCI will take home nearly 40% of the ICCs annual net earnings from 2024 to 2027. All other boards receive a share less than 10%. The BCCIs earnings have also been substantially higher than its rivals. Its profit for the financial year ended March 2023, the latest year for which filings are available, was the highest at $160 million. In comparison, the South African cricket board recorded a profit of $45 million in the May 2023 to April 2024 period, a distant second. The graphic is a bar chart showing the latest available profits of various cricket boards. A report by the World Cricketers Association (WCA), an independent global players body in cricket, released on March 26, 2025called for an equitable revenue distribution system across cricket boards. Global crickets finances and distribution models are heavily imbalanced, self perpetuating, and do not effectively support global growth or competitive balance,\" it said. How it all started One of the reasons for the BCCIs riches is the IPL. Indias cricket board announced the Indian Premier League in 2007 around the time the inaugural edition of the Twenty20 (T20) Cricket World Cup was taking place. T20 was the newest format of the game, fast paced and played over three hours as opposed to the other two formats which take a whole day or five days. The first season was played in the Indian summer in 2008 over 44 days featuring eight Indian city-based franchises owned by some of the countrys riches",
                    "images": [],
                    "rank": 3
                  },
                  {
                    "url": "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
                    "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html\" on this server. Reference #18.8ed70b17.1767067472.c07c3e1a https://errors.edgesuite.net/18.8ed70b17.1767067472.c07c3e1a",
                    "images": [],
                    "rank": 4
                  },
                  {
                    "url": "https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms",
                    "content": "IPL a bigger hit, revenues surge - The Economic Times Benchmarks Nifty 26,027.30 -19.66 FEATURED FUNDS Motilal Oswal Midcap Fund Direct-Growth 5Y Return 30.1 % Invest Now FEATURED FUNDS UTI Aggressive Hybrid Fund Regular Plan-Growth 5Y Return 17.42 % Invest Now Enter search text: News English Edition English Edition     | Today's ePaper My Watchlist Subscribe Sign In Home ETPrime Markets Market Data Masterclass IPO News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu India WPL IPL 2026 Economy Economy Dashboard Agriculture Finance Foreign Trade Indicators Infrastructure Policy Politics Newsblogs Elections Assembly Elections Bihar More Sports Science GST 2.0 Defence Web Stories International US News Global Trends Trump Action Tracker Canada News UK News Australia New Zealand Saudi Arabia UAE Singapore Hong Kong Business World News ET Explains Company Corporate Trends Industry Trending Entertainment Decoded Morning Brief Podcast ET Evoke Bengaluru News Pune News Mumbai News Environment Videos Latest News Most Read Most Shared Most Commented Business News News Sports IPL a bigger hit, revenues surge The Economic Times daily newspaper is available online now. Read Today's Paper IPL a bigger hit, revenues surge SECTIONS IPL a bigger hit, revenues surge By Javed Farooqui , ET Bureau Last Updated: Dec 09, 2024, 10:46:00 AM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis The Indian Premier League (IPL) experienced remarkable financial growth in FY24, with the top 10 franchises more than doubling their combined revenue to 6,797 crore. A record-breaking media rights deal and lucrative sponsorships fueled this surge. Gujarat Titans led in revenue, closely followed by Mumbai Indians and Chennai Super Kings, while Punjab Kings emerged as the most profitable franchise. ANI IPL The Indian Premier League ( IPL ) is on a remarkable growth streak, with the top 10 franchises seeing their combined revenue more than double to 6,797 crore in FY24 from 3,082 crore in the previous year, according to financial data from Tofler. Experts attributed the surge to the leagues soaring commercial appeal, powered by smart media partnerships and lucrative sponsorship deals. The primary catalyst for growth was the record 48,390 crore media rights deal signed in 2022 between the Board of Control for Cricket in India (BCCI) and Disney Star and Viacom18, who have since combined to form JioStar. In addition to broadcasting revenue, the BCCI secured over 4,000 crore from multi-year sponsorship agreements with major brands, including Tata Group, My11Circle, Ceat , and AngelOne. According to a recent Brand Finance report, IPL's brand value has grown by 13% to reach $12 billion in 2024 compared to 2023, up from its $2 billion valuation in 2009. Notably, four franchisesChennai Super Kings (CSK), Mumbai Indians (MI), Royal Challengers Bangalore (RCB), and Kolkata Knight Riders (KKR)have crossed the $100 million mark in brand value. Live Events \"The three key drivers of growth for IPL teams are the central revenue pool, which includes media rights and sponsorship income, team-specific sponsorships, and gate revenue. In FY24, media rights income reached record levels, providing a substantial boost, said Ajimon Francis, managing director of Brand Finance India. Similarly, team sponsorships saw significant growth, contributing to increased financial stability. Additionally, gate revenue experienced a positive shift, driven by higher ticket prices and full capacity utilisation at stadiums, further enhancing overall revenue for IPL teams,\" he added. The financial performance of IPL franchises last fiscal marked a remarkable turnaround, with most teams reporting doubling of revenue and improved profitability. Leading the charge were Gujarat Titans (GT), MI, and CSK, who set new financial benchmarks, while Punjab Kings (PK) emerged as the most profitable franchise. GT, owned by CVC Capital",
                    "images": [],
                    "rank": 5
                  }
                ],
                "annotations": null
              }
            ]
          }
        },
        "execution_status": "success",
        "execution_error": null,
        "execution_time": "2025-12-30 09:34:25",
        "executed_variant": "CODE_1A",
        "execution_logs": ""
      },
      "error": null,
      "cost": 4.210000000000001e-05,
      "start_time": "2025-12-23T06:42:34.924426",
      "end_time": "2025-12-23T06:42:43.656550",
      "execution_time": 8.732124,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "ipl_annual_revenue_data_T001": [],
            "call_self": true,
            "next_instruction": "Extract specific annual revenue figures and their sources for each year from the search results.",
            "iteration_context": {
              "current_step": "search_ipl_revenue",
              "next_step": "extract_revenue_details"
            },
            "code_variants": {
              "CODE_1A": "urls = fetch_search_urls('Indian Premier League IPL annual revenue 2008-2024', 10)\nreturn {'ipl_urls_1A': urls}",
              "CODE_1B": "results = search_web_with_text_content('IPL revenue year by year 2008 to 2024 statistics', 8)\nreturn {'ipl_annual_revenue_data_T001': results}"
            },
            "cost": 3.84e-05,
            "input_tokens": 60,
            "output_tokens": 81,
            "total_tokens": 141
          },
          "execution_result": {
            "status": "success",
            "result": {
              "ipl_urls_1A": "['https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/', 'https://www.statista.com/topics/4543/indian-premier-league-ipl/', 'https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms', 'https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html', 'https://www.timesnownews.com/business-economy/industry/how-ipl-makes-money-breaking-down-multi-billion-dollar-indian-premier-league-cricket-business-article-110461871', 'https://medium.com/@theunitedindian500/ipl-revenue-per-year-4d740fa8a77e', 'https://finvests.in/ipl-winners-2008-to-2025-titles-captains-earnings/', 'https://www.kreedon.com/indian-premier-league-ipl-revenue-growth-breaking-down-the-numbers', 'https://en.wikipedia.org/wiki/List_of_Indian_Premier_League_records_and_statistics', 'https://blog.privatecircle.co/the-business-behind-the-ipl-sponsorships-revenues-and-the-rise-of-cricket-economics-fy24-deep-dive/']"
            },
            "raw": {
              "ipl_urls_1A": "['https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/', 'https://www.statista.com/topics/4543/indian-premier-league-ipl/', 'https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms', 'https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html', 'https://www.timesnownews.com/business-economy/industry/how-ipl-makes-money-breaking-down-multi-billion-dollar-indian-premier-league-cricket-business-article-110461871', 'https://medium.com/@theunitedindian500/ipl-revenue-per-year-4d740fa8a77e', 'https://finvests.in/ipl-winners-2008-to-2025-titles-captains-earnings/', 'https://www.kreedon.com/indian-premier-league-ipl-revenue-growth-breaking-down-the-numbers', 'https://en.wikipedia.org/wiki/List_of_Indian_Premier_League_records_and_statistics', 'https://blog.privatecircle.co/the-business-behind-the-ipl-sponsorships-revenues-and-the-rise-of-cricket-economics-fy24-deep-dive/']"
            },
            "logs": "",
            "execution_time": "2025-12-23 12:12:37",
            "total_time": "1.024",
            "executed_variant": "CODE_1A"
          }
        },
        {
          "iteration": 2,
          "output": {
            "ipl_annual_revenue_data_T001": [],
            "call_self": false,
            "code_variants": {
              "CODE_2A": "results = []\nfor url in ipl_urls_1A[:5]:\n    content = webpage_url_to_raw_text(url)\n    results.append({'url': url, 'content': content})\nreturn {'ipl_annual_revenue_data_T001': results}",
              "CODE_2B": "details = []\nfor url in ipl_urls_1A[:3]:\n    info = webpage_url_to_llm_summary(url, 'Extract specific annual revenue figures and their sources for each year')\n    details.append(info)\nreturn {'ipl_annual_revenue_data_T001': details}"
            },
            "cost": 4.210000000000001e-05,
            "input_tokens": 153,
            "output_tokens": 67,
            "total_tokens": 220
          },
          "execution_result": {
            "status": "success",
            "result": {
              "ipl_annual_revenue_data_T001": {
                "content": [
                  {
                    "type": "text",
                    "text": [
                      {
                        "url": "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
                        "content": "The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) - BreakingGlobe Skip to content Tuesday, December 23, 2025 Responsive Menu About Us Disclaimer Privacy Policy Contact Us BreakingGlobe Search Search News Sports Entertainment Technology Home 2025 April 10 The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) Sports The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) 10 April 2025 breakingglobe.com When the Indian Premier League (IPL) was launched in 2008 by the Board of Control for Cricket in India (BCCI), few could have imagined the financial juggernaut it would become. What began as a bold experiment in franchise-based T20 cricket has evolved into one of the most profitable sporting leagues in the worldrivaling the likes of the NFL, NBA, and Premier League in terms of viewership, brand value, and revenue generation. Over nearly two decades, IPL has seen exponential growth in terms of broadcasting rights, sponsorship deals, franchise valuations, and digital monetization. Heres a comprehensive, year-wise journey through the leagues financial transformation from 2008 to 2025. 20082012: Humble Beginnings and Early Success 2008 The Launch Gross Revenue: 645 crore Net Profit: 51 crore Title Sponsor: DLF (40 crore/year) Broadcaster: Sony-WSG (10-year deal worth $1.026 billion) The inaugural season was a blockbuster success. The IPL immediately captured public imagination, thanks to its glamorous appeal, franchise culture, and star-studded matches. The revenue modelcomprising broadcasting rights, sponsorships, ticket sales, and merchandiseset a robust foundation. 20092012 Building Consistency Despite challenges like the 2009 season moving to South Africa due to elections, revenues held steady. The league maintained strong ad sales and increased franchise participation. Brand IPL began to attract global attention, especially with international players taking part. 20132015: Transition and Turbulence 2013 New Sponsorship & Growth Title Sponsor: PepsiCo (79.4 crore/year) PepsiCo signed a five-year deal, showing the IPLs growing appeal. However, 2013 also marked the start of controversies around spot-fixing, leading to a temporary dent in credibility. 20142015 Split Season & Sponsor Exit Part of the 2014 season was hosted in the UAE, again due to Indian general elections. Despite this, viewership and revenues remained stable. Pepsi eventually exited the sponsorship deal in 2015, cutting it short due to the ongoing controversies. 20162017: Commercial Reboot and Media Rights Evolution 2016 Vivo Steps In Title Sponsor: Vivo (100 crore/year) Chinese brand Vivo signed on as the title sponsor, signifying IPLs resilience and commercial trust. The league was recovering well and growing in confidence. 2017 Media Rights on the Horizon This year set the stage for a major shake-up in the IPLs commercial ecosystem. With digital consumption on the rise, interest in media rights surged. 20182022: Billion-Dollar League 2018 Star India Era Begins Media Rights (20182022): 16,347 crore Average Annual Media Revenue: ~3,270 crore Title Sponsor: Vivo (renewed for 439.8 crore/year) Star India acquired broadcasting rights, including TV and digital, for five years. This was a landmark moment, catapulting IPL into the billion-dollar league club. 20192021 COVID and Resilience Despite the pandemic disruptions in 2020 and 2021, IPL displayed extraordinary resilience. The tournament was held in the UAE and India under strict protocols. Digital viewership soared, compensating for ticket sale losses. 2021 Brand Value: ~$4.7 billion Rise of fantasy platforms and OTT consumption added new revenue streams. 20232025: Dominance, Digital Expansion, and Record Revenue 2023 Media Rights Skyrocket Media Rights (20232027): 48,390 crore (~$6.2 billion) TV Rights (Star): 23,575 crore Digital Rights (Viacom18): 20,500 crore Per Match Value: 118 crore (~$14.5 million) With each IPL match now valued higher than even some NFL and Premier League g",
                        "images": [],
                        "rank": 1
                      },
                      {
                        "url": "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
                        "content": "Indian Premier League - statistics & facts | Statista Skip to main content Statistics All Industries Go to All Industries Consumer Goods & FMCG Go to Consumer Goods & FMCG E-Commerce Go to E-Commerce Economy & Politics Go to Economy & Politics Energy & Environment Go to Energy & Environment Internet Go to Internet Technology & Telecommunications Go to Technology & Telecommunications Transportation & Logistics Go to Transportation & Logistics Travel, Tourism & Hospitality Go to Travel, Tourism & Hospitality Most viewed Statistics Recent Statistics Popular Statistics Most used social networks 2024, by number of users Big Mac index worldwide 2024 Global retail e-commerce sales 2014-2027 Car brand market share worldwide 2023 Quarterly Netflix subscribers count worldwide 2013-2024 Topics More Topics E-commerce worldwide - statistics & facts Social media - Statistics & Facts Top Report View Report Industry Overview Most viewed statistics Recent Statistics Popular Statistics Global sales of the top performance apparel, accessories, and footwear companies 2023 Nike's global revenue 2005-2024 Value of the secondhand apparel market worldwide from 2021 to 2028 Brand value of the most valuable soft drink brands worldwide 2023 Revenue of the leading 10 beauty manufacturers worldwide 2023 Topics Topic overview Global apparel market - statistics & facts Cosmetics industry - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics E-commerce as share of total retail sales worldwide 2021-2027 Biggest online retailers in the U.S. 2023, by market share Revenue of the e-commerce industry in the U.S. 2019-2029 Fastest-growing retail e-commerce countries 2023 Retail e-commerce sales growth worldwide 2017-2027 Topics Topic overview Amazon - statistics & facts E-commerce in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Biggest companies in the world by market value 2023 Largest armies in the world by active military personnel 2024 U.S. border patrol apprehensions and expulsions FY 1990-2023 Gross domestic product (GDP) in India 2029 Countries with the highest military spending 2023 Topics Topic overview Inflation worldwide - statistics & facts Global GDP - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Global household electricity prices 2023, by select country Annual global emissions of carbon dioxide 1940-2023 Monthly electricity prices in selected EU countries 2020-2024 EU-ETS allowance prices in the European Union 2022-2024 Renewable energy capacity 2023 by country Topics Topic overview Global waste generation - statistics & facts Global climate change - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Worldwide digital population 2024 Average daily time spent on social media worldwide 2012-2024 Facebook: quarterly number of MAU (monthly active users) worldwide 2008-2023 Social media: global penetration rate 2024, by region Instagram accounts with the most followers worldwide 2024 Topics Topic overview TikTok - statistics & facts Social media usage in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Quarterly smartphone market share worldwide by vendor 2009-2023 Apple's revenue worldwide 2004-2023 Global IT spending forecast 2012-2024, by segment Semiconductor market revenue worldwide 1987-2025 Digital transformation spending worldwide 2017-2027 Topics Topic overview Artificial intelligence (AI) worldwide - statistics & facts Smartphones - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Annual car sales worldwide 2010-2023, with a forecast for 2024 Monthly container freight rate index worldwide 2023-2024 Automotive manufacturers' estimated market share in the U.S. 2023 Global air traff",
                        "images": [],
                        "rank": 2
                      },
                      {
                        "url": "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
                        "content": "Crickets mammoth Indian Premier League Skip to main content World Business Legal Markets Breakingviews More The chart shows the valuation of the Indian Premier League in 2009 using squares. Each square represents $10 million. It rose to $3.3 billion in 2013. The chart shows the valuation of the Indian Premier League in 2009 and 2013 using squares. Each square represents $10 million. It crossed $5 billion in 2018. The chart shows the valuation of the Indian Premier League in 2009, 2013 and 2018 using squares. Each square represents $10 million. Its valuation more than doubled in six years and touched $12 billion in 2024. The chart shows the valuation of the Indian Premier League in 2009, 2013, 2018 and 2024 using squares. Each square represents $10 million. Graphics Crickets mammoth Indian Premier League By Sumanta Sen Published March 28, 202512:30 PM GMT+5:30 The months of April and May mean only one thing for Indias army of cricket fans: the Indian Premier League (IPL). Now in its 18th season, the IPL was crickets first franchise style league officially run by a cricket board. A franchise sports league is a tournament where teams are run like a business and can be privately owned. Leagues like soccers Premier League in England and basketballs National Basketball Association in the United States are domestic tournaments. Across all major sports played in the world, including soccer, American football, baseball and basketball, franchise-style leagues have long been almost as popular as international events. Not in cricket though. The sport is primarily played at international level among a handful of countries, most of them former colonies of Britain. The international governing body of cricket, the International Cricket Council (ICC), has 12 permanent members. It also has more than 90 associate member nations where the game is in various stages of development and popularity. While smaller than soccer, cricket is followed by over a billion people, the vast majority of them in south Asia. Fans in India account for more than 80% of crickets following globally. The graphic is a world map showing the full and associate members of the ICC. Full members are coloured in dark blue while associate members are coloured in light blue. With such massive popularity in India, it is not hard to understand that the sport is financially lucrative in the country. The Board of Control for Cricket in India (BCCI) wields the most influence in the sport. According to the ICCs revenue model agreed in 2023, the BCCI will take home nearly 40% of the ICCs annual net earnings from 2024 to 2027. All other boards receive a share less than 10%. The BCCIs earnings have also been substantially higher than its rivals. Its profit for the financial year ended March 2023, the latest year for which filings are available, was the highest at $160 million. In comparison, the South African cricket board recorded a profit of $45 million in the May 2023 to April 2024 period, a distant second. The graphic is a bar chart showing the latest available profits of various cricket boards. A report by the World Cricketers Association (WCA), an independent global players body in cricket, released on March 26, 2025called for an equitable revenue distribution system across cricket boards. Global crickets finances and distribution models are heavily imbalanced, self perpetuating, and do not effectively support global growth or competitive balance,\" it said. How it all started One of the reasons for the BCCIs riches is the IPL. Indias cricket board announced the Indian Premier League in 2007 around the time the inaugural edition of the Twenty20 (T20) Cricket World Cup was taking place. T20 was the newest format of the game, fast paced and played over three hours as opposed to the other two formats which take a whole day or five days. The first season was played in the Indian summer in 2008 over 44 days featuring eight Indian city-based franchises owned by some of the countrys riches",
                        "images": [],
                        "rank": 3
                      },
                      {
                        "url": "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
                        "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html\" on this server. Reference #18.8ed70b17.1767067472.c07c3e1a https://errors.edgesuite.net/18.8ed70b17.1767067472.c07c3e1a",
                        "images": [],
                        "rank": 4
                      },
                      {
                        "url": "https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms",
                        "content": "IPL a bigger hit, revenues surge - The Economic Times Benchmarks Nifty 26,027.30 -19.66 FEATURED FUNDS Motilal Oswal Midcap Fund Direct-Growth 5Y Return 30.1 % Invest Now FEATURED FUNDS UTI Aggressive Hybrid Fund Regular Plan-Growth 5Y Return 17.42 % Invest Now Enter search text: News English Edition English Edition     | Today's ePaper My Watchlist Subscribe Sign In Home ETPrime Markets Market Data Masterclass IPO News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu India WPL IPL 2026 Economy Economy Dashboard Agriculture Finance Foreign Trade Indicators Infrastructure Policy Politics Newsblogs Elections Assembly Elections Bihar More Sports Science GST 2.0 Defence Web Stories International US News Global Trends Trump Action Tracker Canada News UK News Australia New Zealand Saudi Arabia UAE Singapore Hong Kong Business World News ET Explains Company Corporate Trends Industry Trending Entertainment Decoded Morning Brief Podcast ET Evoke Bengaluru News Pune News Mumbai News Environment Videos Latest News Most Read Most Shared Most Commented Business News News Sports IPL a bigger hit, revenues surge The Economic Times daily newspaper is available online now. Read Today's Paper IPL a bigger hit, revenues surge SECTIONS IPL a bigger hit, revenues surge By Javed Farooqui , ET Bureau Last Updated: Dec 09, 2024, 10:46:00 AM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis The Indian Premier League (IPL) experienced remarkable financial growth in FY24, with the top 10 franchises more than doubling their combined revenue to 6,797 crore. A record-breaking media rights deal and lucrative sponsorships fueled this surge. Gujarat Titans led in revenue, closely followed by Mumbai Indians and Chennai Super Kings, while Punjab Kings emerged as the most profitable franchise. ANI IPL The Indian Premier League ( IPL ) is on a remarkable growth streak, with the top 10 franchises seeing their combined revenue more than double to 6,797 crore in FY24 from 3,082 crore in the previous year, according to financial data from Tofler. Experts attributed the surge to the leagues soaring commercial appeal, powered by smart media partnerships and lucrative sponsorship deals. The primary catalyst for growth was the record 48,390 crore media rights deal signed in 2022 between the Board of Control for Cricket in India (BCCI) and Disney Star and Viacom18, who have since combined to form JioStar. In addition to broadcasting revenue, the BCCI secured over 4,000 crore from multi-year sponsorship agreements with major brands, including Tata Group, My11Circle, Ceat , and AngelOne. According to a recent Brand Finance report, IPL's brand value has grown by 13% to reach $12 billion in 2024 compared to 2023, up from its $2 billion valuation in 2009. Notably, four franchisesChennai Super Kings (CSK), Mumbai Indians (MI), Royal Challengers Bangalore (RCB), and Kolkata Knight Riders (KKR)have crossed the $100 million mark in brand value. Live Events \"The three key drivers of growth for IPL teams are the central revenue pool, which includes media rights and sponsorship income, team-specific sponsorships, and gate revenue. In FY24, media rights income reached record levels, providing a substantial boost, said Ajimon Francis, managing director of Brand Finance India. Similarly, team sponsorships saw significant growth, contributing to increased financial stability. Additionally, gate revenue experienced a positive shift, driven by higher ticket prices and full capacity utilisation at stadiums, further enhancing overall revenue for IPL teams,\" he added. The financial performance of IPL franchises last fiscal marked a remarkable turnaround, with most teams reporting doubling of revenue and improved profitability. Leading the charge were Gujarat Titans (GT), MI, and CSK, who set new financial benchmarks, while Punjab Kings (PK) emerged as the most profitable franchise. GT, owned by CVC Capital",
                        "images": [],
                        "rank": 5
                      }
                    ],
                    "annotations": null
                  }
                ]
              }
            },
            "raw": {
              "ipl_annual_revenue_data_T001": {
                "content": [
                  {
                    "type": "text",
                    "text": [
                      {
                        "url": "https://breakingglobe.com/index.php/2025/04/10/ipl-year-wise-revenue-growth-2008-2/",
                        "content": "The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) - BreakingGlobe Skip to content Tuesday, December 23, 2025 Responsive Menu About Us Disclaimer Privacy Policy Contact Us BreakingGlobe Search Search News Sports Entertainment Technology Home 2025 April 10 The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) Sports The Meteoric Rise of IPL: Year-Wise Revenue Growth (20082025) 10 April 2025 breakingglobe.com When the Indian Premier League (IPL) was launched in 2008 by the Board of Control for Cricket in India (BCCI), few could have imagined the financial juggernaut it would become. What began as a bold experiment in franchise-based T20 cricket has evolved into one of the most profitable sporting leagues in the worldrivaling the likes of the NFL, NBA, and Premier League in terms of viewership, brand value, and revenue generation. Over nearly two decades, IPL has seen exponential growth in terms of broadcasting rights, sponsorship deals, franchise valuations, and digital monetization. Heres a comprehensive, year-wise journey through the leagues financial transformation from 2008 to 2025. 20082012: Humble Beginnings and Early Success 2008 The Launch Gross Revenue: 645 crore Net Profit: 51 crore Title Sponsor: DLF (40 crore/year) Broadcaster: Sony-WSG (10-year deal worth $1.026 billion) The inaugural season was a blockbuster success. The IPL immediately captured public imagination, thanks to its glamorous appeal, franchise culture, and star-studded matches. The revenue modelcomprising broadcasting rights, sponsorships, ticket sales, and merchandiseset a robust foundation. 20092012 Building Consistency Despite challenges like the 2009 season moving to South Africa due to elections, revenues held steady. The league maintained strong ad sales and increased franchise participation. Brand IPL began to attract global attention, especially with international players taking part. 20132015: Transition and Turbulence 2013 New Sponsorship & Growth Title Sponsor: PepsiCo (79.4 crore/year) PepsiCo signed a five-year deal, showing the IPLs growing appeal. However, 2013 also marked the start of controversies around spot-fixing, leading to a temporary dent in credibility. 20142015 Split Season & Sponsor Exit Part of the 2014 season was hosted in the UAE, again due to Indian general elections. Despite this, viewership and revenues remained stable. Pepsi eventually exited the sponsorship deal in 2015, cutting it short due to the ongoing controversies. 20162017: Commercial Reboot and Media Rights Evolution 2016 Vivo Steps In Title Sponsor: Vivo (100 crore/year) Chinese brand Vivo signed on as the title sponsor, signifying IPLs resilience and commercial trust. The league was recovering well and growing in confidence. 2017 Media Rights on the Horizon This year set the stage for a major shake-up in the IPLs commercial ecosystem. With digital consumption on the rise, interest in media rights surged. 20182022: Billion-Dollar League 2018 Star India Era Begins Media Rights (20182022): 16,347 crore Average Annual Media Revenue: ~3,270 crore Title Sponsor: Vivo (renewed for 439.8 crore/year) Star India acquired broadcasting rights, including TV and digital, for five years. This was a landmark moment, catapulting IPL into the billion-dollar league club. 20192021 COVID and Resilience Despite the pandemic disruptions in 2020 and 2021, IPL displayed extraordinary resilience. The tournament was held in the UAE and India under strict protocols. Digital viewership soared, compensating for ticket sale losses. 2021 Brand Value: ~$4.7 billion Rise of fantasy platforms and OTT consumption added new revenue streams. 20232025: Dominance, Digital Expansion, and Record Revenue 2023 Media Rights Skyrocket Media Rights (20232027): 48,390 crore (~$6.2 billion) TV Rights (Star): 23,575 crore Digital Rights (Viacom18): 20,500 crore Per Match Value: 118 crore (~$14.5 million) With each IPL match now valued higher than even some NFL and Premier League g",
                        "images": [],
                        "rank": 1
                      },
                      {
                        "url": "https://www.statista.com/topics/4543/indian-premier-league-ipl/",
                        "content": "Indian Premier League - statistics & facts | Statista Skip to main content Statistics All Industries Go to All Industries Consumer Goods & FMCG Go to Consumer Goods & FMCG E-Commerce Go to E-Commerce Economy & Politics Go to Economy & Politics Energy & Environment Go to Energy & Environment Internet Go to Internet Technology & Telecommunications Go to Technology & Telecommunications Transportation & Logistics Go to Transportation & Logistics Travel, Tourism & Hospitality Go to Travel, Tourism & Hospitality Most viewed Statistics Recent Statistics Popular Statistics Most used social networks 2024, by number of users Big Mac index worldwide 2024 Global retail e-commerce sales 2014-2027 Car brand market share worldwide 2023 Quarterly Netflix subscribers count worldwide 2013-2024 Topics More Topics E-commerce worldwide - statistics & facts Social media - Statistics & Facts Top Report View Report Industry Overview Most viewed statistics Recent Statistics Popular Statistics Global sales of the top performance apparel, accessories, and footwear companies 2023 Nike's global revenue 2005-2024 Value of the secondhand apparel market worldwide from 2021 to 2028 Brand value of the most valuable soft drink brands worldwide 2023 Revenue of the leading 10 beauty manufacturers worldwide 2023 Topics Topic overview Global apparel market - statistics & facts Cosmetics industry - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics E-commerce as share of total retail sales worldwide 2021-2027 Biggest online retailers in the U.S. 2023, by market share Revenue of the e-commerce industry in the U.S. 2019-2029 Fastest-growing retail e-commerce countries 2023 Retail e-commerce sales growth worldwide 2017-2027 Topics Topic overview Amazon - statistics & facts E-commerce in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Biggest companies in the world by market value 2023 Largest armies in the world by active military personnel 2024 U.S. border patrol apprehensions and expulsions FY 1990-2023 Gross domestic product (GDP) in India 2029 Countries with the highest military spending 2023 Topics Topic overview Inflation worldwide - statistics & facts Global GDP - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Global household electricity prices 2023, by select country Annual global emissions of carbon dioxide 1940-2023 Monthly electricity prices in selected EU countries 2020-2024 EU-ETS allowance prices in the European Union 2022-2024 Renewable energy capacity 2023 by country Topics Topic overview Global waste generation - statistics & facts Global climate change - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Worldwide digital population 2024 Average daily time spent on social media worldwide 2012-2024 Facebook: quarterly number of MAU (monthly active users) worldwide 2008-2023 Social media: global penetration rate 2024, by region Instagram accounts with the most followers worldwide 2024 Topics Topic overview TikTok - statistics & facts Social media usage in the United Kingdom (UK) - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Quarterly smartphone market share worldwide by vendor 2009-2023 Apple's revenue worldwide 2004-2023 Global IT spending forecast 2012-2024, by segment Semiconductor market revenue worldwide 1987-2025 Digital transformation spending worldwide 2017-2027 Topics Topic overview Artificial intelligence (AI) worldwide - statistics & facts Smartphones - statistics & facts Top Report View Report Most viewed statistics Recent Statistics Popular Statistics Annual car sales worldwide 2010-2023, with a forecast for 2024 Monthly container freight rate index worldwide 2023-2024 Automotive manufacturers' estimated market share in the U.S. 2023 Global air traff",
                        "images": [],
                        "rank": 2
                      },
                      {
                        "url": "https://www.reuters.com/graphics/CRICKET-IPL/mypmjbzrgvr/",
                        "content": "Crickets mammoth Indian Premier League Skip to main content World Business Legal Markets Breakingviews More The chart shows the valuation of the Indian Premier League in 2009 using squares. Each square represents $10 million. It rose to $3.3 billion in 2013. The chart shows the valuation of the Indian Premier League in 2009 and 2013 using squares. Each square represents $10 million. It crossed $5 billion in 2018. The chart shows the valuation of the Indian Premier League in 2009, 2013 and 2018 using squares. Each square represents $10 million. Its valuation more than doubled in six years and touched $12 billion in 2024. The chart shows the valuation of the Indian Premier League in 2009, 2013, 2018 and 2024 using squares. Each square represents $10 million. Graphics Crickets mammoth Indian Premier League By Sumanta Sen Published March 28, 202512:30 PM GMT+5:30 The months of April and May mean only one thing for Indias army of cricket fans: the Indian Premier League (IPL). Now in its 18th season, the IPL was crickets first franchise style league officially run by a cricket board. A franchise sports league is a tournament where teams are run like a business and can be privately owned. Leagues like soccers Premier League in England and basketballs National Basketball Association in the United States are domestic tournaments. Across all major sports played in the world, including soccer, American football, baseball and basketball, franchise-style leagues have long been almost as popular as international events. Not in cricket though. The sport is primarily played at international level among a handful of countries, most of them former colonies of Britain. The international governing body of cricket, the International Cricket Council (ICC), has 12 permanent members. It also has more than 90 associate member nations where the game is in various stages of development and popularity. While smaller than soccer, cricket is followed by over a billion people, the vast majority of them in south Asia. Fans in India account for more than 80% of crickets following globally. The graphic is a world map showing the full and associate members of the ICC. Full members are coloured in dark blue while associate members are coloured in light blue. With such massive popularity in India, it is not hard to understand that the sport is financially lucrative in the country. The Board of Control for Cricket in India (BCCI) wields the most influence in the sport. According to the ICCs revenue model agreed in 2023, the BCCI will take home nearly 40% of the ICCs annual net earnings from 2024 to 2027. All other boards receive a share less than 10%. The BCCIs earnings have also been substantially higher than its rivals. Its profit for the financial year ended March 2023, the latest year for which filings are available, was the highest at $160 million. In comparison, the South African cricket board recorded a profit of $45 million in the May 2023 to April 2024 period, a distant second. The graphic is a bar chart showing the latest available profits of various cricket boards. A report by the World Cricketers Association (WCA), an independent global players body in cricket, released on March 26, 2025called for an equitable revenue distribution system across cricket boards. Global crickets finances and distribution models are heavily imbalanced, self perpetuating, and do not effectively support global growth or competitive balance,\" it said. How it all started One of the reasons for the BCCIs riches is the IPL. Indias cricket board announced the Indian Premier League in 2007 around the time the inaugural edition of the Twenty20 (T20) Cricket World Cup was taking place. T20 was the newest format of the game, fast paced and played over three hours as opposed to the other two formats which take a whole day or five days. The first season was played in the Indian summer in 2008 over 44 days featuring eight Indian city-based franchises owned by some of the countrys riches",
                        "images": [],
                        "rank": 3
                      },
                      {
                        "url": "https://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html",
                        "content": "Access Denied Access Denied You don't have permission to access \"http://www.business-standard.com/cricket/ipl/ipl-franchises-revenue-more-than-double-bcci-surplus-jumps-to-rs-5-120-cr-124090600893_1.html\" on this server. Reference #18.8ed70b17.1767067472.c07c3e1a https://errors.edgesuite.net/18.8ed70b17.1767067472.c07c3e1a",
                        "images": [],
                        "rank": 4
                      },
                      {
                        "url": "https://economictimes.indiatimes.com/news/sports/ipl-a-bigger-hit-revenues-surge/articleshow/116114612.cms",
                        "content": "IPL a bigger hit, revenues surge - The Economic Times Benchmarks Nifty 26,027.30 -19.66 FEATURED FUNDS Motilal Oswal Midcap Fund Direct-Growth 5Y Return 30.1 % Invest Now FEATURED FUNDS UTI Aggressive Hybrid Fund Regular Plan-Growth 5Y Return 17.42 % Invest Now Enter search text: News English Edition English Edition     | Today's ePaper My Watchlist Subscribe Sign In Home ETPrime Markets Market Data Masterclass IPO News Industry SME Politics Wealth MF Tech AI Careers Opinion NRI Panache More Menu India WPL IPL 2026 Economy Economy Dashboard Agriculture Finance Foreign Trade Indicators Infrastructure Policy Politics Newsblogs Elections Assembly Elections Bihar More Sports Science GST 2.0 Defence Web Stories International US News Global Trends Trump Action Tracker Canada News UK News Australia New Zealand Saudi Arabia UAE Singapore Hong Kong Business World News ET Explains Company Corporate Trends Industry Trending Entertainment Decoded Morning Brief Podcast ET Evoke Bengaluru News Pune News Mumbai News Environment Videos Latest News Most Read Most Shared Most Commented Business News News Sports IPL a bigger hit, revenues surge The Economic Times daily newspaper is available online now. Read Today's Paper IPL a bigger hit, revenues surge SECTIONS IPL a bigger hit, revenues surge By Javed Farooqui , ET Bureau Last Updated: Dec 09, 2024, 10:46:00 AM IST Rate Story Follow us Share Font Size Abc Small Abc Medium Abc Large Save Print Comment Synopsis The Indian Premier League (IPL) experienced remarkable financial growth in FY24, with the top 10 franchises more than doubling their combined revenue to 6,797 crore. A record-breaking media rights deal and lucrative sponsorships fueled this surge. Gujarat Titans led in revenue, closely followed by Mumbai Indians and Chennai Super Kings, while Punjab Kings emerged as the most profitable franchise. ANI IPL The Indian Premier League ( IPL ) is on a remarkable growth streak, with the top 10 franchises seeing their combined revenue more than double to 6,797 crore in FY24 from 3,082 crore in the previous year, according to financial data from Tofler. Experts attributed the surge to the leagues soaring commercial appeal, powered by smart media partnerships and lucrative sponsorship deals. The primary catalyst for growth was the record 48,390 crore media rights deal signed in 2022 between the Board of Control for Cricket in India (BCCI) and Disney Star and Viacom18, who have since combined to form JioStar. In addition to broadcasting revenue, the BCCI secured over 4,000 crore from multi-year sponsorship agreements with major brands, including Tata Group, My11Circle, Ceat , and AngelOne. According to a recent Brand Finance report, IPL's brand value has grown by 13% to reach $12 billion in 2024 compared to 2023, up from its $2 billion valuation in 2009. Notably, four franchisesChennai Super Kings (CSK), Mumbai Indians (MI), Royal Challengers Bangalore (RCB), and Kolkata Knight Riders (KKR)have crossed the $100 million mark in brand value. Live Events \"The three key drivers of growth for IPL teams are the central revenue pool, which includes media rights and sponsorship income, team-specific sponsorships, and gate revenue. In FY24, media rights income reached record levels, providing a substantial boost, said Ajimon Francis, managing director of Brand Finance India. Similarly, team sponsorships saw significant growth, contributing to increased financial stability. Additionally, gate revenue experienced a positive shift, driven by higher ticket prices and full capacity utilisation at stadiums, further enhancing overall revenue for IPL teams,\" he added. The financial performance of IPL franchises last fiscal marked a remarkable turnaround, with most teams reporting doubling of revenue and improved profitability. Leading the charge were Gujarat Titans (GT), MI, and CSK, who set new financial benchmarks, while Punjab Kings (PK) emerged as the most profitable franchise. GT, owned by CVC Capital",
                        "images": [],
                        "rank": 5
                      }
                    ],
                    "annotations": null
                  }
                ]
              }
            },
            "logs": "",
            "execution_time": "2025-12-30 09:34:25",
            "total_time": "7.35",
            "executed_variant": "CODE_1A"
          }
        }
      ],
      "input_tokens": 153,
      "output_tokens": 67,
      "total_tokens": 220,
      "last_tested": "2025-12-30T09:34:38.478170",
      "id": "T001"
    },
    {
      "description": "Extract structured data of IPL annual revenue from the research results.",
      "agent": "DistillerAgent",
      "agent_prompt": "From the research data in `ipl_annual_revenue_data_T001`, extract the annual revenue figures for each year (2008-2024) and organize them into a structured format suitable for analysis. Note any missing years or data gaps.",
      "reads": [
        "ipl_annual_revenue_data_T001"
      ],
      "writes": [
        "ipl_annual_revenue_table_T002"
      ],
      "status": "completed",
      "output": {
        "ipl_annual_revenue_table_T002": {
          "summary_bullets": [
            "2008: Gross Revenue: 645 crore, Net Profit: 51 crore. Title Sponsor: DLF (40 crore/year), Broadcaster: Sony-WSG (10-year deal worth $1.026 billion)",
            "2009-2012: Revenues held steady despite the 2009 season moving to South Africa.",
            "2013: Title Sponsor: PepsiCo (79.4 crore/year)",
            "2014-2015: Viewership and revenues remained stable despite part of the 2014 season being hosted in the UAE. Pepsi exited sponsorship in 2015.",
            "2016: Title Sponsor: Vivo (100 crore/year)",
            "2018: Media Rights (2018-2022): 16,347 crore, Average Annual Media Revenue: ~3,270 crore, Title Sponsor: Vivo (renewed for 439.8 crore/year)",
            "2021: Brand Value: ~$4.7 billion",
            "2023: Media Rights (2023-2027): 48,390 crore (~$6.2 billion). TV Rights (Star): 23,575 crore, Digital Rights (Viacom18): 20,500 crore, Per Match Value: 118 crore (~$14.5 million)",
            "2024: Top 10 franchises combined revenue more than doubled to 6,797 crore. IPL's brand value has grown by 13% to reach $12 billion. Four franchises (CSK, MI, RCB, KKR) have crossed the $100 million mark in brand value."
          ]
        },
        "cost": 0.0004755,
        "input_tokens": 3819,
        "output_tokens": 234,
        "total_tokens": 4053
      },
      "error": null,
      "cost": 2.01e-05,
      "start_time": "2025-12-23T06:42:43.660634",
      "end_time": "2025-12-23T06:42:45.052097",
      "execution_time": 1.391463,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "summary_unavailable": true,
            "cost": 2.01e-05,
            "input_tokens": 189,
            "output_tokens": 3,
            "total_tokens": 192
          }
        }
      ],
      "input_tokens": 189,
      "output_tokens": 3,
      "total_tokens": 192,
      "last_tested": "2025-12-30T09:35:43.831001",
      "id": "T002"
    },
    {
      "description": "Calculate the average annual revenue of IPL based on the extracted data.",
      "agent": "CoderAgent",
      "agent_prompt": "Calculate the average annual revenue of the Indian Premier League (IPL) based on the structured data in `ipl_annual_revenue_table_T002`. Handle any missing values appropriately. Output the average revenue with appropriate units.",
      "reads": [
        "ipl_annual_revenue_table_T002"
      ],
      "writes": [
        "average_ipl_annual_revenue_T003"
      ],
      "status": "completed",
      "output": {
        "code_variants": {
          "CODE_1A": "import pandas as pd\nimport re\n\ndef extract_revenue(text):\n    \"\"\"Extracts revenue in crore or billion (INR or USD) from text.\"\"\"\n    if not isinstance(text, str):\n        return None\n\n    # Convert text to lowercase for case-insensitive matching\n    text = text.lower()\n\n    # First look for 'crore' amounts:\n    crore_match = re.search(r'(\\d+(?:\\.\\d+)?)\\s*crore', text)\n    if crore_match:\n        return float(crore_match.group(1))\n\n    # Now look for billion amounts (USD or unspecified):\n    billion_match = re.search(r'~(\\d+(?:\\.\\d+)?)\\s*billion', text)\n    if billion_match:\n        return float(billion_match.group(1)) * 75  # Convert USD to INR (approx. 75 INR/USD)\n\n    return None\n\nrevenue_data = []\nfor item in ipl_annual_revenue_table_T002['summary_bullets']:\n    revenue = extract_revenue(item)\n    if revenue is not None:\n        revenue_data.append(revenue)\n\nif revenue_data:\n    average_revenue = pd.Series(revenue_data).mean()\n    average_revenue_formatted = f'{average_revenue:,.2f} Crore'\nelse:\n    average_revenue_formatted = \"No revenue data found.\"\n\n\nreturn {\"average_ipl_annual_revenue_T003\": average_revenue_formatted}"
        },
        "cost": 9.71e-05,
        "input_tokens": 319,
        "output_tokens": 163,
        "total_tokens": 482,
        "execution_result": {
          "average_ipl_annual_revenue_T003": "393.07 Crore"
        },
        "execution_status": "success",
        "execution_error": null,
        "execution_time": "2025-12-30 09:37:08",
        "executed_variant": "CODE_1A",
        "execution_logs": "",
        "average_ipl_annual_revenue_T003": "393.07 Crore"
      },
      "error": null,
      "cost": 0.000126,
      "start_time": "2025-12-23T06:42:45.057745",
      "end_time": "2025-12-23T06:42:54.698517",
      "execution_time": 9.640772,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "code_variants": {
              "CODE_1A": "import pandas as pd\n\n# Assuming ipl_annual_revenue_table_T002 is a list of dictionaries or a similar data structure\ndata = ipl_annual_revenue_table_T002\n\n# Convert the data to a Pandas DataFrame for easier handling\ndf = pd.DataFrame(data)\n\n# Assuming the revenue column is named 'Revenue' or similar, adjust as needed\n# Also, assuming the revenue is in millions or billions, specify the unit\nrevenue_column = 'Revenue'\n\n# Convert revenue column to numeric, handling errors by coercing invalid values to NaN\ndf[revenue_column] = pd.to_numeric(df[revenue_column], errors='coerce')\n\n# Fill NaN values with 0 or use a more sophisticated imputation method if needed\ndf[revenue_column] = df[revenue_column].fillna(0)\n\n# Calculate the average revenue\naverage_revenue = df[revenue_column].mean()\n\n# Determine the appropriate unit (Millions/Billions, etc.) and format the output\nunit = 'Millions'\nformatted_average_revenue = f'${average_revenue:,.2f} {unit}'\n\nprint(f'Average IPL Annual Revenue: {formatted_average_revenue}')\n\nreturn {'average_ipl_annual_revenue_T003': formatted_average_revenue}\n",
              "CODE_1B": "import pandas as pd\n\n# Assuming ipl_annual_revenue_table_T002 is a list of dictionaries\ndata = ipl_annual_revenue_table_T002\n\n# Create a Pandas DataFrame\ndf = pd.DataFrame(data)\n\n# Identify revenue column (adjust if different name)\nrevenue_column = 'Revenue'\n\n# Handle missing values by dropping rows with NaN in the revenue column\nddf = df.dropna(subset=[revenue_column])\n\n# Attempt to convert the revenue column to numeric\nddf[revenue_column] = pd.to_numeric(ddf[revenue_column], errors='coerce')\n\n# Drop any newly introduced NaNs after conversion\nddf = ddf.dropna(subset=[revenue_column])\n\n# Calculate the average revenue\naverage_revenue = ddf[revenue_column].mean()\n\n# Format with units\nunit = 'Millions'\nformatted_average_revenue = f'${average_revenue:,.2f} {unit}'\n\nprint(f'Average IPL Annual Revenue: {formatted_average_revenue}')\n\nreturn {'average_ipl_annual_revenue_T003': formatted_average_revenue}"
            },
            "cost": 0.000126,
            "input_tokens": 60,
            "output_tokens": 300,
            "total_tokens": 360
          },
          "execution_result": {
            "status": "success",
            "result": {
              "average_ipl_annual_revenue_T003": "393.07 Crore"
            },
            "raw": {
              "average_ipl_annual_revenue_T003": "393.07 Crore"
            },
            "logs": "",
            "execution_time": "2025-12-30 09:37:08",
            "total_time": "0.208",
            "executed_variant": "CODE_1A"
          }
        }
      ],
      "input_tokens": 60,
      "output_tokens": 300,
      "total_tokens": 360,
      "last_tested": "2025-12-30T09:37:35.044532",
      "id": "T003"
    },
    {
      "description": "Identify the highest and lowest revenue years for IPL.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the `ipl_annual_revenue_table_T002` to identify the year with the highest revenue and the year with the lowest revenue for the Indian Premier League (IPL). Provide the specific revenue figures for these years.",
      "reads": [
        "ipl_annual_revenue_table_T002"
      ],
      "writes": [
        "ipl_highest_revenue_year_T004",
        "ipl_lowest_revenue_year_T004"
      ],
      "status": "completed",
      "output": {
        "ipl_highest_revenue_year_T004": {
          "year": "2023",
          "revenue": "48,390 crore (Media Rights from 2023-2027)"
        },
        "ipl_lowest_revenue_year_T004": {
          "year": "2008",
          "revenue": "645 crore (Gross Revenue)"
        },
        "cost": 4.32e-05,
        "input_tokens": 324,
        "output_tokens": 27,
        "total_tokens": 351
      },
      "error": null,
      "cost": 3.64e-05,
      "start_time": "2025-12-23T06:42:45.059169",
      "end_time": "2025-12-23T06:42:54.699568",
      "execution_time": 9.640399,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "ipl_highest_revenue_year_T004": {
              "year": null,
              "revenue": null,
              "reason": "Data missing: Cannot determine the year with the highest revenue because the provided IPL annual revenue table is empty."
            },
            "ipl_lowest_revenue_year_T004": {
              "year": null,
              "revenue": null,
              "reason": "Data missing: Cannot determine the year with the lowest revenue because the provided IPL annual revenue table is empty."
            },
            "cost": 3.64e-05,
            "input_tokens": 64,
            "output_tokens": 75,
            "total_tokens": 139
          }
        }
      ],
      "input_tokens": 64,
      "output_tokens": 75,
      "total_tokens": 139,
      "last_tested": "2025-12-30T09:37:00.368723",
      "id": "T004"
    },
    {
      "description": "Summarize the IPL annual revenue data, including average, highest, and lowest revenue years.",
      "agent": "DistillerAgent",
      "agent_prompt": "Summarize the key findings regarding the Indian Premier League's (IPL) annual revenue. Include the average annual revenue from `average_ipl_annual_revenue_T003`, the highest revenue year from `ipl_highest_revenue_year_T004`, and the lowest revenue year from `ipl_lowest_revenue_year_T004`. Provide a concise overview of the IPL's financial performance.",
      "reads": [
        "average_ipl_annual_revenue_T003",
        "ipl_highest_revenue_year_T004",
        "ipl_lowest_revenue_year_T004"
      ],
      "writes": [
        "ipl_revenue_summary_T005"
      ],
      "status": "completed",
      "output": {
        "ipl_revenue_summary_T005": [
          "The IPL's average annual revenue is 393.07 Crore.",
          "The highest revenue year was 2023, with 48,390 crore (Media Rights from 2023-2027).",
          "The lowest revenue year was 2008, with 645 crore (Gross Revenue)."
        ],
        "cost": 3.32e-05,
        "input_tokens": 136,
        "output_tokens": 49,
        "total_tokens": 185
      },
      "error": null,
      "cost": 3.1400000000000004e-05,
      "start_time": "2025-12-23T06:42:54.703638",
      "end_time": "2025-12-23T06:42:58.774281",
      "execution_time": 4.070643,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "ipl_revenue_summary_T005": "Data missing: Cannot determine the IPL revenue summary because the provided IPL annual revenue table is empty. Unable to calculate average, highest, and lowest revenue years.",
            "cost": 3.1400000000000004e-05,
            "input_tokens": 154,
            "output_tokens": 40,
            "total_tokens": 194
          }
        }
      ],
      "input_tokens": 154,
      "output_tokens": 40,
      "total_tokens": 194,
      "last_tested": "2025-12-30T09:38:10.746651",
      "id": "T005"
    },
    {
      "description": "Format the IPL revenue summary into a human-readable report.",
      "agent": "FormatterAgent",
      "agent_prompt": "Format the IPL revenue summary from `ipl_revenue_summary_T005` into a comprehensive and human-readable report. Include the annual revenue table (`ipl_annual_revenue_table_T002`), the calculated average annual revenue (`average_ipl_annual_revenue_T003`), the years with the highest and lowest revenues (`ipl_highest_revenue_year_T004` and `ipl_lowest_revenue_year_T004`). Present the data in a visually appealing and easily understandable format.",
      "reads": [
        "ipl_revenue_summary_T005",
        "ipl_annual_revenue_table_T002",
        "average_ipl_annual_revenue_T003",
        "ipl_highest_revenue_year_T004",
        "ipl_lowest_revenue_year_T004"
      ],
      "writes": [
        "ipl_revenue_report_T006"
      ],
      "status": "completed",
      "output": {
        "final_format": "html",
        "fallback_markdown": "Comprehensive report on IPL Revenue.",
        "formatted_report_T006": "<div class='report'>\n  <h1>Indian Premier League (IPL) Annual Revenue Report</h1>\n\n  <h2>Executive Summary</h2>\n  <p>This report provides an overview of the Indian Premier League's (IPL) revenue, highlighting key trends and financial milestones from its inception in 2008 to the present day. The IPL has demonstrated remarkable growth, evolving into a multi-billion dollar sports league with significant impact on the global cricket economy.</p>\n\n  <h2>Key Revenue Statistics</h2>\n  <ul>\n    <li><b>Average Annual Revenue:</b> 393.07 Crore</li>\n    <li><b>Highest Revenue Year:</b> 2023, with 48,390 crore (Media Rights from 2023-2027)</li>\n    <li><b>Lowest Revenue Year:</b> 2008, with 645 crore (Gross Revenue)</li>\n  </ul>\n\n  <h2>IPL Revenue Over the Years</h2>\n  <p>The following provides a summary of IPL's revenue milestones by year:</p>\n  <ul>\n    <li><b>2008:</b> Gross Revenue: 645 crore, Net Profit: 51 crore. Title Sponsor: DLF (40 crore/year), Broadcaster: Sony-WSG (10-year deal worth $1.026 billion)</li>\n    <li><b>2009-2012:</b> Revenues held steady despite the 2009 season moving to South Africa.</li>\n    <li><b>2013:</b> Title Sponsor: PepsiCo (79.4 crore/year)</li>\n    <li><b>2014-2015:</b> Viewership and revenues remained stable despite part of the 2014 season being hosted in the UAE. Pepsi exited sponsorship in 2015.</li>\n    <li><b>2016:</b> Title Sponsor: Vivo (100 crore/year)</li>\n    <li><b>2018:</b> Media Rights (2018-2022): 16,347 crore, Average Annual Media Revenue: ~3,270 crore, Title Sponsor: Vivo (renewed for 439.8 crore/year)</li>\n    <li><b>2021:</b> Brand Value: ~$4.7 billion</li>\n    <li><b>2023:</b> Media Rights (2023-2027): 48,390 crore (~$6.2 billion). TV Rights (Star): 23,575 crore, Digital Rights (Viacom18): 20,500 crore, Per Match Value: 118 crore (~$14.5 million)</li>\n    <li><b>2024:</b> Top 10 franchises combined revenue more than doubled to 6,797 crore. IPL's brand value has grown by 13% to reach $12 billion. Four franchises (CSK, MI, RCB, KKR) have crossed the $100 million mark in brand value.</li>\n  </ul>\n\n  <h2>Revenue Drivers</h2>\n  <p>IPL revenue is primarily driven by the following factors:</p>\n  <ul>\n    <li><b>Media Rights:</b> Broadcasting and digital rights contribute significantly to the overall revenue.</li>\n    <li><b>Sponsorships:</b> Title sponsors and other brand partnerships provide substantial income.</li>\n    <li><b>Franchise Revenue:</b> Includes central revenue pool, team-specific sponsorships, and gate revenue.</li>\n    <li><b>Brand Value:</b> Increased brand value attracts more sponsors and media attention.</li>\n  </ul>\n\n  <h2>Historical Context and Growth</h2>\n  <p>The IPL was launched in 2008 by the Board of Control for Cricket in India (BCCI).  It quickly evolved into one of the most profitable sporting leagues globally, rivaling the NFL, NBA, and Premier League. The league has seen exponential growth in broadcasting rights, sponsorship deals, and franchise valuations.</p>\n\n  <h2>Franchise Performance</h2>\n  <p>In FY24, the top 10 franchises more than doubled their combined revenue to 6,797 crore.  Chennai Super Kings (CSK), Mumbai Indians (MI), Royal Challengers Bangalore (RCB), and Kolkata Knight Riders (KKR) have crossed the $100 million mark in brand value.</p>\n\n  <h2>Factors Contributing to Recent Growth (FY24)</h2>\n  <ul>\n      <li><b>Record Media Rights Deal:</b> The 48,390 crore media rights deal signed in 2022 between the BCCI and Disney Star and Viacom18 (now JioStar) was a primary driver.</li>\n      <li><b>Lucrative Sponsorships:</b> Over 4,000 crore secured from multi-year sponsorships with major brands.</li>\n      <li><b>Increased Gate Revenue:</b> Higher ticket prices and full capacity utilization at stadiums.</li>\n   </ul>\n\n  <h2>Brand Valuation</h2>\n  <p>A recent Brand Finance report indicates that IPL's brand value has grown by 13% to reach $12 billion in 2024, compared to its $2 billion valuation in 2009.</p>\n</div>",
        "call_self": false,
        "cost": 0.0007558,
        "input_tokens": 4482,
        "output_tokens": 769,
        "total_tokens": 5251
      },
      "error": null,
      "cost": 0.0001426,
      "start_time": "2025-12-23T06:42:58.780714",
      "end_time": "2025-12-23T06:43:05.035069",
      "execution_time": 6.254355,
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "final_format": "html",
            "fallback_markdown": "# IPL Revenue Report\n\nData is missing, unable to generate a comprehensive report.",
            "formatted_report_T006": "<div class='report'>\n  <h1>IPL Revenue Report</h1>\n\n  <h2>Overview</h2>\n  <p>Data is missing, unable to generate a comprehensive report. The following sections would be included if the data was available:</p>\n\n  <h2>Annual Revenue Table</h2>\n  <p>No data available to display the annual revenue table.</p>\n\n  <h2>Average Annual Revenue</h2>\n  <p>No data available to calculate and display the average annual revenue.</p>\n\n  <h2>Year with Highest Revenue</h2>\n  <p><b>Reason:</b> Data missing: Cannot determine the year with the highest revenue because the provided IPL annual revenue table is empty.</p>\n\n  <h2>Year with Lowest Revenue</h2>\n  <p><b>Reason:</b> Data missing: Cannot determine the year with the lowest revenue because the provided IPL annual revenue table is empty.</p>\n\n  <h2>Data Sources</h2>\n  <p>The data sources used to compile this report were:</p>\n  <ul>\n    <li>ipl_annual_revenue_data_T001</li>\n  </ul>\n\n  <h2>Data Quality Issues</h2>\n  <p>The `ipl_annual_revenue_table_T002` is empty, leading to inability to derive any revenue insights. The URLs fetched for `ipl_annual_revenue_data_T001` contain only error messages.</p>\n\n</div>",
            "call_self": false,
            "cost": 0.0001426,
            "input_tokens": 490,
            "output_tokens": 234,
            "total_tokens": 724
          }
        }
      ],
      "input_tokens": 490,
      "output_tokens": 234,
      "total_tokens": 724,
      "last_tested": "2025-12-30T09:38:28.541778",
      "id": "T006"
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "Query"
    },
    {
      "source": "Query",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    },
    {
      "source": "T002",
      "target": "T004"
    },
    {
      "source": "T003",
      "target": "T005"
    },
    {
      "source": "T004",
      "target": "T005"
    },
    {
      "source": "T005",
      "target": "T006"
    }
  ]
}